{
    "Informationsource": "BSI GSK 2023",
    "name": "DER.3.2 Revisionen auf Basis des Leitfadens IS-Revision",
    "handle": "DER.3.2",
    "text": "Der Baustein definiert Anforderungen an eine IS-Revision mit dem Ziel, die Informationssicherheit in einer Institution zu verbessern, Fehlentwicklungen auf diesem Gebiet zu vermeiden und die Sicherheitsmaßnahmen und -prozesse zu optimieren.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Verstoß gegen die Vorgaben des UP Bund",
            "handle": "2.1",
            "text": "Der „Umsetzungsplan für die Gewährleistung der IT-Sicherheit in der Bundesverwaltung“ (UP Bund 2017) ist als Leitlinie für Informationssicherheit in der Bundesverwaltung festgelegt. Somit befinden sich Bundesbehörden in einem ressortübergreifenden Management für Informationssicherheit, bei dem jede Behörde dafür verantwortlich ist, ihr spezifisches Sicherheitskonzept zu erstellen und umzusetzen. Nicht nur die Behörden des Bundes, sondern auch andere Institutionen können durch gesetzliche, vertragliche oder anderweitige Regelungen verpflichtet sein, den UP Bund 2017 umzusetzen. Der UP Bund 2017 legt dabei ausdrücklich fest, dass die Standards des BSI zur Informationssicherheit und zum IT-Grundschutz sowie die darin beschriebene Vorgehensweise der Standard-Absicherung als Mindestanforderung umgesetzt werden müssen. Weiterhin legt der UP Bund 2017 verbindlich fest, dass alle verpflichteten Institutionen den Stand des eigenen ISMS, z. B. durch eine geeignete IS-Revision, regelmäßig überprüfen und dabei den „Leitfaden für die Informationssicherheitsrevision“ anwenden müssen. Geschieht dies nicht, verstoßen diese Institutionen gegen die Vorgaben des UP Bund.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Aussetzen von Sicherheitsmaßnahmen",
            "handle": "2.2",
            "text": "Das Sicherheitsniveau von Institutionen wird davon beeinflusst, ob Sicherheitsmaßnahmen vollständig und korrekt umgesetzt werden. Insbesondere in der kritischen Phase von Projekten oder unter bestimmten Rahmenbedingungen werden Sicherheitsmaßnahmen häufig temporär ausgesetzt. Teilweise wird dann jedoch vergessen, sie wieder zu reaktivieren, sodass ein zu niedriges Sicherheitsniveau bestehen bleibt.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Wirkungslose oder nicht wirtschaftliche Umsetzung von Sicherheitsmaßnahmen",
            "handle": "2.3",
            "text": "Werden Sicherheitsmaßnahmen umgesetzt, ohne dabei vorhandene Praxisaspekte zu berücksichtigen, sind diese Maßnahmen unter Umständen wirkungslos. So ist es zum Beispiel sinnlos, einen Eingangsbereich mit Drehkreuzen abzusperren, wenn die Mitarbeitenden das Gebäude stattdessen durch einen offenen Seiteneingang betreten können. Ebenso kann es passieren, dass Einzelmaßnahmen ergriffen werden, die wirtschaftlich nicht sinnvoll sind. So ist für den Schutz von Informationen mit einem normalen Schutzbedarf bezüglich der Vertraulichkeit ein angemessen implementiertes Rechte- und Rollenkonzept sinnvoller und wirtschaftlicher als der Aufbau einer komplexen, zertifikatsbasierten Verschlüsselung auf dem Fileserver.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Umsetzung des Managementsystems für Informationssicherheit",
            "handle": "2.4",
            "text": "In vielen Institutionen überprüft der oder die ISB selbst, ob Sicherheitsmaßnahmen umgesetzt werden. Oft wird in diesem Zusammenhang die Prüfung des eigentlichen ISMS vergessen, da der oder die ISB als Teil des ISMS nicht unparteilich ist. Folglich könnten die Prozesse eines ISMS ineffizient oder nicht angemessen umgesetzt worden sein, was zu einem ungewollt niedrigen Sicherheitsniveau der Institution geführt haben könnte.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Qualifikation des Prüfteams",
            "handle": "2.5",
            "text": "Ist das Prüfteam nicht ausreichend qualifiziert oder bereitet sich ungenügend auf die Prüfungen vor, kann es während einer IS-Revision eventuell den Sicherheitszustand einer Institution falsch einschätzen. Unter Umständen empfiehlt es dann in seinem Prüfbericht nicht die nötigen oder sogar die falschen Korrekturmaßnahmen. In diesem Fall kann es passieren, dass die Informationen unwirtschaftlich oder sehr risikobehaftet geschützt werden.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Befangenheit interner IS-Revisionsteams",
            "handle": "2.6",
            "text": "Innerhalb von Institutionen können IS-Revisionsteams aus internem Personal gebildet werden. Sind diese Teams nicht ausreichend von anderen Abläufen abgegrenzt, könnten sie beeinflusst oder befangen sein. Dies ist insbesondere dann der Fall, wenn Mitglieder des IS-Revisionsteams an der Planung oder Umsetzung des ISMS beteiligt sind oder waren.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlende langfristige Planung",
            "handle": "2.7",
            "text": "Werden IS-Revisionen nicht langfristig und zentral geplant, kann es passieren, dass einzelne Organisationseinheiten einer Institution sehr häufig und andere überhaupt nicht geprüft werden. Auch ist es möglich, dass Veränderungen am ISMS nicht ausreichend untersucht werden, wenn Prüfungen nur unregelmäßig durchgeführt werden. In diesem Fall ist es nur sehr schwer oder gar nicht möglich, den Sicherheitszustand des gesamten Informationsverbunds geeignet zu bewerten.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Mangelhafte Planung und Abstimmung bei der Durchführung von IS-Revisionen",
            "handle": "2.8",
            "text": "Wenn eine IS-Revision mangelhaft geplant und nicht mit dem zuständigen Personal der Institution abgestimmt wurde, sind während der Vor-Ort-Prüfung eventuell nicht die richtigen Personen verfügbar. Folglich lassen sich möglicherweise einzelne Bereiche überhaupt nicht prüfen. Auch wenn die Termine für die Prüfung der einzelnen Bereiche zu eng gesetzt wurden und nicht genügend Zeit eingeplant wurde, könnte es passieren, dass die Institution nur oberflächlich geprüft wird.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlende Abstimmung mit der Personalvertretung",
            "handle": "2.9",
            "text": "Im Rahmen von IS-Revisionen können auch Aspekte geprüft werden, aus denen Rückschlüsse gezogen werden könnten, wie sich Personen bei ihrer Arbeit verhalten und wie leistungsfähig sie sind. Somit könnten diese Prüfungen als Verhaltens- und Leistungskontrolle gewertet werden. Wird die Personalvertretung nicht mit einbezogen, kann die Vor-Ort-Prüfung verzögert oder sogar abgebrochen werden.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ab Absichtliches Verschweigen von Abweichungen oder Problemen",
            "handle": "2.10",
            "text": "Personen könnten befürchten, dass bei einer IS-Revison ihre eigenen Fehler aufgedeckt werden. Um dies zu vermeiden, könnten sie Sicherheitsprobleme kaschieren und so ein falsches Bild über den tatsächlichen Sicherheitsstand vermitteln. So blieben Sicherheitsmängel unentdeckt und könnten nicht korrigiert werden. Darüber hinaus könnte die Institutionsleitung das mit diesem Sicherheitsmangel einhergehende Risiko falsch einschätzen.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Vertraulichkeitsverlust von schützenswerten Informationen",
            "handle": "2.11",
            "text": "Während einer IS-Revision werden vertrauliche Informationen (z. B. Schwachstellen und Angriffsmöglichkeiten) durch das IS-Revisionsteam erhoben. Auch werden gegebenenfalls Defizite in der Informationssicherheit der geprüften Institution benannt. Werden diese Mängel unberechtigten Dritten bekannt, könnten sie dazu benutzt werden, die Institution anzugreifen oder in einen schlechten Ruf zu bringen.",
            "exploitedBy_examples": [],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Benennung von Verantwortlichen für die IS-Revision",
            "handle": "DER.3.2.A1",
            "level": "Low",
            "affects": [],
            "text": "Die Institution MUSS eine verantwortliche Person für die IS-Revision benennen. Diese MUSS die IS-Revisionen planen, initiieren und die Ergebnisse nachverfolgen.",
            "isresponsible": "Institutionsleitung",
            "mitigates": [
                "G 0.18",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines IS-Revisionshandbuches",
            "handle": "DER.3.2.A2",
            "level": "Low",
            "affects": [],
            "text": "Für die IS-Revision MUSS ein IS-Revisionshandbuch erstellt werden, das die angestrebten Ziele, einzuhaltende gesetzliche Vorgaben, Informationen über die Organisation, die Ressourcen und die Rahmenbedingungen enthält. Außerdem MUSS darin die Archivierung der Dokumentation beschrieben sein. Das Handbuch MUSS von der Leitungsebene verabschiedet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Definition der Prüfungsgrundlage",
            "handle": "DER.3.2.A3",
            "level": "Low",
            "affects": [],
            "text": "Die BSI-Standards 200-1 bis 200-3 sowie das IT-Grundschutz-Kompendium MÜSSEN die Prüfungsgrundlagen für die IS-Revision sein. Dabei SOLLTE die Standard-Absicherung des IT-Grundschutzes verwendet werden. Diese Prüfungsgrundlagen MÜSSEN allen Beteiligten bekannt sein.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung einer Planung für die IS-Revision",
            "handle": "DER.3.2.A4",
            "level": "Low",
            "affects": [],
            "text": "Wenn die Institution nicht nach ISO 27001 auf Basis von IT-Grundschutz zertifiziert ist, MUSS sichergestellt werden, dass mindestens alle drei Jahre eine IS-Kurz- oder Querschnitts-Revision durchgeführt wird. Darüber hinaus SOLLTEN weitere Revisionen eingeplant werden, falls der Informationsverbund wesentlich verändert wird. Es SOLLTE eine mehrjährige Grobplanung für die Revisionsvorhaben erstellt werden. Diese SOLLTE dann durch eine jährliche Detailplanung konkretisiert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Auswahl eines geeigneten IS-Revisionsteams",
            "handle": "DER.3.2.A5",
            "level": "Low",
            "affects": [],
            "text": "Es MUSS ein aus mindestens zwei Personen bestehendes IS-Revisionsteam zusammengestellt oder beauftragt werden. Dem IS-Revisionsteam MUSS ein uneingeschränktes Informations- und Einsichtnahmerecht für seine Tätigkeit eingeräumt werden. Bei eigenen IS-Revisionsteams MÜSSEN die einzelnen Mitglieder unparteilich sein. Die Mitglieder eines IS-Revisionsteams DÜRFEN NICHT an der Planung oder Umsetzung des ISMS beteiligt sein oder gewesen sein.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vorbereitung einer IS-Revision",
            "handle": "DER.3.2.A6",
            "level": "Low",
            "affects": [],
            "text": "Es MUSS ein IS-Revisionsteam mit einer IS-Revision beauftragt werden. Das IS-Revisionsteam MUSS festlegen, welche Referenzdokumente für eine IS-Revision benötigt werden. Die zu prüfende Institution MUSS das Sicherheitskonzept und alle weiteren erforderlichen Dokumente an das IS-Revisionsteam übergeben.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung einer IS-Revision",
            "handle": "DER.3.2.A7",
            "level": "Low",
            "affects": [],
            "text": "Im Rahmen einer IS-Revision MÜSSEN eine Dokumenten- und eine Vor-Ort-Prüfung durch das IS-Revisionsteam durchgeführt werden. Sämtliche Ergebnisse dieser beiden Prüfungen MÜSSEN dokumentiert und in einem IS-Revisionsbericht zusammengefasst werden. Bevor erstmalig eine IS-Querschnittsrevision durchgeführt wird, MUSS als IS-Revisionsverfahren eine IS-Kurzrevision ausgewählt werden. Die IS-Kurzrevision MUSS mit positivem Votum abgeschlossen werden, bevor eine IS-Querschnittsrevision durchgeführt wird.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Aufbewahrung von IS-Revisionsberichten",
            "handle": "DER.3.2.A8",
            "level": "Low",
            "affects": [],
            "text": "Die Institution MUSS den IS-Revisionsbericht und die diesem zugrundeliegenden Referenzdokumente mindestens für zehn Jahre ab Zustellung des Berichts sicher aufbewahren, sofern keine anders lautenden Gesetze oder Verordnungen gelten. Die Institution MUSS sicherstellen, dass lediglich berechtigte Personen auf die IS-Revisionsberichte und die Referenzdokumente zugreifen können.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Integration in den Informationssicherheitsprozess",
            "handle": "DER.3.2.A9",
            "level": "Medium",
            "affects": [],
            "text": "Die Institution SOLLTE sicherstellen, dass IS-Revisionen ein Teil des Sicherheitsprozesses sind. Außerdem SOLLTEN die Ergebnisse von IS-Revisionen in das ISMS zurückfließen und zu dessen Verbesserung beitragen. Weiter SOLLTEN die Ergebnisse der IS-Revisionen sowie die Aktivitäten, um Mängel zu beseitigen und um die Qualität zu verbessern, in den regelmäßigen Bericht des oder der ISB an die Institutionsleitung aufgenommen werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Kommunikationsabsprache",
            "handle": "DER.3.2.A10",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE klar geregelt werden, wie Informationen zwischen dem IS-Revisionsteam und der zu prüfenden Institution auszutauschen sind. So SOLLTE sichergestellt werden, dass diese Informationen vertraulich und integer bleiben.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.19",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung eines Auftaktgesprächs für eine IS-Querschnittsrevision",
            "handle": "DER.3.2.A11",
            "level": "Medium",
            "affects": [],
            "text": "Für eine IS-Querschnittsrevision SOLLTE ein Auftaktgespräch zwischen dem IS-Revisionsteam und der zu prüfenden Institution durchgeführt werden. Darin SOLLTEN folgende Inhalte besprochen werden: \n• Die Erläuterung und Darstellung des IS-Revisionsverfahrens, \n• die Vorstellung der Institution (Arbeitsschwerpunkte und Überblick der eingesetzten IT) sowie \n• die Übergabe der Referenzdokumente an das IS-Revisionsteam.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines Prüfplans",
            "handle": "DER.3.2.A12",
            "level": "Medium",
            "affects": [],
            "text": "Vor einer IS-Revision SOLLTE das IS-Revisionsteam einen Prüfplan erstellen. Ist es während der IS-Revision notwendig, die geplanten Abläufe zu erweitern oder anderweitig anzupassen, SOLLTE der Prüfplan entsprechend angepasst werden. Der Prüfplan SOLLTE zudem in den abschließenden IS-Revisionsbericht aufgenommen werden. Bei der IS-Kurzrevision SOLLTE die verbindlich festgelegte Prüfthemenliste des BSI an die Stelle des Prüfplans treten.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichtung und Prüfung der Dokumente",
            "handle": "DER.3.2.A13",
            "level": "Medium",
            "affects": [],
            "text": "Bei der Dokumentenprüfung SOLLTE das IS-Revisionsteam die im Prüfplan festgelegten Anforderungen prüfen. Das IS-Revisionsteam SOLLTE überprüfen, ob alle relevanten Dokumente aktuell und vollständig sind. Bei der Prüfung auf Aktualität SOLLTE die Granularität der Dokumente berücksichtigt werden. Es SOLLTE darauf geachtet werden, dass alle wesentlichen Aspekte erfasst und geeignete Rollen zugewiesen wurden. Weiter SOLLTE geprüft werden, ob die vorliegenden Dokumente und die darin getroffenen Entscheidungen nachvollziehbar sind. Die Ergebnisse der Dokumentenprüfung SOLLTEN dokumentiert werden und, soweit sinnvoll, in die Vor-Ort-Prüfung einfließen.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Auswahl der Zielobjekte und der zu prüfenden Anforderungen",
            "handle": "DER.3.2.A14",
            "level": "Medium",
            "affects": [],
            "text": "In einer IS-Querschnittsrevision oder IS-Partialrevision SOLLTE das IS-Revisionsteam anhand der Ergebnisse der Dokumentenprüfung die Baustein-Zielobjekte für die Vor-Ort-Prüfung auswählen. Der Baustein zum Informationssicherheitsmanagement (siehe ISMS.1 Sicherheitsmanagement) des IT-Grundschutz-Kompendiums einschließlich aller zugehörigen Anforderungen SOLLTE jedoch immer vollständig geprüft werden. Weitere dreißig Prozent der modellierten Baustein-Zielobjekte SOLLTEN risikoorientiert zur Prüfung ausgewählt werden. Die Auswahl SOLLTE nachvollziehbar dokumentiert werden. Von den so ausgewählten Baustein-Zielobjekten SOLLTEN dreißig Prozent der jeweiligen Anforderungen bei der IS-Revision geprüft werden. Darüber hinaus SOLLTEN bei der Auswahl der zu prüfenden Baustein-Zielobjekte die bemängelten Anforderungen aus vorhergehenden IS-Revisionen berücksichtigt werden. Alle Anforderungen mit schwerwiegenden Sicherheitsmängeln aus vorhergehenden IS-Revisionen SOLLTEN mit geprüft werden.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Auswahl von geeigneten Prüfmethoden",
            "handle": "DER.3.2.A15",
            "level": "Medium",
            "affects": [],
            "text": "Das IS-Revisionsteam SOLLTE sicherstellen, dass geeignete Prüfmethoden eingesetzt werden, um die zu prüfenden Sachverhalte zu ermitteln. Alle Prüfungen SOLLTEN verhältnismäßig sein.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines Ablaufplans für die Vor-Ort-Prüfung",
            "handle": "DER.3.2.A16",
            "level": "Medium",
            "affects": [],
            "text": "Gemeinsam mit der zu prüfenden Institution SOLLTE das IS-Revisionsteam einen Ablaufplan für die Vor-Ort-Prüfung erarbeiten. Die Ergebnisse SOLLTEN zusammen mit dem IS-Prüfplan dokumentiert werden.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung der Vor-Ort-Prüfung",
            "handle": "DER.3.2.A17",
            "level": "Medium",
            "affects": [],
            "text": "Bei der Vor-Ort-Prüfung SOLLTE das IS-Revisionsteam untersuchen und feststellen, ob die ausgewählten Maßnahmen die Anforderungen des IT-Grundschutzes angemessen und praxistauglich erfüllen. Die Prüfung SOLLTE mit einem Eröffnungsgespräch beginnen. Danach SOLLTEN alle für die Prüfung ausgewählten Anforderungen des Prüfplans bzw. alle Themenfelder der Prüfthemenliste überprüft werden. Dafür SOLLTEN die vorgesehenen Prüfmethoden angewandt werden. Werden bei einer ausgewählten Stichprobe Abweichungen zum dokumentierten Status festgestellt, SOLLTE die Stichprobe bedarfsorientiert erweitert werden, bis der Sachverhalt geklärt ist. Während der Vor-Ort-Prüfung SOLLTEN das IS-Revisionsteam niemals aktiv in IT-Systeme eingreifen und auch keine Handlungsanweisungen zu Änderungen am Revisionsgegenstand erteilen. Alle wesentlichen Sachverhalte und Angaben zu Quellen-, Auskunfts- und Vorlage-Ersuchen sowie durchgeführten Besprechungen SOLLTEN schriftlich festgehalten werden. In einem Abschlussgespräch SOLLTE das IS-Revisionsteam der geprüften Institution wesentliche Feststellungen kurz darstellen. Dabei SOLLTE das IS-Revisionsteam die Feststellungen nicht konkret bewerten, sondern Hinweise auf etwaige Mängel und die weitere Verfahrensweise geben. Auch dieses Abschlussgespräch SOLLTE protokolliert werden.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung von Interviews",
            "handle": "DER.3.2.A18",
            "level": "Medium",
            "affects": [],
            "text": "Interviews durch das IS-Revisionsteam SOLLTEN strukturiert erfolgen. Fragen SOLLTEN knapp, präzise und leicht verständlich formuliert werden. Zudem SOLLTEN geeignete Fragetechniken eingesetzt werden.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Überprüfung der gewählten Risikobehandlungsoptionen",
            "handle": "DER.3.2.A19",
            "level": "Medium",
            "affects": [],
            "text": "Das IS-Revisionsteam SOLLTE prüfen, ob die verbleibenden Restrisiken für den Informationsverbund angemessen und tragbar sind und ob sie verbindlich durch die Institutionsleitung getragen werden. Das IS-Revisionsteam SOLLTE stichprobenartig verifizieren, ob bzw. inwieweit die gewählten Risikobehandlungsoptionen umgesetzt sind.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Nachbereitung der Vor-Ort-Prüfung",
            "handle": "DER.3.2.A20",
            "level": "Medium",
            "affects": [],
            "text": "Nach der Vor-Ort-Prüfung SOLLTEN die erhobenen Informationen weiter durch das IS-Revisionsteam konsolidiert und ausgewertet werden. Nachdem die eventuell nachgeforderten Dokumente, Dokumentationen und zusätzlichen Informationen ausgewertet wurden, SOLLTEN die geprüften Anforderungen endgültig bewertet werden.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines IS-Revisionsberichts",
            "handle": "DER.3.2.A21",
            "level": "Medium",
            "affects": [],
            "text": "Das IS-Revisionsteam SOLLTE die gewonnenen Ergebnisse in einen IS-Revisionsbericht überführen und dort nachvollziehbar dokumentieren. Eine Entwurfsversion des Berichts SOLLTE der geprüften Institution vorab übermittelt werden. Es SOLLTE verifiziert werden, ob die durch das IS-Revisionsteam festgestellten Sachverhalte richtig aufgenommen wurden. Die geprüfte Institution SOLLTE sicherstellen, dass alle betroffenen Stellen in der Institution innerhalb einer angemessenen Frist die für sie wichtigen und notwendigen Passagen des IS-Revisionsberichts erhalten. Insbesondere SOLLTEN die Inhalte an die Institutionsleitung, an die Verantwortlichen für die IS-Revision sowie den oder die ISB kommuniziert werden. IS-Revisionsberichte SOLLTEN aufgrund der enthaltenen schützenswerten Informationen mit einer geeigneten Vertraulichkeitseinstufung versehen werden. Es SOLLTE überlegt werden, die Ergebnisse der IS-Revision der Institutionsleitung vom IS-Revisionsteam in Form einer Präsentation vorzustellen.",
            "isresponsible": "IS-Revisionsteam",
            "mitigates": [
                "G 0.18",
                "G 0.29",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Nachbereitung einer IS-Revision",
            "handle": "DER.3.2.A22",
            "level": "Medium",
            "affects": [],
            "text": "Die im IS-Revisionsbericht festgestellten Abweichungen SOLLTEN in einer angemessenen Zeit durch die Institution korrigiert werden. Die durchzuführenden Korrekturmaßnahmen SOLLTEN mit Zuständigkeiten, Umsetzungstermin und dem jeweiligen Status dokumentiert sein. Die Umsetzung SOLLTE kontinuierlich nachverfolgt und der Umsetzungsstatus fortgeschrieben werden. Grundsätzlich SOLLTE geprüft werden, ob ergänzende IS-Revisionen notwendig sind. Die Institution SOLLTE die Grob- und Detailplanung zur IS-Revision anpassen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        }
    ]
}