{
    "Informationsource": "BSI GSK 2023",
    "name": "NET.3.1 Router und Switches",
    "handle": "NET.3.1",
    "text": "Router und Switches bilden das Rückgrat heutiger Datennetze. Ein Ausfall eines oder mehrerer dieser Geräte kann zum kompletten Stillstand der gesamten IT-Infrastruktur führen. Sie müssen daher besonders abgesichert werden.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Distributed Denial of Service (DDoS)",
            "handle": "DDoS",
            "text": "Bei einem DDoS-Angriff auf ein geschütztes Netz, beispielsweise per TCP SYN Flooding oder UDP Packet Storm, kann aufgrund der vielen Netzverbindungen, die verarbeitet werden müssen, der Router ausfallen. Das kann dazu führen, dass bestimmte Dienste im Local Area Network (LAN) nicht mehr verfügbar sind oder das gesamte LAN ausfällt.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "DDoS-Angriff",
                    "type": "Threat",
                    "text": "Ein DDoS-Angriff kann dazu führen, dass der Router ausfällt und bestimmte Dienste im LAN nicht mehr verfügbar sind oder das gesamte LAN ausfällt."
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Manipulation",
            "handle": "Manipulation",
            "text": "Gelingt es Angreifenden, unberechtigt auf einen Router oder Switch zuzugreifen, können sie die Geräte neu konfigurieren oder auch zusätzliche Dienste starten. Die Konfiguration lässt sich beispielsweise so verändern, dass Dienste, Clients oder ganze Netzsegmente geblockt werden. Gleichzeitig kann so Netzverkehr am Switch abgefangen, gelesen oder manipuliert werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Manipulation eines Routers oder Switches",
                    "type": "Threat",
                    "text": "Angreifende können unberechtigt auf einen Router oder Switch zugreifen und die Geräte neu konfigurieren oder zusätzliche Dienste starten. Sie können die Konfiguration so verändern, dass Dienste, Clients oder ganze Netzsegmente geblockt werden. Gleichzeitig können sie Netzverkehr am Switch abfangen, lesen oder manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlerhafte Konfiguration eines Routers oder Switches",
            "handle": "Fehlerhafte Konfiguration",
            "text": "Router und Switches werden mit einer Standardkonfiguration ausgeliefert, in der viele Dienste aktiviert sind. Auch verraten Login-Banner beispielsweise die Modell- und Versionsnummer des Gerätes. Werden Router und Switches mit unsicheren Werkseinstellungen produktiv eingesetzt, kann einfacher unberechtigt auf sie zugegriffen werden. Im schlimmsten Fall sind dadurch interne Dienste für Angreifende erreichbar.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausnutzung einer unsicheren Standardkonfiguration",
                    "type": "Threat",
                    "text": "Angreifende können Router und Switches mit unsicheren Werkseinstellungen ausnutzen, um unberechtigt auf sie zuzugreifen. Dadurch können interne Dienste für Angreifende erreichbar werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlerhafte Planung und Konzeption",
            "handle": "Fehlerhafte Planung",
            "text": "Viele Institutionen planen und konzipieren den Einsatz von Routern und Switches fehlerhaft. So werden unter anderem Geräte beschafft, die nicht ausreichend dimensioniert sind, z. B. hinsichtlich der Port-Anzahl oder der Leistung. In der Folge kann ein Router oder Switch bereits überlastet sein, wenn er zum ersten Mal eingesetzt wird. Dadurch sind eventuell Dienste oder ganze Netze nicht erreichbar und der Fehler muss aufwendig korrigiert werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überlastung eines Routers oder Switches",
                    "type": "Threat",
                    "text": "Ein Router oder Switch kann überlastet sein, wenn er zum ersten Mal eingesetzt wird, weil er nicht ausreichend dimensioniert wurde. Dadurch sind eventuell Dienste oder ganze Netze nicht erreichbar und der Fehler muss aufwendig korrigiert werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Inkompatible aktive Netzkomponenten",
            "handle": "Inkompatible Komponenten",
            "text": "Kompatibilitätsprobleme können insbesondere dann entstehen, wenn bestehende Netze um aktive Netzkomponenten anderer Firmen ergänzt oder wenn Netze mit Netzkomponenten unterschiedlicher Firmen betrieben werden. Werden aktive Netzkomponenten mit unterschiedlichen Implementierungen desselben Kommunikationsverfahrens gemeinsam in einem Netz betrieben, können einzelne Teilbereiche des Netzes, bestimmte Dienste oder sogar das gesamte Netz ausfallen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausfall durch inkompatible Netzkomponenten",
                    "type": "Threat",
                    "text": "Wenn aktive Netzkomponenten mit unterschiedlichen Implementierungen desselben Kommunikationsverfahrens gemeinsam in einem Netz betrieben werden, können einzelne Teilbereiche des Netzes, bestimmte Dienste oder sogar das gesamte Netz ausfallen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "MAC-Flooding",
            "handle": "MAC-Flooding",
            "text": "Beim MAC-Flooding schicken Angreifende viele Anfragen mit wechselnden Quell-MAC-Adressen an einen Switch. Sobald der Switch dann die Limits der MAC-Adressen, die er speichern kann, erreicht hat, fängt er an, sämtliche Anfragen an alle IT-Systeme im Netz zu schicken. Dadurch können Angreifende den Netzverkehr einsehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "MAC-Flooding-Angriff",
                    "type": "Threat",
                    "text": "Angreifende können einen MAC-Flooding-Angriff durchführen, um den Netzverkehr einzusehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Spanning-Tree-Angriffe",
            "handle": "Spanning-Tree",
            "text": "Bei Spanning-Tree-Angriffen versenden Angreifende sogenannte Bridge Protocol Data Units (BPDUs) mit dem Ziel, die Switches dazu zu bringen, einen eigenen (bösartigen) Switch als Root Bridge anzusehen. Dadurch wird der Netzverkehr über den Switch der Angreifenden umgeleitet, sodass sie alle über ihn versendeten Informationen mitschneiden können. In der Folge können sie DDoS-Attacken initiieren und durch falsche BPDUs das Netz dazu zwingen, die Spanning-Tree-Topologie neu aufzubauen, wodurch das Netz ausfallen kann.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Spanning-Tree-Angriff",
                    "type": "Threat",
                    "text": "Angreifende können einen Spanning-Tree-Angriff durchführen, um den Netzverkehr umzuleiten und Informationen mitzulesen. Sie können auch DDoS-Attacken initiieren und das Netz dazu zwingen, die Spanning-Tree-Topologie neu aufzubauen, wodurch das Netz ausfallen kann.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "GARP-Attacken",
            "handle": "GARP",
            "text": "Bei Gratuitous-ARP (GARP)-Attacken senden Angreifende unaufgeforderte ARP-Antworten an bestimmte Opfer oder an alle IT-Systeme im selben Subnetz. In dieser gefälschten ARP-Antwort tragend die Angreifenden ihre MAC-Adresse als Zuordnung zu einer fremden IP-Adresse ein und bringt das Opfer dazu, seine ARP-Tabelle so zu verändern, dass der Netzverkehr nun zu den Angreifenden, anstatt zum validen Ziel gesendet wird. Dadurch können sie die Kommunikation zwischen den Opfern mitschneiden oder sie manipulieren.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "GARP-Angriff",
                    "type": "Threat",
                    "text": "Angreifende können einen GARP-Angriff durchführen, um die Kommunikation zwischen den Opfern mitzulesen oder sie zu manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Grundkonfiguration eines Routers oder Switches",
            "handle": "NET.3.1.A1",
            "level": "Low",
            "affects": [],
            "text": "Bevor ein Router oder Switch eingesetzt wird, MUSS er sicher konfiguriert werden. Alle Konfigurationsänderungen SOLLTEN nachvollziehbar dokumentiert sein. Die Integrität der Konfigurationsdateien MUSS in geeigneter Weise geschützt werden. Bevor Zugangspasswörter abgespeichert werden, MÜSSEN sie mithilfe eines zeitgemäßen kryptografischen Verfahrens abgesichert werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18",
                "G 0.22",
                "G 0.23",
                "G 0.26",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz der Administrationsschnittstellen",
            "handle": "NET.3.1.A4",
            "level": "Low",
            "affects": [],
            "text": "Alle Administrations- und Managementzugänge der Router und Switches MÜSSEN auf einzelne Quell-IP-Adressen bzw. -Adressbereiche eingeschränkt werden. Es MUSS sichergestellt sein, dass aus nicht vertrauenswürdigen Netzen heraus nicht direkt auf die Administrationsschnittstellen zugegriffen werden kann.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.15",
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor Fragmentierungsangriffen",
            "handle": "NET.3.1.A5",
            "level": "Low",
            "affects": [],
            "text": "Am Router und Layer-3-Switch MÜSSEN Schutzmechanismen aktiviert sein, um IPv4- sowie IPv6-Fragmentierungsangriffe abzuwehren.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.9",
                "G 0.25",
                "G 0.27",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Notfallzugriff auf Router und Switches",
            "handle": "NET.3.1.A6",
            "level": "Low",
            "affects": [],
            "text": "Es MUSS für die Administrierenden immer möglich sein, direkt auf Router und Switches zuzugreifen, sodass diese weiterhin lokal administriert werden können, auch wenn das gesamte Netz ausfällt.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Protokollierung bei Routern und Switches",
            "handle": "NET.3.1.A7",
            "level": "Low",
            "affects": [],
            "text": "Ein Router oder Switch MUSS so konfiguriert werden, dass er unter anderem folgende Ereignisse protokolliert:\n• Konfigurationsänderungen (möglichst automatisch),\n• Reboot,\n• Systemfehler,\n• Statusänderungen pro Interface, System und Netzsegment sowie\n• Login-Fehler",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.37"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelmäßige Datensicherung",
            "handle": "NET.3.1.A8",
            "level": "Low",
            "affects": [],
            "text": "Die Konfigurationsdateien von Routern und Switches MÜSSEN regelmäßig gesichert werden. Die Sicherungskopien MÜSSEN so abgelegt werden, dass im Notfall darauf zugegriffen werden kann.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.27",
                "G 0.45"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Betriebsdokumentationen",
            "handle": "NET.3.1.A9",
            "level": "Low",
            "affects": [],
            "text": "Die wichtigsten betrieblichen Aufgaben eines Routers oder Switches MÜSSEN geeignet dokumentiert werden. Es SOLLTEN alle Konfigurationsänderungen sowie sicherheitsrelevante Aufgaben dokumentiert werden. Die Dokumentation SOLLTEN vor unbefugten Zugriffen geschützt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.14",
                "G 0.18",
                "G 0.19"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung einer Sicherheitsrichtlinie",
            "handle": "NET.3.1.A10",
            "level": "Medium",
            "affects": [],
            "text": "Ausgehend von der allgemeinen Sicherheitsrichtlinie der Institution SOLLTE eine spezifische Sicherheitsrichtlinie erstellt werden. In der Sicherheitsrichtlinie SOLLTEN nachvollziehbar Anforderungen und Vorgaben beschrieben sein, wie Router und Switches sicher betrieben werden können. Die Richtlinie SOLLTE allen Administrierenden bekannt und grundlegend für ihre Arbeit sein. Wird die Richtlinie verändert oder wird von den festgelegten Anforderungen abgewichen, SOLLTE das mit dem oder der ISB abgestimmt und dokumentiert werden. Es SOLLTE regelmäßig überprüft werden, ob die Richtlinie noch korrekt umgesetzt ist. Die Ergebnisse SOLLTEN geeignet dokumentiert werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Beschaffung eines Routers oder Switches",
            "handle": "NET.3.1.A11",
            "level": "Medium",
            "affects": [],
            "text": "Bevor Router oder Switches beschafft werden, SOLLTE basierend auf der Sicherheitsrichtlinie eine Anforderungsliste erstellt werden, anhand derer die am Markt erhältlichen Produkte bewertet werden. Es SOLLTE darauf geachtet werden, dass das von der Institution angestrebte Sicherheitsniveau mit den zu beschaffenden Geräten erreicht werden kann. Grundlage für die Beschaffung SOLLTEN daher die Anforderungen aus der Sicherheitsrichtlinie sein.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung einer Konfigurations-Checkliste für Router und Switches",
            "handle": "NET.3.1.A12",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE eine Konfigurations-Checkliste erstellt werden, anhand derer die wichtigsten sicherheitsrelevanten Einstellungen auf Routern und Switches geprüft werden können. Da die sichere Konfiguration stark vom Einsatzzweck abhängt, SOLLTEN die unterschiedlichen Anforderungen der Geräte in der Konfigurations-Checkliste berücksichtigt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Administration über ein gesondertes Managementnetz",
            "handle": "NET.3.1.A13",
            "level": "Medium",
            "affects": [],
            "text": "Router und Switches SOLLTEN ausschließlich über ein separates Managementnetz (Out-of-Band-Management) administriert werden. Eine eventuell vorhandene Administrationsschnittstelle über das eigentliche Datennetz (In-Band) SOLLTE deaktiviert werden. Die verfügbaren Sicherheitsmechanismen der eingesetzten Managementprotokolle zur Authentisierung, Integritätssicherung und Verschlüsselung SOLLTEN aktiviert werden. Alle unsicheren Managementprotokolle SOLLTEN deaktiviert werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.14",
                "G 0.23",
                "G 0.30",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor Missbrauch von ICMP-Nachrichten",
            "handle": "NET.3.1.A14",
            "level": "Medium",
            "affects": [],
            "text": "Die Protokolle ICMP und ICMPv6 SOLLTEN restriktiv gefiltert werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Bogon- und Spoofing-Filterung",
            "handle": "NET.3.1.A15",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE verhindert werden, dass Angreifende mithilfe gefälschter, reservierter oder noch nicht zugewiesener IP-Adressen in die Router und Switches eindringen können.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor „IPv6 Routing Header Type-0“-Angriffen",
            "handle": "NET.3.1.A16",
            "level": "Medium",
            "affects": [],
            "text": "Beim Einsatz von IPv6 SOLLTEN Mechanismen eingesetzt werden, die Angriffe auf den Routing-Header des Type-0 erkennen und verhindern.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.9",
                "G 0.23",
                "G 0.25",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor DoS- und DDoS-Angriffen",
            "handle": "NET.3.1.A17",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTEN Mechanismen eingesetzt werden, die hochvolumige Angriffe sowie TCP-State-Exhaustion-Angriffe erkennen und abwehren.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.9",
                "G 0.25",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einrichtung von Access Control Lists",
            "handle": "NET.3.1.A18",
            "level": "Medium",
            "affects": [],
            "text": "Der Zugriff auf Router und Switches SOLLTE mithilfe von Access Control Lists (ACLs) definiert werden. In der ACL SOLLTE anhand der Sicherheitsrichtlinie der Institution festgelegt werden, über welche IT-Systeme oder Netze mit welcher Methode auf einen Router oder Switch zugegriffen werden darf. Für den Fall, dass keine spezifischen Regeln existieren, SOLLTE generell der restriktivere Allowlist-Ansatz bevorzugt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherung von Switch-Ports",
            "handle": "NET.3.1.A19",
            "level": "Medium",
            "affects": [],
            "text": "Die Ports eines Switches SOLLTEN vor unberechtigten Zugriffen geschützt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.25",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherheitsaspekte von Routing-Protokollen",
            "handle": "NET.3.1.A20",
            "level": "Medium",
            "affects": [],
            "text": "Router SOLLTEN sich authentisieren, wenn sie Routing-Informationen austauschen oder Updates für Routing-Tabellen verschicken. Es SOLLTEN ausschließlich Routing-Protokolle eingesetzt werden, die dies unterstützen. Dynamische Routing-Protokolle SOLLTEN ausschließlich in sicheren Netzen verwendet werden. Sie DÜRFEN NICHT in demilitarisierten Zonen (DMZs) eingesetzt werden. In DMZs SOLLTEN stattdessen statische Routen eingetragen werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.30",
                "G 0.43",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Identitäts- und Berechtigungsmanagement in der Netzinfrastruktur",
            "handle": "NET.3.1.A21",
            "level": "Medium",
            "affects": [],
            "text": "Router und Switches SOLLTEN an ein zentrales Identitäts- und Berechtigungsmanagement angebunden werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Notfallvorsorge bei Routern und Switches",
            "handle": "NET.3.1.A22",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE geplant und vorbereitet werden, welche Fehler bei Routern oder Switches in einem Notfall diagnostiziert werden könnten. Außerdem SOLLTE geplant und vorbereitet werden, wie die identifizierten Fehler behoben werden können. Für typische Ausfallszenarien SOLLTEN entsprechende Handlungsanweisungen definiert und in regelmäßigen Abständen aktualisiert werden. Die Notfallplanungen für Router und Switches SOLLTEN mit der übergreifenden Störungs- und Notfallvorsorge abgestimmt sein. Die Notfallplanungen SOLLTEN sich am allgemeinen Notfallvorsorgekonzept orientieren. Es SOLLTE sichergestellt sein, dass die Dokumentationen zur Notfallvorsorge und die darin enthaltenen Handlungsanweisungen in Papierform vorliegen. Das im Rahmen der Notfallvorsorge beschriebene Vorgehen SOLLTE regelmäßig geprobt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Revision und Penetrationstests",
            "handle": "NET.3.1.A23",
            "level": "Medium",
            "affects": [],
            "text": "Router und Switches SOLLTEN regelmäßig auf bekannte Sicherheitsprobleme hin überprüft werden. Auch SOLLTEN regelmäßig Revisionen durchgeführt werden. Dabei SOLLTE unter anderem geprüft werden, ob der Ist-Zustand der festgelegten sicheren Grundkonfiguration entspricht. Die Ergebnisse SOLLTEN nachvollziehbar dokumentiert und mit dem Soll-Zustand abgeglichen werden. Abweichungen SOLLTE nachgegangen werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von Netzzugangskontrollen",
            "handle": "NET.3.1.A24",
            "level": "High",
            "affects": [
                "IA"
            ],
            "text": "Eine Port-based Access Control SOLLTE nach IEEE 802.1x auf Basis von EAP-TLS implementiert werden. Es SOLLTE KEINE Implementierung nach den Standards IEEE 802.1x-2001 und IEEE 802.1x-2004 erfolgen.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erweiterter Integritätsschutz für die Konfigurationsdateien",
            "handle": "NET.3.1.A25",
            "level": "High",
            "affects": [
                "I"
            ],
            "text": "Stürzt ein Router oder Switch ab, SOLLTE sichergestellt werden, dass bei der Wiederherstellung bzw. beim Neustart keine alten oder fehlerhaften Konfigurationen (unter anderem ACLs) benutzt werden.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.22",
                "G 0.23",
                "G 0.30",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Hochverfügbarkeit",
            "handle": "NET.3.1.A26",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die Realisierung einer Hochverfügbarkeitslösung SOLLTE den Betrieb der Router und Switches bzw. deren Sicherheitsfunktionen NICHT behindern oder das Sicherheitsniveau senken. Router und Switches SOLLTEN redundant ausgelegt werden. Dabei SOLLTE darauf geachtet werden, dass die Sicherheitsrichtlinie der Institution eingehalten wird.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.23",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Bandbreitenmanagement für kritische Anwendungen und Dienste",
            "handle": "NET.3.1.A27",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Router und Switches SOLLTEN Funktionen enthalten und einsetzen, mit denen sich die Applikationen erkennen und Bandbreiten priorisieren lassen.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von zertifizierten Produkten",
            "handle": "NET.3.1.A28",
            "level": "High",
            "affects": [
                "CI"
            ],
            "text": "Es SOLLTEN Router und Switches mit einer Sicherheitsevaluierung nach Common Criteria eingesetzt werden, mindestens mit der Stufe EAL4.",
            "isresponsible": "[Control Responsible Entity]",
            "mitigates": [
                "G 0.18"
            ]
        }
    ]
}