{
    "Informationsource": "BSI GSK 2023",
    "name": "NET.3.4 Network Access Control",
    "handle": "NET.3.4",
    "text": "Eine Netzzugangskontrolle (engl. Network Access Control, NAC) sichert Netzzugänge im Endgerätebereich durch Identitätsprüfung (Authentisierung) und Reglementierung (Autorisierung) ab. Unter Endgeräten werden in diesem Baustein alle IT-Systeme verstanden, die am Access Layer eines Campus-Netzes angeschlossen werden. NAC kann sowohl in kabelgebundenen als auch in drahtlosen Netzen eingesetzt werden. Eine Identität kann zum Beispiel über Konten mit Zertifikaten sicher geprüft werden. Durch die folgende Autorisierung werden den Endgeräten über Autorisierungsregeln passende Netzsegmente und Berechtigungen zugewiesen und damit Zugriffsregeln festgelegt. Ebenso kann Endgeräten der Netzzugang verweigert werden.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Planung der NAC-Lösung",
            "handle": "2.1",
            "text": "Sind nicht alle für NAC relevanten IT-Systeme und Informationen in einem IT-Asset-Management erfasst, kann eine NAC-Lösung nicht ausreichend geplant werden. Endgeräte erhalten dann gegebenenfalls keinen Zugang zum Netz oder einen Zugang zu einem falschen Netzsegment. Wurden die Anforderungen an die NAC-Lösung nicht ausreichend erfasst und analysiert, kann auch dies zu einer unzureichenden Planung führen. Beispielsweise ist es dann möglich, dass eingesetzte Switches die Anforderungen an die geplante NAC-Lösung nicht erfüllen können oder der geplante RADIUS-Server falsch dimensioniert wird. Eine weitere Folge könnten auch zu harte oder zu weiche Vorgaben für die genutzten Authentisierungs- und Autorisierungsverfahren sein. Dadurch könnte Endgeräten entweder der Zugang zum Netz verweigert oder unsichere Authentisierungsverfahren könnten genutzt werden, obwohl sichere Verfahren möglich wären. Möglicherweise könnten dadurch auch zu weitreichende Kommunikationsberechtigungen erlangt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende oder unzureichende Planung",
                    "type": "Threat",
                    "text": "Sind nicht alle für NAC relevanten IT-Systeme und Informationen in einem IT-Asset-Management erfasst, kann eine NAC-Lösung nicht ausreichend geplant werden. Endgeräte erhalten dann gegebenenfalls keinen Zugang zum Netz oder einen Zugang zu einem falschen Netzsegment.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Analyse der Anforderungen",
                    "type": "Threat",
                    "text": "Wurden die Anforderungen an die NAC-Lösung nicht ausreichend erfasst und analysiert, kann auch dies zu einer unzureichenden Planung führen. Beispielsweise ist es dann möglich, dass eingesetzte Switches die Anforderungen an die geplante NAC-Lösung nicht erfüllen können oder der geplante RADIUS-Server falsch dimensioniert wird. Eine weitere Folge könnten auch zu harte oder zu weiche Vorgaben für die genutzten Authentisierungs- und Autorisierungsverfahren sein. Dadurch könnte Endgeräten entweder der Zugang zum Netz verweigert oder unsichere Authentisierungsverfahren könnten genutzt werden, obwohl sichere Verfahren möglich wären. Möglicherweise könnten dadurch auch zu weitreichende Kommunikationsberechtigungen erlangt werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichend abgestimmte Integration von Endgeräten in die NAC-Lösung",
            "handle": "2.2",
            "text": "Fehlende oder unzureichend umgesetzte Orchestrierungswerkzeuge, Sicherheitsrichtlinien, Anforderungskataloge und Ressourcen für die Erfassung aller Endgeräte können dazu führen, dass Endgeräte unzureichend abgestimmt in die NAC-Lösung integriert werden. Dies erschwert es, ein sicheres und betriebsfreundliches Authentisierungsverfahren je Endgerätegruppe umzusetzen und ein entsprechendes Inbetriebnahmeverfahren zu konzipieren. Dadurch könnten die Kommunikationsmöglichkeiten der Endgeräte negativ beeinträchtigt werden. Außerdem kann es sein, dass zu schützende Geräte versehentlich in falschen Netzsegmenten positioniert werden. Sind die Endgeräte unzureichend standardisiert oder werden NAC-spezifische Endgeräteanforderungen unzureichend unterstützt, kann dies auch dazu führen, dass unsichere Authentisierungsverfahren eingesetzt werden, obwohl eine starke Authentisierung grundsätzlich möglich wäre.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Integration von Endgeräten",
                    "type": "Threat",
                    "text": "Fehlende oder unzureichend umgesetzte Orchestrierungswerkzeuge, Sicherheitsrichtlinien, Anforderungskataloge und Ressourcen für die Erfassung aller Endgeräte können dazu führen, dass Endgeräte unzureichend abgestimmt in die NAC-Lösung integriert werden. Dies erschwert es, ein sicheres und betriebsfreundliches Authentisierungsverfahren je Endgerätegruppe umzusetzen und ein entsprechendes Inbetriebnahmeverfahren zu konzipieren. Dadurch könnten die Kommunikationsmöglichkeiten der Endgeräte negativ beeinträchtigt werden. Außerdem kann es sein, dass zu schützende Geräte versehentlich in falschen Netzsegmenten positioniert werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Standardisierung von Endgeräten",
                    "type": "Threat",
                    "text": "Sind die Endgeräte unzureichend standardisiert oder werden NAC-spezifische Endgeräteanforderungen unzureichend unterstützt, kann dies auch dazu führen, dass unsichere Authentisierungsverfahren eingesetzt werden, obwohl eine starke Authentisierung grundsätzlich möglich wäre.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Nutzung unzureichend sicherer Protokolle bei NAC",
            "handle": "2.3",
            "text": "Werden sichere EAP-Authentisierungsverfahren technisch nicht unterstützt, kann es passieren, dass unsichere Authentisierungsprotokolle wie EAP-MD5 oder MAC-Authentisierung eingesetzt werden müssen. In diesem Fall sind Spoofing-, Replay- oder Man-in-the-Middle-Angriffe leichter möglich und es kann nicht ausgeschlossen werden, dass unberechtigte IT-Systeme in das Netz gelangen. Wird für Endgeräte mit schwachen Authentisierungsprotokollen nicht eingeschränkt, mit welchen Zielen und über welche Protokolle sie kommunizieren dürfen, können auch unberechtigte IT-Systeme, die durch einen der oben genannten Angriffe Zugang erhalten, weitreichende Kommunikationsmöglichkeiten erlangen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Nutzung unsicherer Protokolle",
                    "type": "Threat",
                    "text": "Werden sichere EAP-Authentisierungsverfahren technisch nicht unterstützt, kann es passieren, dass unsichere Authentisierungsprotokolle wie EAP-MD5 oder MAC-Authentisierung eingesetzt werden müssen. In diesem Fall sind Spoofing-, Replay- oder Man-in-the-Middle-Angriffe leichter möglich und es kann nicht ausgeschlossen werden, dass unberechtigte IT-Systeme in das Netz gelangen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Einschränkung von Kommunikation",
                    "type": "Threat",
                    "text": "Wird für Endgeräte mit schwachen Authentisierungsprotokollen nicht eingeschränkt, mit welchen Zielen und über welche Protokolle sie kommunizieren dürfen, können auch unberechtigte IT-Systeme, die durch einen der oben genannten Angriffe Zugang erhalten, weitreichende Kommunikationsmöglichkeiten erlangen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlerhafte Konfiguration der NAC-Lösung",
            "handle": "2.4",
            "text": "Durch menschliche Fehler, unzureichende Prozesse oder unzureichende Personalkapazitäten und den dadurch bedingten Zeitmangel kann es passieren, dass die NAC-spezifischen Parameter an Endgeräten, Access-Switches oder RADIUS-Servern (NAC-Regelwerk) fehlerhaft konfiguriert werden. Dies kann dazu führen, dass sich die gesamte NAC-Lösung ungewollt falsch verhält, wodurch z. B. Endgeräte benötigte Ressourcen nicht erreichen können oder keinen Netzzugang erhalten. Werden MAC-Adressen bewusst falsch registriert, können dadurch zu viele Ressourcen freigeschaltet werden, indem falsche Netzsegmente oder andere falsche Autorisierungsparameter zugewiesen werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlerhafte Konfiguration",
                    "type": "Threat",
                    "text": "Durch menschliche Fehler, unzureichende Prozesse oder unzureichende Personalkapazitäten und den dadurch bedingten Zeitmangel kann es passieren, dass die NAC-spezifischen Parameter an Endgeräten, Access-Switches oder RADIUS-Servern (NAC-Regelwerk) fehlerhaft konfiguriert werden. Dies kann dazu führen, dass sich die gesamte NAC-Lösung ungewollt falsch verhält, wodurch z. B. Endgeräte benötigte Ressourcen nicht erreichen können oder keinen Netzzugang erhalten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Bewusste Falschregistrierung von MAC-Adressen",
                    "type": "Threat",
                    "text": "Werden MAC-Adressen bewusst falsch registriert, können dadurch zu viele Ressourcen freigeschaltet werden, indem falsche Netzsegmente oder andere falsche Autorisierungsparameter zugewiesen werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Validierung von Konfigurationsänderungen",
            "handle": "2.5",
            "text": "Unzureichende Änderungsprozesse, die Konfigurationsänderungen nicht oder nur unzureichend validieren, begünstigen Fehler in der Konfiguration. Hierdurch kann es passieren, dass für Endgeräte zu viel oder zu wenig schützenswerte Ressourcen erreichbar sind oder es ihnen gänzlich verwehrt wird, auf das Netz zuzugreifen. Wird z. B. NAC an Switch-Ports ohne zwingenden Grund abgeschaltet, können gegebenenfalls unberechtigte Endgeräte uneingeschränkt auf das Netz zugreifen. Wird neue Software auf Endgeräten unzureichend validiert, kann dies z. B. zu Interferenzen zwischen Software-Komponenten führen und die Funktionalität des Supplicants beeinflussen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Validierung von Konfigurationsänderungen",
                    "type": "Threat",
                    "text": "Unzureichende Änderungsprozesse, die Konfigurationsänderungen nicht oder nur unzureichend validieren, begünstigen Fehler in der Konfiguration. Hierdurch kann es passieren, dass für Endgeräte zu viel oder zu wenig schützenswerte Ressourcen erreichbar sind oder es ihnen gänzlich verwehrt wird, auf das Netz zuzugreifen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Validierung von Software-Updates",
                    "type": "Threat",
                    "text": "Wird neue Software auf Endgeräten unzureichend validiert, kann dies z. B. zu Interferenzen zwischen Software-Komponenten führen und die Funktionalität des Supplicants beeinflussen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichend geschützter Netzzugang",
            "handle": "2.6",
            "text": "Wird NAC an Switch-Ports temporär oder dauerhaft abgeschaltet, ist der Netzzugang unzureichend geschützt. Dadurch ist es möglich, dass unautorisierte Personen auf das Netz zugreifen können oder unsichere IT-Systeme zu weitgehende Kommunikationsberechtigungen erhalten. In der Folge kann unberechtigt auf Informationen zugegriffen und Informationen können manipuliert oder gelöscht werden. Außerdem kann auf diese Weise Schadsoftware eingeschleust werden. Wird die Endgeräte-Compliance unzureichend geprüft, kann dies auch zu einem unzureichend geschützten Netzzugang führen, wenn das Endgerät z. B. über unzureichenden Virenschutz verfügt und dadurch Schadsoftware eingeschleust wird.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Abschalten von NAC",
                    "type": "Threat",
                    "text": "Wird NAC an Switch-Ports temporär oder dauerhaft abgeschaltet, ist der Netzzugang unzureichend geschützt. Dadurch ist es möglich, dass unautorisierte Personen auf das Netz zugreifen können oder unsichere IT-Systeme zu weitgehende Kommunikationsberechtigungen erhalten. In der Folge kann unberechtigt auf Informationen zugegriffen und Informationen können manipuliert oder gelöscht werden. Außerdem kann auf diese Weise Schadsoftware eingeschleust werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Endgeräte-Compliance",
                    "type": "Threat",
                    "text": "Wird die Endgeräte-Compliance unzureichend geprüft, kann dies auch zu einem unzureichend geschützten Netzzugang führen, wenn das Endgerät z. B. über unzureichenden Virenschutz verfügt und dadurch Schadsoftware eingeschleust wird.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ausfall oder unzureichende Erreichbarkeit der zentralen NAC-Komponenten",
            "handle": "2.7",
            "text": "Ein unzureichendes oder unzureichend umgesetztes NAC-Konzept, gestörte NAC-Komponenten oder ein gestörtes Netz, unzureichende Anforderungsanalyse, mangelnde Prozesse oder Denial-of-Service-Angriffe (DoS-Angriffe) können dazu führen, dass die zentralen NAC-Komponenten ausfallen oder nicht erreichbar sind. Dies hat Auswirkungen auf die Fähigkeit der Endgeräte zu kommunizieren. Zum Beispiel haben, abhängig von der Switch-Konfiguration, Endgeräte bei Ausfall aller RADIUS-Server entweder keinen oder einen uneingeschränkten Netzzugang.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausfall von NAC-Komponenten",
                    "type": "Threat",
                    "text": "Ein unzureichendes oder unzureichend umgesetztes NAC-Konzept, gestörte NAC-Komponenten oder ein gestörtes Netz, unzureichende Anforderungsanalyse, mangelnde Prozesse oder Denial-of-Service-Angriffe (DoS-Angriffe) können dazu führen, dass die zentralen NAC-Komponenten ausfallen oder nicht erreichbar sind. Dies hat Auswirkungen auf die Fähigkeit der Endgeräte zu kommunizieren. Zum Beispiel haben, abhängig von der Switch-Konfiguration, Endgeräte bei Ausfall aller RADIUS-Server entweder keinen oder einen uneingeschränkten Netzzugang.",
                    "hasOrigin": [
                        "natural",
                        "human"
                    ],
                    "hasSource": [
                        "accidental",
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Nachverfolgung von Benutzenden",
            "handle": "2.8",
            "text": "Ein unzureichendes Administrationskonzept, eine unzureichende Umsetzung der Konzeptionierung, zu lange Speicherzeiten oder eine mangelnde Abstimmung mit Betriebsrat und Datenschutzbeauftragten könnten dazu führen, dass personenrelevante Log-Daten unzureichend geschützt sind. Dadurch könnten Benutzendenprofile erstellt werden, die es ermöglichen, dass Mitarbeitende zeitlich nachverfolgt werden können.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Verwaltung von Log-Daten",
                    "type": "Threat",
                    "text": "Ein unzureichendes Administrationskonzept, eine unzureichende Umsetzung der Konzeptionierung, zu lange Speicherzeiten oder eine mangelnde Abstimmung mit Betriebsrat und Datenschutzbeauftragten könnten dazu führen, dass personenrelevante Log-Daten unzureichend geschützt sind. Dadurch könnten Benutzendenprofile erstellt werden, die es ermöglichen, dass Mitarbeitende zeitlich nachverfolgt werden können.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Begründete Entscheidung für den Einsatz von NAC",
            "handle": "NET.3.4.A1",
            "level": "Low",
            "affects": [],
            "text": "Die Institution MUSS grundsätzlich entscheiden, ob und in welchem Umfang NAC eingesetzt wird. Die getroffene Entscheidung MUSS zusammen mit einer Begründung an geeigneter Stelle dokumentiert werden.",
            "isresponsible": "Institution",
            "mitigates": [
                "G 0.18",
                "G 0.32",
                "G 0.36"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung des Einsatzes von NAC",
            "handle": "NET.3.4.A2",
            "level": "Medium",
            "affects": [],
            "text": "Der Einsatz von NAC SOLLTE umfassend und detailliert geplant werden. Die Planung SOLLTE dabei mindestens folgende Aspekte beinhalten:",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.25",
                "G 0.27",
                "G 0.31",
                "G 0.32",
                "G 0.36",
                "G 0.38",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines Anforderungskatalogs für NAC",
            "handle": "NET.3.4.A3",
            "level": "Medium",
            "affects": [],
            "text": "Die Anforderungen an die NAC-Lösung SOLLTEN in einem Anforderungskatalog erhoben werden. Der Anforderungskatalog SOLLTE dabei die grundlegenden funktionalen Anforderungen umfassen und alle NAC-Komponenten (z. B. Endgeräte, Access-Switches und RADIUS-Server) adressieren.",
            "isresponsible": null,
            "mitigates": [
                "G 0.26",
                "G 0.27",
                "G 0.31",
                "G 0.36",
                "G 0.38",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung eines NAC-Konzepts",
            "handle": "NET.3.4.A4",
            "level": "Medium",
            "affects": [],
            "text": "Ausgehend von der Entscheidung aus NET.3.4.A1 Begründete Entscheidung für den Einsatz von NAC und den Anforderungen an die NAC-Lösung SOLLTE ein NAC-Konzept erstellt werden. Das NAC-Konzept SOLLTE mit dem Segmentierungskonzept gemäß NET.1.1 Netzarchitektur und -design abgestimmt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.32",
                "G 0.38"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Anpassung von Prozessen für Endgeräte bezüglich NAC",
            "handle": "NET.3.4.A5",
            "level": "Medium",
            "affects": [],
            "text": "Für die Endgeräte, die in die NAC-Lösung eingebunden werden, SOLLTE NAC in allen relevanten Prozessen angemessen berücksichtigt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25",
                "G 0.26",
                "G 0.30",
                "G 0.31",
                "G 0.32",
                "G 0.36"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung von Notfallprozessen für NAC",
            "handle": "NET.3.4.A6",
            "level": "Medium",
            "affects": [],
            "text": "Wird die Wirkkette bei NAC gestört, SOLLTE erwogen werden, die Sicherheitsmechanismen von NAC temporär in angemessenem Umfang zu deaktivieren.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.25",
                "G 0.26",
                "G 0.27",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Nutzung sicherer Authentisierungsverfahren",
            "handle": "NET.3.4.A7",
            "level": "Medium",
            "affects": [],
            "text": "Endgeräte SOLLTEN sichere Authentisierungsverfahren nach dem Stand der Technik verwenden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung der NAC-spezifischen Rollen und Berechtigungen für den RADIUS-Server",
            "handle": "NET.3.4.A8",
            "level": "Medium",
            "affects": [],
            "text": "Im Rollen- und Berechtigungskonzept für den RADIUS-Server SOLLTEN die verschiedenen Gruppen berücksichtigt werden, die wegen NAC auf einen RADIUS-Server zugreifen müssen, um diesen zu administrieren.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.28",
                "G 0.30",
                "G 0.31",
                "G 0.32",
                "G 0.38"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung eines angepassten NAC-Regelwerkes",
            "handle": "NET.3.4.A9",
            "level": "Medium",
            "affects": [],
            "text": "Für die NAC-Lösung SOLLTE ein NAC-Regelwerk definiert werden, das das NAC-Konzept umsetzt und festlegt, wie die Endgeräte auf das Netz zugreifen dürfen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.32",
                "G 0.36",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Nutzung von Identitäten",
            "handle": "NET.3.4.A10",
            "level": "Medium",
            "affects": [],
            "text": "Für die NAC-Authentisierung SOLLTEN individuelle Identitäten genutzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration der NAC-Lösung",
            "handle": "NET.3.4.A11",
            "level": "Medium",
            "affects": [],
            "text": "Alle Komponenten der NAC-Lösung SOLLTEN sicher nach dem Stand der Technik konfiguriert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.26",
                "G 0.32",
                "G 0.36",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Monitoring der NAC-Lösung",
            "handle": "NET.3.4.A12",
            "level": "Medium",
            "affects": [],
            "text": "Die zentralen RADIUS-Server und alle Access-Switches mit Authenticator sowie alle weiteren zentralen Dienste, die für die NAC-Lösung essentiell sind, SOLLTEN in ein möglichst umfassendes und einheitliches Monitoring eingebunden werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25",
                "G 0.28",
                "G 0.31",
                "G 0.32",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung von Validierungsvorgaben für die NAC-Konfiguration",
            "handle": "NET.3.4.A13",
            "level": "Medium",
            "affects": [],
            "text": "Für die NAC-Lösung SOLLTEN Validierungsvorgaben erstellt werden, um sicherzustellen, dass die NAC-Komponenten das NAC-Konzept angemessen umsetzen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.26",
                "G 0.31",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Umsetzung weiterer Maßnahmen bei Verwendung von MAC-Adress-Authentisierung",
            "handle": "NET.3.4.A14",
            "level": "Medium",
            "affects": [],
            "text": "Endgeräte, die nicht über eine sichere EAP-Methode authentisiert werden können und anhand ihrer MAC-Adresse identifiziert werden, SOLLTEN NICHT als vertrauenswürdige Endgeräte eingestuft werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Anbindung Virenschutz an NAC-Lösung",
            "handle": "NET.3.4.A15",
            "level": "Medium",
            "affects": [],
            "text": "Jedes Endgerät SOLLTE auf Schadsoftware geprüft werden, bevor es an das Netz der Institution angebunden wird und bevor es auf IT-Systeme der Institution zugreift.",
            "isresponsible": null,
            "mitigates": [
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Protokollierung der Ereignisse",
            "handle": "NET.3.4.A16",
            "level": "Medium",
            "affects": [],
            "text": "Ergänzend zu OPS.1.1.5 Protokollierung SOLLTEN Statusänderungen an NAC-Komponenten sowie alle relevanten NAC-spezifischen, gegebenenfalls sicherheitskritischen Ereignisse protokolliert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25",
                "G 0.26",
                "G 0.27",
                "G 0.28",
                "G 0.30",
                "G 0.31",
                "G 0.32",
                "G 0.36",
                "G 0.38",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Positionierung des RADIUS-Servers im Management-Bereich",
            "handle": "NET.3.4.A17",
            "level": "Medium",
            "affects": [],
            "text": "Der RADIUS-Server SOLLTE in einem geschützten Netzsegment innerhalb des Management-Bereichs (siehe NET.1.1 Netzarchitektur und -design) positioniert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.30",
                "G 0.38"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Dokumentation der NAC-Lösung",
            "handle": "NET.3.4.A18",
            "level": "Medium",
            "affects": [],
            "text": "Die NAC-Lösung mit allen NAC-Komponenten SOLLTE geeignet dokumentiert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Ordnungsgemäße Verwaltung von Identitäten zur Authentisierung",
            "handle": "NET.3.4.A19",
            "level": "Medium",
            "affects": [],
            "text": "Alle Identitäten, die via NAC einen Zugang zum Netz der Institution ermöglichen, SOLLTEN geeignet geschützt und verwaltet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von MACsec",
            "handle": "NET.3.4.A20",
            "level": "High",
            "affects": [
                "CI"
            ],
            "text": "Für jedes Datenpaket SOLLTE die Datenintegrität gewährleistet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von Endgerätekonformitätsprüfung",
            "handle": "NET.3.4.A21",
            "level": "High",
            "affects": [
                "C"
            ],
            "text": "Bevor ein Endgerät an das Netz der Institution angebunden wird und bevor es auf IT-Systeme der Institution zugreift, SOLLTE geprüft werden, ob es den Konformitätsvorgaben der Institution genügt.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "NAC-Autorisierung mit Mikrosegmenten",
            "handle": "NET.3.4.A22",
            "level": "High",
            "affects": [
                "C"
            ],
            "text": "Endgeräte mit ähnlichem Anforderungsprofil und identischem Schutzbedarf SOLLTEN via NAC getrennten Netzsegmenten zugewiesen werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.30",
                "G 0.36",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von autarken RADIUS-Servern für unterschiedliche Netzbereiche und Funktionen",
            "handle": "NET.3.4.A23",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Für NAC SOLLTEN dedizierte und autarke RADIUS-Server eingesetzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Nutzung sicherer Protokolle zwischen NAC-Komponenten",
            "handle": "NET.3.4.A24",
            "level": "High",
            "affects": [
                "C"
            ],
            "text": "Für die Kommunikation zwischen den zentralen NAC-Komponenten SOLLTEN grundsätzlich Protokolle verwendet werden, die nach dem Stand der Technik als sicher gelten.",
            "isresponsible": null,
            "mitigates": [
                "G 0.30",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einbindung der NAC-Lösung in ein Sicherheitsmonitoring",
            "handle": "NET.3.4.A25",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die NAC-Lösung SOLLTE in ein Sicherheitsmonitoring eingebunden werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.28",
                "G 0.31",
                "G 0.32",
                "G 0.36",
                "G 0.38",
                "G 0.39"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Hochverfügbarkeit der zentralen NAC-Komponenten",
            "handle": "NET.3.4.A26",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die zentralen NAC-Komponenten SOLLTEN redundant ausgelegt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Prüfung der Notwendigkeit für MAC-Adress-Authentisierung",
            "handle": "NET.3.4.A27",
            "level": "High",
            "affects": [
                "I"
            ],
            "text": "Eine Authentisierung über MAC-Adressen SOLLTE nur dort genutzt werden, wo dies technisch unumgänglich ist und die Sicherheitsrichtlinien dies zulassen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.36",
                "G 0.43"
            ]
        }
    ]
}