{
    "Informationsource": "BSI GSK 2023",
    "name": "NET.1.1 Netzarchitektur und -design",
    "handle": "NET.1.1",
    "text": "Die meisten Institutionen benötigen heute für ihren Geschäftsbetrieb und für die Erfüllung ihrer Fachaufgaben Datennetze, über die beispielsweise Informationen und Daten ausgetauscht sowie verteilte Anwendungen realisiert werden. An solche Netze werden nicht nur herkömmliche Endgeräte, das Extranet und das Internet angeschlossen. Sie integrieren zunehmend auch mobile Endgeräte und Elemente, die dem Internet of Things (IoT) zugerechnet werden. Darüber hinaus werden über Datennetze vermehrt auch Cloud-Dienste sowie Dienste für Unified Communication and Collaboration (UCC) genutzt. Die Vorteile, die sich dadurch ergeben, sind unbestritten. Aber durch die vielen Endgeräte und Dienste steigen auch die Risiken. Deshalb ist es wichtig, das eigene Netz bereits durch eine sichere Netzarchitektur zu schützen. Dafür muss zum Beispiel geplant werden, wie ein lokales Netz (Local Area Network, LAN) oder ein Wide Area Network (WAN) sicher aufgebaut werden kann. Ebenso müssen nur eingeschränkt vertrauenswürdige externe Netze, z. B. das Internet oder Netze der Kundschaft, geeignet angebunden werden.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ausfall oder unzureichende Performance von Kommunikationsverbindungen",
            "handle": "2.1",
            "text": "Sind die Kommunikationsverbindungen unzureichend dimensioniert oder reicht ihre Leistung aufgrund eines technischen Ausfalls oder eines Denial-of-Service-(DoS)-Angriffs nicht mehr aus, können z. B. Clients nur noch eingeschränkt mit Servern kommunizieren. Dadurch erhöhen sich die Zugriffszeiten auf interne und externe Dienste. Diese sind so mitunter nur noch eingeschränkt oder gar nicht mehr nutzbar. Auch sind eventuell institutionsrelevante Informationen nicht mehr verfügbar. In der Folge können essenzielle Geschäftsprozesse oder ganze Produktionsprozesse stillstehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "DoS-Angriff",
                    "type": "Threat",
                    "text": "Ein Angreifer kann durch einen DoS-Angriff die Bandbreite der Kommunikationsverbindungen so stark belasten, dass die Kommunikation zwischen Clients und Servern nicht mehr möglich ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Technischer Ausfall",
                    "type": "Threat",
                    "text": "Ein technischer Ausfall eines Netzwerkgeräts kann zu einem Ausfall der Kommunikationsverbindungen führen.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ungenügend abgesicherte Netzzugänge",
            "handle": "2.2",
            "text": "Ist das interne Netz mit dem Internet verbunden und der Übergang nicht ausreichend geschützt, z. B. weil keine Firewall eingesetzt wird oder sie falsch konfiguriert ist, können Angreifende auf schützenswerte Informationen der Institution zugreifen und diese kopieren oder manipulieren.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Angriff auf ungeschützte Dienste",
                    "type": "Threat",
                    "text": "Ein Angreifer kann über einen ungeschützten Netzzugang auf Dienste im internen Netz zugreifen und diese für eigene Zwecke missbrauchen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unsachgemäßer Aufbau von Netzen",
            "handle": "2.3",
            "text": "Wird ein Netz unsachgemäß aufgebaut oder fehlerhaft erweitert, können unsichere Netztopologien entstehen oder Netze unsicher konfiguriert werden. Angreifende können so leichter Sicherheitslücken finden, ins interne Netz der Institution eindringen und dort Informationen stehlen, Daten manipulieren oder auch ganze Produktionssysteme stören. Auch bleiben Angreifende in einem fehlerhaft aufgebauten Netz, das die Sicherheitssysteme nur eingeschränkt überwachen können, länger unerkannt.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausnutzung von Sicherheitslücken",
                    "type": "Threat",
                    "text": "Ein Angreifer kann Sicherheitslücken in einem unsachgemäß aufgebauten Netz ausnutzen, um in das interne Netz einzudringen und dort Schaden anzurichten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherheitsrichtlinie für das Netz",
            "handle": "NET.1.1.A1",
            "level": "Low",
            "affects": [],
            "text": "Ausgehend von der allgemeinen Sicherheitsrichtlinie der Institution MUSS eine spezifische Sicherheitsrichtlinie für das Netz erstellt werden. Darin MÜSSEN nachvollziehbar Anforderungen und Vorgaben beschrieben werden, wie Netze sicher konzipiert und aufgebaut werden. In der Richtlinie MUSS unter anderem festgelegt werden, in welchen Fällen die Zonen zu segmentieren sind und in welchen Fällen Benutzendengruppen bzw. Mandanten und Mandantinnen logisch oder sogar physisch zu trennen sind, welche Kommunikationsbeziehungen und welche Netz- und Anwendungsprotokolle jeweils zugelassen werden, wie der Datenverkehr für Administration und Überwachung netztechnisch zu trennen ist, welche institutionsinterne, standortübergreifende Kommunikation (WAN, Funknetze) erlaubt und welche Verschlüsselung im WAN, LAN oder auf Funkstrecken erforderlich ist sowie welche institutionsübergreifende Kommunikation zugelassen ist.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Dokumentation des Netzes",
            "handle": "NET.1.1.A2",
            "level": "Low",
            "affects": [],
            "text": "Es MUSS eine vollständige Dokumentation des Netzes erstellt werden. Sie MUSS einen Netzplan beinhalten. Die Dokumentation MUSS nachhaltig gepflegt werden. Die initiale Ist-Aufnahme, einschließlich der Netzperformance, sowie alle durchgeführten Änderungen im Netz MÜSSEN in der Dokumentation enthalten sein. Die logische Struktur des Netzes MUSS dokumentiert werden, insbesondere, wie die Subnetze zugeordnet und wie das Netz zoniert und segmentiert wird.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Anforderungsspezifikation für das Netz",
            "handle": "NET.1.1.A3",
            "level": "Low",
            "affects": [],
            "text": "Ausgehend von der Sicherheitsrichtlinie für das Netz MUSS eine Anforderungsspezifikation erstellt werden. Diese MUSS nachhaltig gepflegt werden. Aus den Anforderungen MÜSSEN sich alle wesentlichen Elemente für Netzarchitektur und -design ableiten lassen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Netztrennung in Zonen",
            "handle": "NET.1.1.A4",
            "level": "Low",
            "affects": [],
            "text": "Das Gesamtnetz MUSS mindestens in folgende drei Zonen physisch separiert sein: internes Netz, demilitarisierte Zone (DMZ) und Außenanbindungen (inklusive Internetanbindung sowie Anbindung an andere nicht vertrauenswürdige Netze). Die Zonenübergänge MÜSSEN durch eine Firewall abgesichert werden. Diese Kontrolle MUSS dem Prinzip der lokalen Kommunikation folgen, sodass von Firewalls ausschließlich erlaubte Kommunikation weitergeleitet wird (Allowlist). Nicht vertrauenswürdige Netze (z. B. Internet) und vertrauenswürdige Netze (z. B. Intranet) MÜSSEN mindestens durch eine zweistufige Firewall-Struktur, bestehend aus zustandsbehafteten Paketfiltern (Firewall), getrennt werden. Um Internet und externe DMZ netztechnisch zu trennen, MUSS mindestens ein zustandsbehafteter Paketfilter eingesetzt werden. In der zweistufigen Firewall-Architektur MUSS jeder ein- und ausgehende Datenverkehr durch den äußeren Paketfilter bzw. den internen Paketfilter kontrolliert und gefiltert werden. Eine P-A-P-Struktur, die aus Paketfilter, Application-Layer-Gateway bzw. Sicherheits-Proxies und Paketfilter besteht, MUSS immer realisiert werden, wenn die Sicherheitsrichtlinie oder die Anforderungsspezifikation dies fordern.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Client-Server-Segmentierung",
            "handle": "NET.1.1.A5",
            "level": "Low",
            "affects": [],
            "text": "Clients und Server MÜSSEN in unterschiedlichen Netzsegmenten platziert werden. Die Kommunikation zwischen diesen Netzsegmenten MUSS mindestens durch einen zustandsbehafteten Paketfilter kontrolliert werden. Es SOLLTE beachtet werden, dass mögliche Ausnahmen, die es erlauben, Clients und Server in einem gemeinsamen Netzsegment zu positionieren, in den entsprechenden anwendungs- und systemspezifischen Bausteinen geregelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Endgeräte-Segmentierung im internen Netz",
            "handle": "NET.1.1.A6",
            "level": "Low",
            "affects": [],
            "text": "Es DÜRFEN NUR Endgeräte in einem Netzsegment positioniert werden, die einem ähnlichen Sicherheitsniveau entsprechen. Für Gastzugänge und für Netzbereiche, in denen keine ausreichende interne Kontrolle über die Endgeräte gegeben ist, MÜSSEN dedizierte Netzsegmente eingerichtet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung von schützenswerten Informationen",
            "handle": "NET.1.1.A7",
            "level": "Low",
            "affects": [],
            "text": "Schützenswerte Informationen MÜSSEN über nach dem derzeitigen Stand der Technik sichere Protokolle übertragen werden, falls nicht über vertrauenswürdige dedizierte Netzsegmente (z. B. innerhalb des Managementnetzes) kommuniziert wird. Können solche Protokolle nicht genutzt werden, MUSS nach Stand der Technik angemessen verschlüsselt und authentisiert werden (siehe NET.3.3 VPN).",
            "isresponsible": null,
            "mitigates": [
                "G 0.15",
                "G 0.43",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Grundlegende Absicherung des Internetzugangs",
            "handle": "NET.1.1.A8",
            "level": "Low",
            "affects": [],
            "text": "Der Internetverkehr MUSS über die Firewall-Struktur geführt werden (siehe NET.1.1.A4 Netztrennung in Zonen). Die Datenflüsse MÜSSEN durch die Firewall-Struktur auf die benötigten Protokolle und Kommunikationsbeziehungen eingeschränkt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Grundlegende Absicherung der Kommunikation mit nicht vertrauenswürdigen Netzen",
            "handle": "NET.1.1.A9",
            "level": "Low",
            "affects": [],
            "text": "Für jedes Netz MUSS festgelegt werden, inwieweit es als vertrauenswürdig einzustufen ist. Netze, die nicht vertrauenswürdig sind, MÜSSEN wie das Internet behandelt und entsprechend abgesichert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.23",
                "G 0.30",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "DMZ-Segmentierung für Zugriffe aus dem Internet",
            "handle": "NET.1.1.A10",
            "level": "Low",
            "affects": [],
            "text": "Die Firewall-Strukur MUSS für alle Dienste bzw. Anwendungen, die aus dem Internet erreichbar sind, um eine sogenannte externe DMZ ergänzt werden. Es SOLLTE ein Konzept zur DMZ-Segmentierung erstellt werden, das die Sicherheitsrichtlinie und die Anforderungsspezifikation nachvollziehbar umsetzt. Abhängig vom Sicherheitsniveau der IT-Systeme MÜSSEN die DMZ-Segmente weitergehend unterteilt werden. Eine externe DMZ MUSS am äußeren Paketfilter angeschlossen werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung eingehender Kommunikation vom Internet in das interne Netz",
            "handle": "NET.1.1.A11",
            "level": "Low",
            "affects": [],
            "text": "Ein IP-basierter Zugriff auf das interne Netz MUSS über einen sicheren Kommunikationskanal erfolgen. Der Zugriff MUSS auf vertrauenswürdige IT-Systeme und Benutzende beschränkt werden (siehe NET.3.3 VPN). Derartige VPN-Gateways SOLLTEN in einer externen DMZ platziert werden. Es SOLLTE beachtet werden, dass hinreichend gehärtete VPN-Gateways direkt aus dem Internet erreichbar sein können. Die über das VPN-Gateway authentisierten Zugriffe ins interne Netz MÜSSEN mindestens die interne Firewall durchlaufen. IT-Systeme DÜRFEN NICHT via Internet oder externer DMZ auf das interne Netz zugreifen. Es SOLLTE beachtet werden, dass etwaige Ausnahmen zu dieser Anforderung in den entsprechenden anwendungs- und systemspezifischen Bausteinen geregelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.19",
                "G 0.22",
                "G 0.23",
                "G 0.29",
                "G 0.30",
                "G 0.40",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung ausgehender interner Kommunikation zum Internet",
            "handle": "NET.1.1.A12",
            "level": "Low",
            "affects": [],
            "text": "Ausgehende Kommunikation aus dem internen Netz zum Internet MUSS an einem Sicherheits-Proxy entkoppelt werden. Die Entkoppelung MUSS außerhalb des internen Netzes erfolgen. Wird eine P-A-P-Struktur eingesetzt, SOLLTE die ausgehende Kommunikation immer durch die Sicherheits-Proxies der P-A-P-Struktur entkoppelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Netzplanung",
            "handle": "NET.1.1.A13",
            "level": "Low",
            "affects": [],
            "text": "Jede Netzimplementierung MUSS geeignet, vollständig und nachvollziehbar geplant werden. Dabei MÜSSEN die Sicherheitsrichtlinie sowie die Anforderungsspezifikation beachtet werden. Darüber hinaus MÜSSEN in der Planung mindestens die folgenden Punkte bedarfsgerecht berücksichtigt werden: Anbindung von Internet und, sofern vorhanden, Standortnetz und Extranet, Topologie des Gesamtnetzes und der Netzbereiche, d. h. Zonen und Netzsegmente, Dimensionierung und Redundanz der Netz- und Sicherheitskomponenten, Übertragungsstrecken und Außenanbindungen, zu nutzende Protokolle und deren grundsätzliche Konfiguration und Adressierung, insbesondere IPv4/IPv6-Subnetze von Endgerätegruppen sowie Administration und Überwachung (siehe NET.1.2 Netzmanagement). Die Netzplanung MUSS regelmäßig überprüft werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Umsetzung der Netzplanung",
            "handle": "NET.1.1.A14",
            "level": "Low",
            "affects": [],
            "text": "Das geplante Netz MUSS fachgerecht umgesetzt werden. Dies MUSS während der Abnahme geprüft werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.9",
                "G 0.11",
                "G 0.18",
                "G 0.19",
                "G 0.22",
                "G 0.23",
                "G 0.27",
                "G 0.29",
                "G 0.30",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelmäßiger Soll-Ist-Vergleich",
            "handle": "NET.1.1.A15",
            "level": "Low",
            "affects": [],
            "text": "Es MUSS regelmäßig geprüft werden, ob das bestehende Netz dem Soll-Zustand entspricht. Dabei MUSS mindestens geprüft werden, inwieweit es die Sicherheitsrichtlinie und Anforderungsspezifikation erfüllt. Es MUSS auch geprüft werden, inwiefern die umgesetzte Netzstruktur dem aktuellen Stand der Netzplanung entspricht. Dafür MÜSSEN zuständige Personen sowie Prüfkriterien bzw. Vorgaben festgelegt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Spezifikation der Netzarchitektur",
            "handle": "NET.1.1.A16",
            "level": "Medium",
            "affects": [],
            "text": "Auf Basis der Sicherheitsrichtlinie und der Anforderungsspezifikation SOLLTE eine Architektur für die Zonen inklusive internem Netz, DMZ-Bereich und Außenanbindungen entwickelt und nachhaltig gepflegt werden. Dabei SOLLTEN je nach spezifischer Situation der Institution alle relevanten Architekturelemente betrachtet werden, mindestens jedoch: Netzarchitektur des internen Netzes mit Festlegungen dazu, wie Netzvirtualisierungstechniken, Layer-2- und Layer-3-Kommunikation sowie Redundanzverfahren einzusetzen sind, Netzarchitektur für Außenanbindungen, inklusive Firewall-Architekturen, sowie DMZ- und Extranet-Design und Vorgaben an die Standortkopplung, Festlegung, an welchen Stellen des Netzes welche Sicherheitskomponenten wie Firewalls oder IDS/IPS zu platzieren sind und welche Sicherheitsfunktionen diese realisieren müssen, Vorgaben für die Netzanbindung der verschiedenen IT-Systeme, Netzarchitektur in Virtualisierungs-Hosts, wobei insbesondere Network Virtualization Overlay (NVO) und die Architektur in Vertikal integrierten Systemen (ViS) zu berücksichtigen sind, Festlegungen der grundsätzlichen Architektur-Elemente für eine Private Cloud sowie Absicherung der Anbindungen zu Virtual Private Clouds, Hybrid Clouds und Public Clouds sowie Architektur zur sicheren Administration und Überwachung der IT-Infrastruktur.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Spezifikation des Netzdesigns",
            "handle": "NET.1.1.A17",
            "level": "Medium",
            "affects": [],
            "text": "Basierend auf der Netzarchitektur SOLLTE das Netzdesign für die Zonen inklusive internem Netz, DMZ-Bereich und Außenanbindungen entwickelt und nachhaltig gepflegt werden. Dafür SOLLTEN die relevanten Architekturelemente detailliert betrachtet werden, mindestens jedoch: zulässige Formen von Netzkomponenten inklusive virtualisierter Netzkomponenten, Festlegungen darüber, wie WAN- und Funkverbindungen abzusichern sind, Anbindung von Endgeräten an Switching-Komponenten, Verbindungen zwischen Netzelementen sowie Verwendung von Kommunikationsprotokollen, Redundanzmechanismen für alle Netzelemente, Adresskonzept für IPv4 und IPv6 sowie zugehörige Routing- und Switching-Konzepte, virtualisierte Netze in Virtualisierungs-Hosts inklusive NVO, Aufbau, Anbindung und Absicherung von Private Clouds sowie sichere Anbindung von Virtual Private Clouds, Hybrid Clouds und Public Clouds sowie Festlegungen zum Netzdesign für die sichere Administration und Überwachung der IT-Infrastruktur.",
            "isresponsible": null,
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "P-A-P-Struktur für die Internet-Anbindung",
            "handle": "NET.1.1.A18",
            "level": "Medium",
            "affects": [],
            "text": "Das Netz der Institution SOLLTE über eine Firewall mit P-A-P-Struktur an das Internet angeschlossen werden (siehe NET.1.1.A4 Netztrennung in Zonen). Zwischen den beiden Firewall-Stufen MUSS ein proxy-basiertes Application-Layer-Gateway (ALG) realisiert werden. Das ALG MUSS über ein eigenes Transfernetz (dual-homed) sowohl zum äußeren Paketfilter als auch zum internen Paketfilter angebunden werden. Das Transfernetz DARF NICHT mit anderen Aufgaben als denjenigen für das ALG belegt sein. Falls kein ALG eingesetzt wird, dann MÜSSEN entsprechende Sicherheits-Proxies realisiert werden. Die Sicherheits-Proxies MÜSSEN über ein eigenes Transfernetz (dual-homed) angebunden werden. Das Transfernetz DARF NICHT mit anderen Aufgaben als denjenigen für die Sicherheits-Proxies belegt sein. Es MUSS geprüft werden, ob über die Sicherheits-Proxies gegenseitige Angriffe möglich sind. Ist dies der Fall, MUSS das Transfernetz geeignet segmentiert werden. Jeglicher Datenverkehr MUSS über das ALG oder entsprechende Sicherheits-Proxies entkoppelt werden. Ein Transfernetz, das beide Firewall-Stufen direkt miteinander verbindet, DARF NICHT konfiguriert werden. Die interne Firewall MUSS zudem die Angriffsfläche des ALGs oder der Sicherheits-Proxies gegenüber Innentätern und Innentäterinnen oder IT-Systemen im internen Netz reduzieren. Authentisierte und vertrauenswürdige Netzzugriffe vom VPN-Gateway ins interne Netz SOLLTEN NICHT das ALG oder die Sicherheits-Proxies der P-A-P-Struktur durchlaufen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Separierung der Infrastrukturdienste",
            "handle": "NET.1.1.A19",
            "level": "Medium",
            "affects": [],
            "text": "Server, die grundlegende Dienste für die IT-Infrastruktur bereitstellen, SOLLTEN in einem dedizierten Netzsegment positioniert werden. Die Kommunikation mit ihnen SOLLTE durch einen zustandsbehafteten Paketfilter (Firewall) kontrolliert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Zuweisung dedizierter Subnetze für IPv4/IPv6-Endgerätegruppen",
            "handle": "NET.1.1.A20",
            "level": "Medium",
            "affects": [],
            "text": "Unterschiedliche IPv4-/IPv6- Endgeräte SOLLTEN je nach verwendetem Protokoll (IPv4-/IPv6- oder IPv4/IPv6-DualStack) dedizierten Subnetzen zugeordnet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Separierung des Management-Bereichs",
            "handle": "NET.1.1.A21",
            "level": "Medium",
            "affects": [],
            "text": "Um die Infrastruktur zu managen, SOLLTE durchgängig ein Out-of-Band-Management genutzt werden. Dabei SOLLTEN alle Endgeräte, die für das Management der IT-Infrastruktur benötigt werden, in dedizierten Netzsegmenten positioniert werden. Die Kommunikation mit diesen Endgeräten SOLLTE durch einen zustandsbehafteten Paketfilter kontrolliert werden. Die Kommunikation von und zu diesen Management-Netzsegmenten SOLLTE auf die notwendigen Management-Protokolle mit definierten Kommunikations-Endpunkten beschränkt werden. Der Management-Bereich SOLLTE mindestens die folgenden Netzsegmente umfassen. Diese SOLLTEN abhängig von der Sicherheitsrichtlinie und der Anforderungsspezifikation weiter unterteilt werden in Netzsegment(e) für IT-Systeme, die für die Authentisierung und Autorisierung der administrativen Kommunikation zuständig sind, Netzsegment(e) für die Administration der IT-Systeme, Netzsegment(e) für die Überwachung und das Monitoring, Netzsegment(e), die die zentrale Protokollierung inklusive Syslog-Server und SIEM-Server enthalten, Netzsegment(e) für IT-Systeme, die für grundlegende Dienste des Management-Bereichs benötigt werden sowie Netzsegment(e) für die Management-Interfaces der zu administrierenden IT-Systeme. Die verschiedenen Management-Interfaces der IT-Systeme MÜSSEN nach ihrem Einsatzzweck und ihrer Netzplatzierung über einen zustandsbehafteten Paketfilter getrennt werden. Dabei SOLLTEN die IT-Systeme (Management-Interfaces) zusätzlich bei folgender Zugehörigkeit über dedizierte Firewalls getrennt werden: IT-Systeme, die aus dem Internet erreichbar sind, IT-Systeme im internen Netz sowie Sicherheitskomponenten, die sich zwischen den aus dem Internet erreichbaren IT-Systemen und dem internen Netz befinden. Es MUSS sichergestellt werden, dass die Segmentierung nicht durch die Management-Kommunikation unterlaufen werden kann. Eine Überbrückung von Netzsegmenten MUSS ausgeschlossen werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.22",
                "G 0.23",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Spezifikation des Segmentierungskonzepts",
            "handle": "NET.1.1.A22",
            "level": "Medium",
            "affects": [],
            "text": "Auf Basis der Spezifikationen von Netzarchitektur und Netzdesign SOLLTE ein umfassendes Segmentierungskonzept für das interne Netz erstellt werden. Dieses Segmentierungskonzept SOLLTE eventuell vorhandene virtualisierte Netze in Virtualisierungs-Hosts beinhalten. Das Segmentierunskonzept SOLLTE geplant, umgesetzt, betrieben und nachhaltig gepflegt werden. Das Konzept SOLLTE mindestens die folgenden Punkte umfassen, soweit diese in der Zielumgebung vorgesehen sind: Initial anzulegende Netzsegmente und Vorgaben dazu, wie neue Netzsegmente zu schaffen sind und wie Endgeräte in den Netzsegmenten zu positionieren sind, Festlegung für die Segmentierung von Entwicklungs- und Testsystemen (Staging), Netzzugangskontrolle für Netzsegmente mit Clients, Anbindung von Netzbereichen, die über Funktechniken oder Standleitung an die Netzsegmente angebunden sind, Anbindung der Virtualisierungs-Hosts und von virtuellen Maschinen auf den Hosts an die Netzsegmente, Rechenzentrumsautomatisierung sowie Festlegungen dazu, wie Endgeräte einzubinden sind, die mehrere Netzsegmente versorgen, z. B. Load Balancer, und Speicher- sowie Datensicherungslösungen. Abhängig von der Sicherheitsrichtlinie und der Anforderungsspezifikation SOLLTE für jedes Netzsegment konzipiert werden, wie es netztechnisch realisiert werden soll. Darüber hinaus SOLLTE festgelegt werden, welche Sicherheitsfunktionen die Koppelelemente zwischen den Netzsegmenten bereitstellen müssen (z. B. Firewall als zustandsbehafteter Paketfilter oder IDS/IPS).",
            "isresponsible": null,
            "mitigates": [
                "G 0.9",
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Trennung von Netzsegmenten",
            "handle": "NET.1.1.A23",
            "level": "Medium",
            "affects": [],
            "text": "IT-Systeme mit unterschiedlichem Schutzbedarf SOLLTEN in verschiedenen Netzsegmenten platziert werden. Ist dies nicht möglich, SOLLTE sich der Schutzbedarf nach dem höchsten vorkommenden Schutzbedarf im Netzsegment richten. Darüber hinaus SOLLTEN die Netzsegmente abhängig von ihrer Größe und den Anforderungen des Segmentierungskonzepts weiter unterteilt werden. Es MUSS sichergestellt werden, dass keine Überbrückung von Netzsegmenten oder gar Zonen möglich ist. Gehören die virtuellen LANs (VLANs) an einem Switch unterschiedlichen Institutionen an, SOLLTE die Trennung physisch erfolgen. Alternativ SOLLTEN Daten verschlüsselt werden, um die übertragenen Informationen vor unbefugtem Zugriff zu schützen. Falls VLANs eingesetzt werden, dann DARF dadurch KEINE Verbindung geschaffen werden zwischen dem internen Netz und einer Zone vor dem ALG oder den Sicherheits-Proxies. Generell MUSS sichergestellt werden, dass VLANs nicht überwunden werden können.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere logische Trennung mittels VLAN",
            "handle": "NET.1.1.A24",
            "level": "Medium",
            "affects": [],
            "text": "Falls VLANs eingesetzt werden, dann DARF dadurch KEINE Verbindung geschaffen werden zwischen dem internen Netz und einer Zone vor dem ALG oder den Sicherheits-Proxies. Generell MUSS sichergestellt werden, dass VLANs nicht überwunden werden können.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Fein- und Umsetzungsplanung von Netzarchitektur und -design",
            "handle": "NET.1.1.A25",
            "level": "Medium",
            "affects": [],
            "text": "Eine Fein- und Umsetzungsplanung für die Netzarchitektur und das Netzdesign SOLLTE durchgeführt, dokumentiert, geprüft und nachhaltig gepflegt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.9",
                "G 0.11",
                "G 0.18",
                "G 0.19",
                "G 0.22",
                "G 0.23",
                "G 0.27",
                "G 0.29",
                "G 0.30",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Spezifikation von Betriebsprozessen für das Netz",
            "handle": "NET.1.1.A26",
            "level": "Medium",
            "affects": [],
            "text": "Betriebsprozesse SOLLTEN bedarfsgerecht erzeugt oder angepasst und dokumentiert werden. Dabei SOLLTE insbesondere berücksichtigt werden, wie sich die Zonierung sowie das Segmentierungskonzept auf den IT-Betrieb auswirken.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einbindung der Netzarchitektur in die Notfallplanung",
            "handle": "NET.1.1.A27",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE initial und in regelmäßigen Abständen nachvollziehbar analysiert werden, wie sich die Netzarchitektur und die abgeleiteten Konzepte auf die Notfallplanung auswirken.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Hochverfügbare Netz- und Sicherheitskomponenten",
            "handle": "NET.1.1.A28",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Zentrale Bereiche des internen Netzes sowie die Sicherheitskomponenten SOLLTEN hochverfügbar ausgelegt sein. Dazu SOLLTEN die Komponenten redundant ausgelegt und auch intern hochverfügbar realisiert werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.25"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Hochverfügbare Realisierung von Netzanbindungen",
            "handle": "NET.1.1.A29",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die Netzanbindungen, wie z. B. Internet-Anbindung und WAN-Verbindungen, SOLLTEN vollständig redundant gestaltet werden. Je nach Verfügbarkeitsanforderung SOLLTEN redundante Anbindungen an Dienstleistende bedarfsabhängig mit unterschiedlicher Technik und Performance bedarfsgerecht umgesetzt werden. Auch SOLLTE Wegeredundanz innerhalb und außerhalb der eigenen Zuständigkeit bedarfsgerecht umgesetzt werden. Dabei SOLLTEN mögliche Single Points of Failures (SPoF) und störende Umgebungsbedingungen berücksichtigt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.9",
                "G 0.11",
                "G 0.25",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor Distributed-Denial-of-Service",
            "handle": "NET.1.1.A30",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Um DDoS-Angriffe abzuwehren, SOLLTE per Bandbreitenmanagement die verfügbare Bandbreite gezielt zwischen verschiedenen Kommunikationspartnern und -partnerinnen sowie Protokollen aufgeteilt werden. Um DDoS-Angriffe mit sehr hohen Datenraten abwehren zu können, SOLLTEN Mitigation-Dienste über größere Internet Service Provider (ISPs) eingekauft werden. Deren Nutzung SOLLTE in Verträgen geregelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.9",
                "G 0.11",
                "G 0.40"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Physische Trennung von Netzsegmenten",
            "handle": "NET.1.1.A31",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Abhängig von Sicherheitsrichtlinie und Anforderungsspezifikation SOLLTEN Netzsegmente physisch durch separate Switches getrennt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Physische Trennung von Management-Netzsegmenten",
            "handle": "NET.1.1.A32",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Abhängig von Sicherheitsrichtlinie und Anforderungsspezifikation SOLLTEN Netzsegmente des Management-Bereichs physisch voneinander getrennt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Mikrosegmentierung des Netzes",
            "handle": "NET.1.1.A33",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Das Netz SOLLTE in kleine Netzsegmente mit sehr ähnlichem Anforderungsprofil und selbem Schutzbedarf unterteilt werden. Insbesondere SOLLTE dies für die DMZ-Segmente berücksichtigt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz kryptografischer Verfahren auf Netzebene",
            "handle": "NET.1.1.A34",
            "level": "High",
            "affects": [
                "CI"
            ],
            "text": "Die Netzsegmente SOLLTEN im internen Netz, im Extranet und im DMZ-Bereich mittels kryptografischer Techniken bereits auf Netzebene realisiert werden. Dafür SOLLTEN VPN-Techniken oder IEEE 802.1AE eingesetzt werden. Wenn innerhalb von internem Netz, Extranet oder DMZ über Verbindungsstrecken kommuniziert wird, die für einen erhöhten Schutzbedarf nicht ausreichend sicher sind, SOLLTE die Kommunikation angemessen auf Netzebene verschlüsselt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.15",
                "G 0.43"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von netzbasiertem DLP",
            "handle": "NET.1.1.A35",
            "level": "High",
            "affects": [
                "CI"
            ],
            "text": "Auf Netzebene SOLLTEN Systeme zur Data Lost Prevention (DLP) eingesetzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Trennung mittels VLAN bei sehr hohem Schutzbedarf",
            "handle": "NET.1.1.A36",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Bei sehr hohem Schutzbedarf SOLLTEN KEINE VLANs eingesetzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.29"
            ]
        }
    ]
}