{
    "Informationsource": "BSI GSK 2023",
    "name": "OPS.1.2.4 Telearbeit",
    "handle": "OPS.1.2.4",
    "text": "Unter Telearbeit wird jede auf die Informations- und Kommunikationstechnik gestützte Tätigkeit verstanden, die ganz oder teilweise außerhalb der Geschäftsräume und Gebäude der Institution verrichtet wird. Bei der heimbasierten Telearbeit arbeiten die Mitarbeitenden regelmäßig tages- oder stundenweise abwechselnd an ihrem Arbeitsplatz in den Räumlichkeiten der Institution und am häuslichen Arbeitsplatz.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlende oder unzureichende Regelungen für den Telearbeitsplatz",
            "handle": "2.1",
            "text": "Die Nutzung eines Telearbeitsplatzes erfordert ergänzende organisatorische Absprachen zwischen den Mitarbeitenden und den Führungskräften. Zudem brauchen sie Handlungsanweisungen für den Fall, dass sicherheitsrelevante Vorkommnisse am Telearbeitsplatz eintreten. Gelangen beispielsweise vertrauliche Informationen in die Hände Dritter, können schwerwiegende Schäden für die Institution entstehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Regelungen für den Telearbeitsplatz",
                    "type": "Threat",
                    "text": "Fehlende oder unzureichende Regelungen für den Telearbeitsplatz können dazu führen, dass sensible Daten in die Hände unberechtigter Personen gelangen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unerlaubte private Nutzung des dienstlichen Telearbeitsrechners",
            "handle": "2.2",
            "text": "Im häuslichen Bereich kann leichter nicht geprüfte und nicht freigegebene Hard- oder Software eingesetzt werden und so durch unbedachtes Handeln beispielsweise Schadsoftware auf den Telearbeitsrechner gelangen. Dadurch könnten vertrauliche Informationen kompromittiert werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Installation von Schadsoftware",
                    "type": "Threat",
                    "text": "Durch die Installation von Schadsoftware auf dem Telearbeitsrechner können sensible Daten gestohlen oder manipuliert werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Verzögerungen durch temporär eingeschränkte Erreichbarkeit der Mitarbeitenden",
            "handle": "2.3",
            "text": "Haben die Mitarbeitenden keine festen Arbeitszeiten am Telearbeitsplatz und werden keine festen Zeiten vereinbart, an denen sie erreichbar sein müssen, kann aufgrund dessen der Arbeitsablauf verzögert werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Verzögerung von Arbeitsabläufen",
                    "type": "Threat",
                    "text": "Die fehlende Erreichbarkeit von Telearbeitenden kann zu Verzögerungen bei der Bearbeitung von Aufgaben führen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Mangelhafte Einbindung der Mitarbeitenden in den Informationsfluss",
            "handle": "2.4",
            "text": "Da die Mitarbeitenden nicht täglich in der Institution sind, haben sie weniger Gelegenheit, am direkten Informationsaustausch mit den Führungskräften sowie den Kollegen und Kolleginnen teilzuhaben. Es ist daher möglich, dass Telearbeitende insbesondere mündlich weitergegebene Informationen nicht oder erst verzögert erhalten. Hierdurch können Arbeitsabläufe und betriebliche Prozesse gestört und die Produktivität des oder der Mitarbeitenden eingeschränkt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Information über Sicherheitsvorfälle",
                    "type": "Threat",
                    "text": "Telearbeitende können aufgrund der mangelhaften Einbindung in den Informationsfluss nicht über Sicherheitsvorfälle informiert werden und somit nicht angemessen reagieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Nichtbeachtung von Sicherheitsmaßnahmen",
            "handle": "2.5",
            "text": "Am Telearbeitsplatz können beispielsweise fehlende Kontrollmöglichkeiten dazu führen, dass Mitarbeitende empfohlene oder angeordnete Sicherheitsmaßnahmen nicht oder nicht in vollem Umfang umsetzen. So können z. B. vertrauliche Informationen in die Hände Dritter geraten.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Vertrauliche Daten gelangen in die Hände Dritter",
                    "type": "Threat",
                    "text": "Telearbeitende können aufgrund der fehlenden Kontrolle über den Telearbeitsplatz vertrauliche Daten unbeabsichtigt an Dritte weitergeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelungen für Telearbeit",
            "handle": "OPS.1.2.4.A1",
            "level": "Low",
            "affects": [],
            "text": "Alle relevanten Aspekte der Telearbeit MÜSSEN geregelt werden. Zu Informationszwecken MÜSSEN den Telearbeitenden die geltenden Regelungen oder ein dafür vorgesehenes Merkblatt ausgehändigt werden, das die zu beachtenden Sicherheitsmaßnahmen erläutert. Alle strittigen Punkte MÜSSEN entweder durch Betriebsvereinbarungen oder durch zusätzlich zum Arbeitsvertrag getroffene individuelle Vereinbarungen zwischen dem Mitarbeitenden und der Institution geregelt werden. Die Regelungen MÜSSEN regelmäßig aktualisiert werden.",
            "isresponsible": "Vorgesetzte, Personalabteilung",
            "mitigates": [
                "G 0.18",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherheitstechnische Anforderungen an den Telearbeitsrechner",
            "handle": "OPS.1.2.4.A2",
            "level": "Low",
            "affects": [],
            "text": "Es MÜSSEN sicherheitstechnische Anforderungen festgelegt werden, die ein IT-System für die Telearbeit erfüllen muss. Es MUSS sichergestellt werden, dass nur autorisierte Personen Zugang zu den Telearbeitsrechnern haben. Darüber hinaus MUSS der Telearbeitsrechner so abgesichert werden, dass er nur für autorisierte Zwecke benutzt werden kann.",
            "isresponsible": null,
            "mitigates": [
                "G 0.21",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellen eines Sicherheitskonzeptes für Telearbeit",
            "handle": "OPS.1.2.4.A6",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE ein Sicherheitskonzept für die Telearbeit erstellt werden, das Sicherheitsziele, Schutzbedarf, Sicherheitsanforderungen sowie Risiken beschreibt. Das Konzept SOLLTE regelmäßig aktualisiert und überarbeitet werden. Das Sicherheitskonzept zur Telearbeit SOLLTE auf das übergreifende Sicherheitskonzept der Institution abgestimmt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelung der Nutzung von Kommunikationsmöglichkeiten bei Telearbeit",
            "handle": "OPS.1.2.4.A7",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE klar geregelt werden, welche Kommunikationsmöglichkeiten bei der Telearbeit unter welchen Rahmenbedingungen genutzt werden dürfen. Die dienstliche und private Nutzung von Internetdiensten bei der Telearbeit SOLLTE geregelt werden. Dabei SOLLTE auch geklärt werden, ob eine private Nutzung generell erlaubt oder unterbunden wird.",
            "isresponsible": "IT-Betrieb, Mitarbeitende",
            "mitigates": [
                "G 0.18",
                "G 0.30",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Informationsfluss zwischen Mitarbeitenden und Institution",
            "handle": "OPS.1.2.4.A8",
            "level": "Medium",
            "affects": [],
            "text": "Ein regelmäßiger innerbetrieblicher Informationsaustausch zwischen den Mitarbeitenden und der Institution SOLLTE gewährleistet sein. Alle Mitarbeitenden SOLLTEN zeitnah über geänderte Sicherheitsanforderungen und andere sicherheitsrelevante Aspekte informiert werden. Allen Kollegen und Kolleginnen der jeweiligen Mitarbeitenden SOLLTE bekannt sein, wann und wo diese erreicht werden können. Technische und organisatorische Telearbeitsregelungen zur Aufgabenbewältigung, zu Sicherheitsvorfällen und sonstigen Problemen SOLLTEN geregelt und an die Mitarbeitenden kommuniziert werden.",
            "isresponsible": "Vorgesetzte, Mitarbeitende",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Betreuungs- und Wartungskonzept für Telearbeitsplätze",
            "handle": "OPS.1.2.4.A9",
            "level": "Medium",
            "affects": [],
            "text": "Für Telearbeitsplätze SOLLTE ein spezielles Betreuungs- und Wartungskonzept erstellt werden. Darin SOLLTEN folgende Aspekte geregelt werden: Kontaktperson des IT-Betriebs, Wartungstermine, Fernwartung, Transport der IT-Geräte und Einführung von Standard-Telearbeitsrechnern. Damit die Mitarbeitenden einsatzfähig bleiben, SOLLTEN für sie Kontaktpersonen für Hard- und Softwareprobleme benannt werden.",
            "isresponsible": "IT-Betrieb, Mitarbeitende",
            "mitigates": [
                "G 0.18",
                "G 0.25",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung einer Anforderungsanalyse für den Telearbeitsplatz",
            "handle": "OPS.1.2.4.A10",
            "level": "Medium",
            "affects": [],
            "text": "Bevor ein Telearbeitsplatz eingerichtet wird, SOLLTE eine Anforderungsanalyse durchgeführt werden. Daraus SOLLTE z. B. hervorgehen, welche Hard- und Software-Komponenten für den Telearbeitsplatz benötigt werden. Die Anforderungen an den jeweiligen Telearbeitsplatz SOLLTEN mit den IT-Verantwortlichen abgestimmt werden. Es SOLLTE immer festgestellt und dokumentiert werden, welchen Schutzbedarf die am Telearbeitsplatz verarbeiteten Informationen haben.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sensibilisierung und Schulung der Mitarbeitenden",
            "handle": "OPS.1.2.4.A5",
            "level": "Low",
            "affects": [],
            "text": "Anhand eines Leitfadens MÜSSEN die Mitarbeitenden für die Gefahren sensibilisiert werden, die mit der Telearbeit verbunden sind. Außerdem MÜSSEN sie in die entsprechenden Sicherheitsmaßnahmen der Institution eingewiesen und im Umgang mit diesen geschult werden. Die Schulungs- und Sensibilisierungsmaßnahmen für Mitarbeitenden SOLLTEN regelmäßig wiederholt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.31"
            ]
        }
    ]
}