{
    "Informationsource": "BSI GSK 2023",
    "name": "OPS.1.1.1 Allgemeiner IT-Betrieb",
    "handle": "OPS.1.1.1",
    "text": "Der IT-Betrieb (engl. IT Operations) stellt eine Organisationseinheit und den zugehörigen Geschäftsprozess innerhalb der Informationstechnik dar. Der Prozess beschreibt die Aufgaben mit allen Tätigkeiten, die durch die Organisationseinheit IT-Betrieb umgesetzt werden. Die IT umfasst alle IT-Komponenten einer Institution, insbesondere IT-Systeme, -Dienste, -Anwendungen, -Plattformen und Netze. Zum IT-Betrieb zählen unter anderem die folgenden Aufgaben: die Verwaltung, inklusive Inventarisierung und Dokumentation, die Mitwirkung bei der Beschaffung, die In- und Außerbetriebnahme, inklusive Austausch von IT, die IT-Administration, das IT-Monitoring, das IT Incident Management. Die ordnungsgemäße, sichere und korrekte Ausführung des IT-Betriebs ist unabdingbar, um die Funktionsfähigkeit der IT zu gewährleisten. Hierzu legt der IT-Betrieb Rahmenbedingungen beispielsweise für die Prozessgestaltung fest und stellt sicher, dass diese eingehalten werden. Außerdem muss der IT-Betrieb auch die eigenen verwendeten Betriebsmittel, also die spezifischen IT-Komponenten, die für betriebliche Zwecke des IT-Betriebs eingesetzt werden, in angemessenem Umfang zur Verfügung stellen und deren Funktionsfähigkeit gewährleisten. Die betriebene IT umfasst also immer auch die Betriebsmittel des IT-Betriebs selbst. Diesen Betriebsmitteln kommt aus Sicherheitsperspektive eine besondere Bedeutung zu. Auf ihnen werden viele für die IT-Komponenten und deren Funktionsfähigkeit wichtige Informationen vorgehalten, die ein attraktives Ziel für einen Angriff bieten und daher geschützt werden müssen. Außerdem ist ihre Verfügbarkeit für den IT-Betrieb wesentlich.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Personalkapazitäten",
            "handle": "2.1",
            "text": "Das Betriebspersonal ist dafür zuständig, dass die gesamte IT funktionsfähig ist, ohne die Institutionen häufig nicht mehr operabel sind. Die IT ist besonders gefährdet, falls der IT-Betrieb nicht über ausreichende Kapazitäten verfügt. Herrscht Personalmangel, z. B. aufgrund fehlerhafter oder unzureichender Personalplanung, können Prozesse des IT-Betriebs nicht ordnungsgemäß ausgeführt werden. Dabei können neben der Verfügbarkeit auch die Vertraulichkeit und Integrität des Informationsverbundes eingeschränkt werden, z. B. wenn aufgrund von Personalmangel kein geeignetes IT-Monitoring oder Security Monitoring erfolgt. Ist das benötigte Know-how beim Betriebspersonal nicht ausreichend redundant verfügbar, da weiteres Personal beispielsweise nur unzureichend geschult wurde, kann die Abhängigkeit von einzelnen Personen dazu führen, dass die Verfügbarkeit des IT-Betriebs nicht mehr vollständig gewährleistet ist.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Mangelnde Personalplanung",
                    "type": "Threat",
                    "text": "Fehlende oder unzureichende Personalplanung führt dazu, dass Prozesse des IT-Betriebs nicht ordnungsgemäß ausgeführt werden können.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Qualifikation",
                    "type": "Threat",
                    "text": "Unzureichende Qualifikation des Personals führt dazu, dass die Verfügbarkeit des IT-Betriebs nicht mehr vollständig gewährleistet ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Verlust betriebsrelevanter Informationen",
            "handle": "2.2",
            "text": "Prozesse, die durch den IT-Betrieb unzureichend ausgeführt werden, können dazu führen, dass betriebsrelevante Informationen veraltet sind oder gar verloren gehen. Führt der IT-Betrieb Tätigkeiten aus, die auf einer unzureichenden oder manipulierten Dokumentation basieren, kann dies zu Störungen der IT-Funktionalität führen. Sind darüber hinaus die Informationen, die benötigt werden um einen Störfall zu beheben, nur unzureichend vorhanden, können diese Störungen nicht oder nur fehlerhaft behoben werden. Als Folge unzureichender Dokumentation kann sowohl die Verfügbarkeit der IT-Komponenten als auch die Vertraulichkeit der Informationen beeinträchtigt werden. Werden die betriebsrelevanten Informationen unzureichend abgesichert, z. B. indem sie offengelegt oder leicht zugänglich sind, ist deren Vertraulichkeit nicht mehr gewährleistet. Eine Ursache für den Verlust betriebsrelevanter Informationen kann z. B. eine unzureichende Abstimmung mit den beauftragten Dienstleistenden über die zu liefernde Dokumentation sein, was in den oben genannten Konsequenzen resultieren kann.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Dokumentation",
                    "type": "Threat",
                    "text": "Unzureichende Dokumentation führt zu Störungen der IT-Funktionalität.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Manipulation von Dokumenten",
                    "type": "Threat",
                    "text": "Manipulation von Dokumenten führt zu Störungen der IT-Funktionalität.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Absicherung",
                    "type": "Threat",
                    "text": "Unzureichende Absicherung von Informationen führt dazu, dass die Vertraulichkeit der Informationen nicht mehr gewährleistet ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Eingeschränkte Verfügbarkeit von Betriebsmitteln",
            "handle": "2.3",
            "text": "Betriebsmittel, worunter sämtliche IT-Komponenten zusammengefasst werden, mit denen die Tätigkeiten des IT-Betriebs erbracht werden, haben einen erheblichen Einfluss darauf, dass IT-Betriebsprozesse effizient durchgeführt werden können. Sind die Betriebsmittel unzureichend redundant ausgelegt, nur eingeschränkt gehärtet oder überlastet, kann hierdurch die Verfügbarkeit eingeschränkt sein. Falls Betriebsmittel nicht ausreichend verfügbar sind, können z. B. aufgetretene Fehler an betriebenen IT-Komponenten nicht behoben werden, wodurch die Verfügbarkeit, Integrität oder Vertraulichkeit der betriebenen IT-Komponenten gefährdet wird.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Redundanz",
                    "type": "Threat",
                    "text": "Unzureichende Redundanz von Betriebsmitteln führt dazu, dass die Verfügbarkeit der IT-Komponenten eingeschränkt ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überlastung von Betriebsmitteln",
                    "type": "Threat",
                    "text": "Überlastung von Betriebsmitteln führt dazu, dass die Verfügbarkeit der IT-Komponenten eingeschränkt ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Missbrauch betriebsrelevanter Informationen und privilegierter Rechte durch berechtigte Personen",
            "handle": "2.4",
            "text": "Privilegierte Rechte des Betriebspersonals ermöglichen weitreichende Auswirkungen auf die gesamte IT. Werden betriebsrelevante Informationen und privilegierte Rechte durch berechtigte Personen missbraucht, um zu sabotieren, zu manipulieren oder Informationen auszuspähen, sind alle Schutzziele der Informationssicherheit für die betriebenen IT-Komponenten und für die Informationen der Institution gefährdet. Diese Ausgangslage kann mehrere Ursachen haben. Verfügt das Betriebspersonal über zu weit gefasste privilegierte Rechte, können diese Berechtigungen für Angriffe missbraucht werden. Auch kann durch Nötigung, Phishing oder Social Engineering erzwungen werden, dass weitreichende Rechte freigegeben oder betriebsrelevante Informationen preisgegeben werden. Wenn internes oder externes Betriebspersonal ausscheidet und die entsprechenden Prozesse unzureichend ausgeführt werden, können solche Personen weiterhin die privilegierten Rechte nutzen. Ebenso können Sammel-Accounts bewirken, dass z. B. beim Wechsel des Arbeitsfeldes weiterhin Zugang zu betriebsrelevanten Informationen und Betriebsmitteln gewährt wird. Betriebsrelevante Informationen können auch durch menschliche Fehler preisgegeben werden, indem beispielsweise Regelungen nicht umgesetzt werden, die Ausspähung oder Diebstahl verhindern.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Missbrauch von Privilegien",
                    "type": "Threat",
                    "text": "Missbrauch von Privilegien durch berechtigte Personen gefährdet die Informationssicherheit.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Nötigung",
                    "type": "Threat",
                    "text": "Nötigung von berechtigten Personen führt dazu, dass diese weitreichende Rechte freigeben oder betriebsrelevante Informationen preisgeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Phishing",
                    "type": "Threat",
                    "text": "Phishing von berechtigten Personen führt dazu, dass diese weitreichende Rechte freigeben oder betriebsrelevante Informationen preisgeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Social Engineering",
                    "type": "Threat",
                    "text": "Social Engineering von berechtigten Personen führt dazu, dass diese weitreichende Rechte freigeben oder betriebsrelevante Informationen preisgeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Prozesse beim Ausscheiden von Personal",
                    "type": "Threat",
                    "text": "Unzureichende Prozesse beim Ausscheiden von Personal führen dazu, dass diese Personen weiterhin die privilegierten Rechte nutzen können.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Sammel-Accounts",
                    "type": "Threat",
                    "text": "Sammel-Accounts führen dazu, dass Personen weiterhin Zugang zu betriebsrelevanten Informationen und Betriebsmitteln haben, obwohl sie diese nicht mehr benötigen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Menschliche Fehler",
                    "type": "Threat",
                    "text": "Menschliche Fehler führen dazu, dass Betriebsrelevante Informationen preisgegeben werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Erreichbarkeit oder Ausspähen von Betriebsmitteln und betriebsrelevanten Informationen durch Unbefugte",
            "handle": "2.5",
            "text": "Besteht kein ausreichender Schutz gegen unbefugte Zutritte zu Räumlichkeiten, in denen Betriebsmittel positioniert sind, kann dies als Ausgangspunkt für jede Art von Angriffen bzw. Missbrauch ausgenutzt werden. Folglich können alle Schutzziele der Informationssicherheit beeinträchtigt werden. Schnittstellen bzw. Zugänge des IT-Betriebs, die unzureichend abgesichert werden, können begünstigen, dass unbefugte Personen Betriebsmittel und betriebsrelevante Informationen erreichen oder ausspähen können.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unbefugter Zutritt zu Räumlichkeiten",
                    "type": "Threat",
                    "text": "Unbefugter Zutritt zu Räumlichkeiten, in denen Betriebsmittel positioniert sind, kann als Ausgangspunkt für jede Art von Angriffen bzw. Missbrauch ausgenutzt werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Absicherung von Schnittstellen",
                    "type": "Threat",
                    "text": "Unzureichende Absicherung von Schnittstellen des IT-Betriebs kann dazu führen, dass unbefugte Personen Betriebsmittel und betriebsrelevante Informationen erreichen oder ausspähen können.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehleiten des IT-Betriebs",
            "handle": "2.6",
            "text": "Spiegeln interne oder externe Personen dem IT-Betrieb bewusst falsche Tatsachen vor, indem sich diese z. B. fälschlicherweise als andere Person ausgeben, kann der IT-Betrieb zu falschen Reaktionen verleitet werden. Dabei können z. B. Phishing E-Mails, die an den IT-Betrieb gesendet werden, inkorrekte Tätigkeiten auslösen. Abhängig davon, wie der IT-Betrieb fehlgeleitet wird, können alle Schutzziele der Informationssicherheit erheblich gefährdet werden. Die Verfügbarkeit kann eingeschränkt werden, wenn zum Beispiel die Administrierenden dazu verleitet werden, IT-Systeme auszuschalten.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Phishing",
                    "type": "Threat",
                    "text": "Phishing-E-Mails, die an den IT-Betrieb gesendet werden, können inkorrekte Tätigkeiten auslösen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Verhinderung von Betriebsprozessen",
            "handle": "2.7",
            "text": "Werden die Tätigkeiten des IT-Betriebs blockiert und somit nicht ordnungsgemäß ausgeführt, kann hierdurch die Verfügbarkeit und die Integrität der gesamten IT beeinträchtigt werden. Eine mögliche Ursache kann eine unzureichende Konzeptionierung und Beschaffung von IT-Komponenten sein, indem z. B. nicht berücksichtigt wurde, ob die Anwendungen gut betrieben werden können. Ebenso kann die Fehlplanung von Prozessen, z. B. durch unklare Schnittstellen oder Zuständigkeiten, dazu führen, dass der IT-Betrieb nur unzureichend ausgeführt wird. Auch inkorrekt ausgeführte Tätigkeiten des Betriebspersonals, die z. B. auf unzureichendes Know-how über Betriebsprozesse zurückzuführen sind, können bewirken, dass Betriebsprozesse verhindert werden und dadurch die gesamte IT nur noch eingeschränkt verfügbar bzw. funktionstüchtig ist. Ebenso kann das Verhalten des Betriebspersonals oder die Tätigkeiten von verschiedenen Dienstleistenden mit nicht klar abgegrenzten Schnittstellen verhindern, dass Betriebsprozesse korrekt ausgeführt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Konzeptionierung und Beschaffung",
                    "type": "Threat",
                    "text": "Unzureichende Konzeptionierung und Beschaffung von IT-Komponenten führt dazu, dass die Verfügbarkeit und die Integrität der gesamten IT beeinträchtigt werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlplanung von Prozessen",
                    "type": "Threat",
                    "text": "Fehlplanung von Prozessen führt dazu, dass der IT-Betrieb nur unzureichend ausgeführt wird.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Inkorrekt ausgeführte Tätigkeiten",
                    "type": "Threat",
                    "text": "Inkorrekt ausgeführte Tätigkeiten des Betriebspersonals führen dazu, dass Betriebsprozesse verhindert werden und dadurch die gesamte IT nur noch eingeschränkt verfügbar bzw. funktionstüchtig ist.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Abstimmung zwischen Dienstleistenden",
                    "type": "Threat",
                    "text": "Unzureichende Abstimmung zwischen Dienstleistenden führt dazu, dass Betriebsprozesse nicht korrekt ausgeführt werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung der Aufgaben und Zuständigkeiten des IT-Betriebs",
            "handle": "OPS.1.1.1.A1",
            "level": "Low",
            "affects": [],
            "text": "Für alle betriebenen IT-Komponenten MUSS festgelegt werden, welche Aufgaben für den IT-Betrieb anfallen und wer dafür zuständig ist. Hierfür MÜSSEN die entsprechenden Rechte, Pflichten, Aufgaben mit den hierfür erforderlichen Tätigkeiten, Befugnisse und zugehörigen Prozesse geregelt werden. Weiterhin MÜSSEN die Schnittstellen und Meldewege sowie das Eskalationsmanagement zwischen verschiedenen Betriebseinheiten und gegenüber anderen organisatorischen Einheiten der Institution festgelegt werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung von Rollen und Berechtigungen für den IT-Betrieb",
            "handle": "OPS.1.1.1.A2",
            "level": "Low",
            "affects": [],
            "text": "Für alle betriebenen IT-Komponenten MUSS das jeweilige Rollen- und Berechtigungskonzept auch Rollen und zugehörige Berechtigungen für den IT-Betrieb festlegen. Für die Betriebsmittel MUSS ebenfalls ein Rollen- und Berechtigungskonzept erstellt werden. Das Rollen- und Berechtigungskonzept für den IT-Betrieb MUSS die IT-Nutzung von IT-Betriebsaufgaben trennen. Administrationsaufgaben und sonstige Betriebsaufgaben MÜSSEN durch unterschiedliche Rollen getrennt werden. Grundsätzlich SOLLTE der IT-Betrieb für unterschiedliche Betriebstätigkeiten unterschiedliche Rollen festlegen, die für die jeweiligen Tätigkeiten die erforderlichen Berechtigungen besitzen. Sammel-Accounts DÜRFEN NUR in begründeten Ausnahmefällen eingerichtet werden. Die Rollen und Berechtigungen MÜSSEN regelmäßig geprüft und auf die aktuellen Gegebenheiten angepasst werden. Insbesondere MÜSSEN die Berechtigungen von ausgeschiedenem Personal auf den IT-Komponenten entfernt werden. Ebenso MÜSSEN die Rollen und Berechtigungen gelöscht werden, wenn IT-Komponenten außer Betrieb genommenen werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.30",
                "G 0.32"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellen von Betriebshandbüchern für die betriebene IT",
            "handle": "OPS.1.1.1.A3",
            "level": "Medium",
            "affects": [],
            "text": "Für alle betriebenen IT-Komponenten SOLLTEN die Betriebsaufgaben geplant und in Betriebshandbüchern erfasst werden. Die Betriebshandbücher SOLLTEN stets verfügbar sein und mindestens die folgenden Themen adressieren: relevante System- und Kontaktinformationen, erforderliche und zulässige Betriebsmittel, allgemeine Konfigurationsvorgaben, Konfigurationsvorgaben zur Härtung von Spezialsystemen, Rollen- und Berechtigungen, IT-Monitoring, Protokollierung und Alarmierung, Datensicherung und Notfallkonzepte, IT Incident Management, Vorgaben für alle regelmäßigen und außerplanmäßigen Tätigkeiten. Die Betriebshandbücher SOLLTEN regelmäßig und anlassbezogen geprüft und angepasst werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Bereitstellen ausreichender Personal- und Sachressourcen",
            "handle": "OPS.1.1.1.A4",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE über ausreichende Personal-Ressourcen verfügen, um einen ordnungsgemäßen IT-Betrieb gewährleisten zu können. Hierfür SOLLTE der Aufwand für alle Tätigkeiten des IT-Betriebs ermittelt werden. Die Personal-Ressourcen SOLLTEN mit angemessenen Redundanzen und Reserven geplant werden und auch kurzfristige Personalausfälle sowie temporär erhöhte Personalbedarfe berücksichtigen. Ebenfalls SOLLTEN geeignete Sach-Ressourcen bereitstehen. Hierfür SOLLTE für jede Tätigkeit des IT-Betriebs identifiziert werden, welche Betriebsmittel erforderlich sind. Die Ressourcenplanung SOLLTE regelmäßig und anlassbezogen überprüft und an die aktuellen Erfordernisse angepasst werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.27",
                "G 0.33"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegen von gehärteten Standardkonfigurationen",
            "handle": "OPS.1.1.1.A5",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE die betriebenen IT-Komponenten kategorisieren und für diese Kategorien gehärtete Standardkonfigurationen festlegen und bereitstellen. Für IT-Plattformen wie Virtualisierungshosts, auf denen weitere IT-Komponenten bereitgestellt und betrieben werden, SOLLTE eine abgestimmte Härtung entwickelt und umgesetzt werden, die alle Elemente der IT-Komponenten berücksichtigt. Hierbei SOLLTEN verschiedene Ausprägungen der IT-Komponenten berücksichtigt und erlaubte Abweichungen spezifiziert werden. Die Konfigurationsvorgaben SOLLTEN die Sicherheitsanforderungen der Institution umsetzen und die Empfehlungen der jeweiligen Herstellenden berücksichtigen. Die gehärteten Standard-Konfigurationen SOLLTEN in den jeweiligen Betriebshandbüchern dokumentiert werden. Jede Standardkonfiguration SOLLTE vor Bereitstellung getestet werden. Die gehärteten Standardkonfigurationen SOLLTEN regelmäßig und anlassbezogen geprüft und gemäß der verfügbaren Informationen an den aktuellen Stand der Technik angepasst werden. Der IT-Betrieb SOLLTE gewährleisten, dass die aktuellen Konfigurationsvorgaben stets verfügbar sind und über eine Versionierung und eine Beschreibung identifizierbar sind.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.23",
                "G 0.25",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung des IT-Asset-Managements",
            "handle": "OPS.1.1.1.A6",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE eine Übersicht aller vorhandenen IT-Assets erstellen, regelmäßig prüfen und aktuell halten. Im IT-Asset-Management (ITAM) SOLLTEN alle produktiven IT-Komponenten, Test-Instanzen und IT-Komponenten der Reservevorhaltung erfasst werden. Auch vorhandene, aber nicht mehr genutzte IT-Assets SOLLTEN erfasst werden. Es SOLLTEN ITAM-Tools eingesetzt werden, die eine zentrale Verwaltung der IT-Assets ermöglichen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherstellung eines ordnungsgemäßen IT-Betriebs",
            "handle": "OPS.1.1.1.A7",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE für alle IT-Komponenten Betriebskonzepte entwickeln. Diese Betriebskonzepte SOLLTEN regelmäßig geprüft und angepasst werden. Die sicherheitsrelevanten Vorgaben zur Konfiguration SOLLTEN umgesetzt werden. Dafür SOLLTEN die gehärteten Standard-Konfigurationen genutzt werden. Der IT-Betrieb SOLLTE für alle Tätigkeiten Prüfkriterien festlegen, die in ihrer Gesamtheit als Leitfaden für den ordnungsgemäßen IT-Betrieb dienen. Die Freigabe von installierten oder geänderten IT-Komponenten in den produktiven Betrieb SOLLTE über diese Prüfkriterien nachgewiesen werden. Bei Inbetriebnahme und nach Updates oder Umstrukturierungen SOLLTEN Systemtests für die IT-Komponenten durchgeführt werden. Der IT-Betrieb SOLLTE festlegen, in welcher Umgebung die jeweiligen Systemtests mit welcher Testabdeckung und Testtiefe durchgeführt werden. Der IT-Betrieb SOLLTE Vorkehrungen für die Ersatzbeschaffung von IT-Komponenten treffen. Hierfür SOLLTEN eine Reservevorhaltung oder Lieferverträge vorgesehen werden. Alle Tätigkeiten des IT-Betriebs SOLLTEN umfassend und nachvollziehbar erfasst werden. Hierfür SOLLTE der IT-Betrieb ein geeignetes Werkzeug wie ein Ticketsystem nutzen. Der IT-Betrieb SOLLTE insbesondere die Qualität der Betriebsprozesse, die Einhaltung von SLAs und die Zufriedenheit der Benutzenden systematisch erfassen. Es SOLLTEN regelmäßig Reports erstellt werden, die dem Nachweis eines ordnungsgemäßen IT-Betriebs dienen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.19",
                "G 0.27",
                "G 0.28"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelmäßiger Soll-Ist-Vergleich",
            "handle": "OPS.1.1.1.A8",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE regelmäßig und anlassbezogen für alle betriebenen IT-Komponenten sowie für die Betriebsmittel prüfen, ob die aktuelle Konfiguration dem Sollzustand entspricht. Darüber hinaus SOLLTE geprüft werden, ob die gelebten Prozesse die festgelegten Prozesse des IT-Betriebs umsetzen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung von IT-Monitoring",
            "handle": "OPS.1.1.1.A9",
            "level": "Medium",
            "affects": [],
            "text": "Alle IT-Komponenten SOLLTEN in ein einheitliches IT-Monitoring eingebunden werden, das alle relevanten Parameter der IT-Komponenten beinhaltet. Das IT-Monitoring SOLLTE mit dem übergeordneten Service-Management abgestimmt werden. Der IT-Betrieb SOLLTE das IT-Monitoring entsprechend eines vorher festgelegten Monitoring-Plans durchführen. Je IT-Komponente SOLLTEN angemessene Schwellwerte ermittelt werden, die eine Meldung oder einen Alarm auslösen. Der IT-Betrieb SOLLTE für das IT-Monitoring spezifizieren, welche Meldewege genutzt werden und welche Konsequenzen aus den Meldungen oder Alarmen gezogen werden. Auf Basis von Monitoring-Ergebnissen SOLLTE überprüft werden, ob die Infrastruktur erweitert oder angepasst wird. Über die gewonnenen Erkenntnisse SOLLTEN regelmäßig Reports erstellt werden, die das aktuelle Lagebild der betriebenen IT und die zeitliche Entwicklung sowie Trends darstellen. Die Konzeption des IT-Monitorings SOLLTE regelmäßig und anlassbezogen geprüft und aktualisiert werden, um dem aktuellen Stand der Technik und der betriebenen Infrastruktur zu entsprechen. Die Monitoring-Daten SOLLTEN nur über sichere Kommunikationswege übertragen werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.15",
                "G 0.18",
                "G 0.22",
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Führen eines Schwachstelleninventars",
            "handle": "OPS.1.1.1.A10",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE ein Schwachstelleninventar führen, in dem die Schwachstellen aller betriebenen IT-Komponenten und der Umgang mit diesen zentral erfasst und gepflegt werden. Der IT-Betrieb SOLLTE die Behandlung der Schwachstellen initiieren, nachhalten und sicherstellen. Es SOLLTE ein Prozess definiert werden, der den Umgang mit den Schwachstellen festlegt. Mindestens SOLLTE spezifiziert werden, bis wann ein verfügbares Update, in dem die Schwachstelle behoben ist, zu installieren ist, in welchen Fällen und bis wann IT-Komponenten mit Schwachstellen außer Betrieb genommen oder ersetzt werden und ob und wie solche IT-Komponenten separiert werden, falls weder ein Ersatz noch ein Update möglich ist.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.23",
                "G 0.28"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung und Einhaltung von SLAs",
            "handle": "OPS.1.1.1.A11",
            "level": "Medium",
            "affects": [],
            "text": "Für alle IT-Komponenten und alle Tätigkeiten SOLLTE der IT-Betrieb Service Level Agreements (SLAs) definieren und überwachen, die dem Schutzbedarf der IT-Komponenten entsprechen und innerhalb der Institution abgestimmt sind. Die festgelegten SLAs SOLLTEN die Rollen und Berechtigungen sowie eventuelle Abhängigkeiten der jeweiligen Tätigkeit von anderen Organisationseinheiten berücksichtigen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Spezifikation und Umsetzung klarer Betriebsprozesse",
            "handle": "OPS.1.1.1.A12",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE für alle Aufgaben Betriebsprozesse spezifizieren, die für die jeweilige Aufgabe alle Tätigkeiten und Abhängigkeiten umfassen und gewährleisten, dass die Tätigkeiten des IT-Betriebs nachvollziehbar sind. Es SOLLTE für jeden Prozess festgelegt werden, wer den Prozess initiieren darf und wer diesen umsetzt. Für jeden Prozess SOLLTEN die organisatorischen Schnittstellen zu anderen Gruppen des IT-Betriebs oder anderen Organisationseinheiten spezifiziert werden. Das Personal des IT-Betriebs SOLLTE für die relevanten Betriebsprozesse eingewiesen werden. Wenn Prozesse durchlaufen wurden, SOLLTE dies protokolliert werden. Das Ergebnis des Durchlaufs SOLLTE protokolliert werden. Für jeden Prozessschritt SOLLTE festgelegt werden, ob dokumentiert werden muss, dass er bearbeitet wurde. Darüber hinaus SOLLTE festgelegt werden, wann der Prozess erfolgreich abgeschlossen ist. Der IT-Betrieb SOLLTE einen Prozess spezifizieren, der grundsätzlich beschreibt, wie mit Situationen umzugehen ist, die nicht in den regulären Betriebsprozessen enthalten sind. Mindestens SOLLTEN Fallback-Prozesse definiert sein und beschrieben werden, wie bei fehlerhaftem oder manipuliertem Betrieb vorzugehen ist.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung der Betriebsmittel und der Dokumentation",
            "handle": "OPS.1.1.1.A13",
            "level": "Medium",
            "affects": [],
            "text": "Auf die Betriebsmittel, die Dokumentation und die Betriebshandbücher SOLLTEN nur berechtigte Personen des IT-Betriebs zugreifen können. Der IT-Betrieb SOLLTE sicherstellen, dass die Betriebsmittel und die Dokumentation zu jeder Zeit verfügbar sind. Falls die IT-Systeme und -Anwendungen der Betriebsmittel über die produktive Infrastruktur kommunizieren, SOLLTEN sichere Protokolle verwendet werden. Vertrauliche Daten SOLLTEN ausschließlich über sichere Protokolle übertragen werden. Die Betriebsmittel SOLLTEN in das Schwachstellenmanagement und das IT-Monitoring eingebunden werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.14",
                "G 0.19",
                "G 0.22"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Berücksichtigung der Betreibbarkeit bei Konzeption und Beschaffung",
            "handle": "OPS.1.1.1.A14",
            "level": "Medium",
            "affects": [],
            "text": "Für die IT-Komponenten SOLLTEN Anforderungen für einen effizienten und sicheren Betrieb bereits bei der Konzeption und der Beschaffung berücksichtigt werden. Hierfür SOLLTEN die Anforderungen des IT-Betriebs erhoben und berücksichtigt werden. Der IT-Betrieb SOLLTE dabei auch die Komplexität der IT berücksichtigen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung und Einsatz von Betriebsmitteln",
            "handle": "OPS.1.1.1.A15",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE für alle IT-Komponenten die Betriebsmittel bedarfsgerecht planen, beschaffen und einsetzen. Der IT-Betrieb SOLLTE die Anforderungen an die jeweiligen Betriebsmittel ermitteln und diese mit den anderen betroffenen Organisationseinheiten der Institution abstimmen. Die Netze, in denen die Betriebsmittel positioniert sind, SOLLTEN von den sonstigen Netzen der Institution mindestens logisch getrennt werden (siehe Baustein NET.1.1 Netzarchitektur und -design). Das Netz für die Betriebsmittel SOLLTE abhängig von Sicherheitsrichtlinie und Funktionsabhängigkeiten weiter unterteilt werden. Als Basis für die weitere Segmentierung SOLLTEN die unterschiedlichen Betriebsgruppen und Zielsysteme verwendet werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.15",
                "G 0.18",
                "G 0.22",
                "G 0.23"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schulung des Betriebspersonals",
            "handle": "OPS.1.1.1.A16",
            "level": "Medium",
            "affects": [],
            "text": "Für den IT-Betrieb SOLLTE durch einen Schulungsplan sichergestellt werden, dass für alle IT-Komponenten und Betriebsmittel jeweils mehrere Personen die erforderlichen Fähigkeiten und Qualifikationen besitzen. In den Schulungsmaßnahmen SOLLTEN insbesondere die folgenden Themen adressiert werden: Härtung und Standard-Konfigurationen, spezifische Sicherheitseinstellungen für die betriebenen IT-Komponenten und eingesetzten Betriebsmittel, mögliche Interferenzen zwischen den genutzten Betriebsmitteln, Abhängigkeiten und Schnittstellen der Prozesse des IT-Betriebs. Wenn neue IT-Komponenten beschafft werden, SOLLTE ein Budget für entsprechende Schulungsmaßnahmen des IT-Betriebs eingeplant werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung des IT-Betriebs unter besonderer Berücksichtigung von Mangel- und Notsituationen",
            "handle": "OPS.1.1.1.A17",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE für die betriebenen IT-Komponenten definieren, wann eine Mangel- oder eine Notsituation vorliegt. Für diese Situationen SOLLTE nach den Vorgaben des allgemeinen Notfallmanagements festgelegt werden, welche IT-Komponenten vorrangig betrieben werden oder für einen Mindestbetrieb benötigt werden. Die Notfallplanung SOLLTE die folgenden Punkte beinhalten: Disaster-Recovery-Plan, Notfallhandbuch für die IT-Komponenten unter Einbeziehung der gesamten Infrastruktur, Umgang mit kritischen und längerfristigen betriebsbehindernden Störungen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.25"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung des Einsatzes von Dienstleistenden",
            "handle": "OPS.1.1.1.A18",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE den Einsatz von Dienstleistenden koordinieren und diese unter anderem über SLAs so steuern, dass die Dienstleistung in ausreichendem Maße erbracht wird. Der Einsatz von verschiedenen Dienstleistenden SOLLTE aufeinander abgestimmt werden, insbesondere falls diese für den gleichen Tätigkeitsbereich vorgesehen sind. Für solche Situationen SOLLTE jeweils eine eindeutige Kommunikationsschnittstelle festgelegt werden. Der IT-Betrieb SOLLTE die Festlegungen zum Dienstleistendenmanagement sowie die für die Dienstleistenden vorgesehenen Tätigkeiten festhalten, regelmäßig prüfen und anpassen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelungen für Wartungs- und Reparaturarbeiten",
            "handle": "OPS.1.1.1.A19",
            "level": "Medium",
            "affects": [],
            "text": "IT-Komponenten SOLLTEN regelmäßig gewartet werden. Es SOLLTE geregelt sein, welche Sicherheitsaspekte bei Wartungs- und Reparaturarbeiten zu beachten sind. Es SOLLTE festgelegt werden, wer für die Wartung oder Reparatur von IT-Komponenten zuständig ist. Durchgeführte Wartungs- und Reparaturarbeiten SOLLTEN dokumentiert werden. Es SOLLTE sichergestellt werden, dass Wartungs- und Reparaturarbeiten, die durch Dritte ausgeführt werden, mit den Beteiligten abgestimmt sind. Es SOLLTEN interne Mitarbeitende des IT-Betriebs bestimmt werden, die solche Arbeiten autorisieren, gegebenenfalls beobachten oder unterstützen und abnehmen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.25"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Prüfen auf Schwachstellen",
            "handle": "OPS.1.1.1.A20",
            "level": "Medium",
            "affects": [],
            "text": "Der IT-Betrieb SOLLTE regelmäßig Informationen über bekannt gewordene Schwachstellen bezüglich der IT-Plattformen, Firmware, Betriebssysteme, eingesetzter IT-Anwendungen und Dienste einholen, diese für die konkreten Gegebenheiten analysieren und berücksichtigen. Die IT-Komponenten SOLLTEN regelmäßig und anlassbezogen auf Schwachstellen getestet werden. Für jede IT-Komponente SOLLTEN die angemessene Test-Abdeckung, -Tiefe und -Methode festgelegt werden. Die Tests und identifizierten Schwachstellen SOLLTEN nachvollziehbar erfasst werden. Die Schwachstellen SOLLTEN so schnell wie möglich behoben werden. Solange keine entsprechenden Patches zur Verfügung stehen, MÜSSEN für schwerwiegende Schwachstellen und Bedrohungen andere Maßnahmen zum Schutz der IT-Komponente getroffen werden. Falls dies für eine IT-Komponente nicht möglich ist, SOLLTE diese nicht weiter betrieben werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.23",
                "G 0.28"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einbinden der Betriebsmittel in das Sicherheitsmonitoring",
            "handle": "OPS.1.1.1.A21",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Die IT-Systeme und -Anwendungen, die als Betriebsmittel genutzt werden, SOLLTEN in ein Sicherheitsmonitoring eingebunden werden. Falls die Institution ein System zur zentralen Detektion und automatisierten Echtzeitüberprüfung von Ereignismeldungen einsetzt, SOLLTEN die Betriebsmittel darin eingebunden werden. Betriebsmittel wie IT-Management- und IT-Monitoring-Systeme SOLLTEN als Datenquelle für das Sicherheitsmonitoring genutzt werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.23",
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Automatisierte Tests auf Schwachstellen",
            "handle": "OPS.1.1.1.A22",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Alle IT-Komponenten SOLLTEN regelmäßig und automatisiert auf Schwachstellen getestet werden. Die Ergebnisse der Tests SOLLTEN automatisiert protokolliert und anderen Werkzeugen im Sicherheitsmonitoring bereitgestellt werden. Bei kritischen Schwachstellen SOLLTE eine automatisierte Alarmierung erfolgen.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.23",
                "G 0.28"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung von Penetrationstests",
            "handle": "OPS.1.1.1.A23",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Für alle IT-Komponenten SOLLTEN Penetrationstests durchgeführt werden. Hierfür SOLLTE ein Konzept erstellt und umgesetzt werden, das neben den zu verwendenden Testmethoden und Testtiefen auch die Erfolgskriterien festlegt.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.23"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Umfassendes Protokollieren der Prozessschritte im IT-Betrieb",
            "handle": "OPS.1.1.1.A24",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Für die Betriebsprozesse SOLLTE jeder Prozessschritt nachvollziehbar protokolliert werden.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.18",
                "G 0.37"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherstellen von autark funktionierenden Betriebsmitteln",
            "handle": "OPS.1.1.1.A25",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Für die Betriebsmittel SOLLTE sichergestellt werden, dass diese auch bei äußeren Störungen genutzt werden können. Insbesondere SOLLTE eine ausgefallene Internet-Anbindung nicht zu einer Störung der Betriebsmittel führen. Die Betriebsmittel SOLLTEN so konfiguriert und verortet werden, dass die Abhängigkeiten zwischen den verschiedenen Betriebsmitteln minimiert wird. Es SOLLTE verhindert werden, dass der Ausfall eines Betriebsmittels zu einer betriebsverhindernden Störung eines anderen Betriebsmittels führt.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.25"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Proaktive Instandhaltung im IT-Betrieb",
            "handle": "OPS.1.1.1.A26",
            "level": "High",
            "affects": [
                "IA"
            ],
            "text": "Für die IT-Systeme SOLLTE eine proaktive Instandhaltung durchgeführt werden, in der in festgelegten Intervallen vorbeugende Instandhaltungsmaßnahmen durchgeführt werden. Ergänzend zu der regelmäßigen Wartung und der proaktiven Instandhaltung SOLLTE je IT-Komponente abgewogen werden, ob eine vorausschauende Instandhaltung (engl. Predictive Maintenance) genutzt wird.",
            "isresponsible": "IT-Betrieb",
            "mitigates": [
                "G 0.25"
            ]
        }
    ]
}