{
    "Informationsource": "BSI GSK 2023",
    "name": "OPS.2.3 Nutzung von Outsourcing",
    "handle": "OPS.2.3",
    "text": "Beim Outsourcing lagern Institutionen (Nutzende von Outsourcing) Geschäftsprozesse oder Tätigkeiten ganz oder teilweise zu einem oder mehreren externen Dienstleistungsunternehmen (Anbietende von Outsourcing) aus. Diese sogenannten Anbietenden von Outsourcing betreiben im Rahmen des vereinbarten Outsourcing-Verhältnisses die Geschäftsprozesse oder Tätigkeiten nach festgelegten Kriterien. Allerdings verbleibt die Verantwortung aus Sicht der Informationssicherheit stets bei der auslagernden Institution.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Strategie für das Outsourcing",
            "handle": "2.1",
            "text": "Eine unzureichende Strategie führt dazu, dass die Informationssicherheit in Outsourcing-Vorhaben nicht angemessen berücksichtigt wird. Hierdurch wird die Informationssicherheit nicht angemessen in den einzelnen Phasen des Outsourcing-Lebenszyklus beachtet und somit kein ausreichendes Niveau der Informationssicherheit in der eigenen Institution sowie bei Anbietenden von Outsourcing angestrebt und umgesetzt. Dadurch können Prozesse beeinträchtigt, ausfallen und Informationen an unbefugte Dritte abfließen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Berücksichtigung der Informationssicherheit in der Planungsphase",
                    "type": "Threat",
                    "text": "Die Informationssicherheit wird nicht in der Planungsphase des Outsourcing-Vorhabens berücksichtigt. Dadurch werden die Risiken für die Informationssicherheit nicht ausreichend bewertet und es werden keine geeigneten Maßnahmen zur Risikominderung getroffen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Berücksichtigung der Informationssicherheit in der Durchführungsphase",
                    "type": "Threat",
                    "text": "Die Informationssicherheit wird nicht in der Durchführungsphase des Outsourcing-Vorhabens berücksichtigt. Dadurch werden die Risiken für die Informationssicherheit nicht ausreichend bewertet und es werden keine geeigneten Maßnahmen zur Risikominderung getroffen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Berücksichtigung der Informationssicherheit in der Kontrollphase",
                    "type": "Threat",
                    "text": "Die Informationssicherheit wird nicht in der Kontrollphase des Outsourcing-Vorhabens berücksichtigt. Dadurch werden die Risiken für die Informationssicherheit nicht ausreichend bewertet und es werden keine geeigneten Maßnahmen zur Risikominderung getroffen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Gefahr des Outsourcings von institutionskritischen Prozessen",
            "handle": "2.2",
            "text": "Prozesse, die aufgrund ihrer Kritikalität oder des Schutzbedarfs in der Institution verbleiben sollten, werden ausgelagert. Infolgedessen kann die Institution den Prozess, der für den ordentlichen Geschäftsbetrieb notwendig ist, nicht mehr angemessen kontrollieren und steuern. Wenn der Prozess ausfällt oder gestört wird, kann kein ordentlicher Geschäftsbetrieb sichergestellt werden. Darüber hinaus gewinnen die Anbietenden von Outsourcing einen größeren Einfluss. Es droht den Nutzenden von Outsourcing ein Steuerungsverlust.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Auslagerung von kritischen Prozessen ohne ausreichende Kontrolle",
                    "type": "Threat",
                    "text": "Die Institution lagert kritische Prozesse an Anbietende von Outsourcing aus, ohne ausreichende Kontrollen und Sicherheitsvorkehrungen zu treffen. Dadurch kann die Institution den Prozess nicht mehr angemessen kontrollieren und steuern. Wenn der Prozess ausfällt oder gestört wird, kann kein ordentlicher Geschäftsbetrieb sichergestellt werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Abhängigkeit von Anbietenden von Outsourcing",
            "handle": "2.3",
            "text": "Entscheidet sich eine Institution für Outsourcing, macht sie sich damit auch von Anbietenden von Outsourcing abhängig. Mit dieser Abhängigkeit kann Wissen verloren gehen und die ausgelagerten Prozesse können nicht mehr vollständig kontrolliert werden. Außerdem könnte der Schutzbedarf der ausgelagerten Geschäftsprozesse und Informationen unterschiedlich eingeschätzt werden. Dies kann dazu führen, dass für den Schutzbedarf entsprechend ungeeignete Sicherheitsmaßnahmen umgesetzt werden. Häufig lagern Institutionen gesamte Geschäftsprozesse an Anbietende von Outsourcing aus. Die Anbietenden von Outsourcing können dadurch die Geschäftsprozesse mit schutzbedürftigen Informationen, Ressourcen und IT-Systemen vollständig kontrollieren. Gleichzeitig nimmt das Wissen über diese Bereiche bei Nutzenden von Outsourcing ab. Als Folge ist es möglich, dass die Nutzenden von Outsourcing Defizite der Informationssicherheit nicht mehr bemerken. Diese Situation könnte von Anbietenden von Outsourcing ausgenutzt werden, z. B. indem sie drastisch die Preise erhöhen oder die Qualität der Dienstleistungen abnimmt.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Wissensverlust durch Auslagerung",
                    "type": "Threat",
                    "text": "Die Institution verliert durch die Auslagerung von Prozessen an Wissen und Expertise. Dadurch kann die Institution die ausgelagerten Prozesse nicht mehr vollständig kontrollieren und steuern.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unterschiedliche Einschätzung des Schutzbedarfs",
                    "type": "Threat",
                    "text": "Die Institution und die Anbietenden von Outsourcing schätzen den Schutzbedarf der ausgelagerten Geschäftsprozesse und Informationen unterschiedlich ein. Dadurch werden möglicherweise ungeeignete Sicherheitsmaßnahmen umgesetzt.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausnutzung der Abhängigkeit durch Anbietende von Outsourcing",
                    "type": "Threat",
                    "text": "Die Anbietenden von Outsourcing nutzen die Abhängigkeit der Institution aus, um die Preise zu erhöhen oder die Qualität der Dienstleistungen zu senken.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichendes Niveau der Informationssicherheit beim Outsourcing",
            "handle": "2.4",
            "text": "Ein unzureichendes Niveau an Informationssicherheit kann dazu führen, dass die Informationssicherheit in Outsourcing-Vorhaben nicht angemessen berücksichtigt wird. Die Folge ist, dass die Anbietenden von Outsourcing keinen oder einen nur unzureichenden Standard der Informationssicherheit für den Outsourcing-Prozess aufrechterhalten. Folglich entstehen Schwachstellen, von denen IT-gestützte Angriffe sowie Datenverluste ausgehen können. Darüber hinaus können für die Nutzenden von Outsourcing rechtliche Konsequenzen mit finanziellen Auswirkungen sowie Reputationsverluste entstehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "IT-gestützte Angriffe auf die Systeme der Anbietenden von Outsourcing",
                    "type": "Threat",
                    "text": "Die Systeme der Anbietenden von Outsourcing werden durch IT-gestützte Angriffe angegriffen. Dadurch können Daten gestohlen oder verändert werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Datenverluste durch unzureichende Sicherheitsmaßnahmen",
                    "type": "Threat",
                    "text": "Die Anbietenden von Outsourcing treffen nicht ausreichende Sicherheitsmaßnahmen, um Datenverluste zu verhindern. Dadurch können Daten verloren gehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Mangelhaftes Auslagerungsmanagement",
            "handle": "2.5",
            "text": "Ein nicht vorhandenes oder nur teilweise umgesetztes Auslagerungsmanagement äußert sich dadurch, dass die laufenden ausgelagerten Prozesse unzureichend verwaltet werden. Dadurch verringert oder verliert sich die Transparenz über die ausgelagerten Prozesse. Hierdurch können Nutzende von Outsourcing die Anbietenden von Outsourcing nicht mehr kontrollieren und angemessen steuern. Die Nutzenden von Outsourcing können nicht mehr sicherstellen, dass die Anbietenden von Outsourcing in dem ausgelagerten Prozess die Informationssicherheit sorgfältig behandeln.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Kontrolle über die ausgelagerten Prozesse",
                    "type": "Threat",
                    "text": "Die Institution hat keine ausreichende Kontrolle über die ausgelagerten Prozesse. Dadurch können die Anbietenden von Outsourcing die Prozesse nicht mehr angemessen kontrollieren und steuern.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Informationssicherheit in den ausgelagerten Prozessen",
                    "type": "Threat",
                    "text": "Die Anbietenden von Outsourcing treffen nicht ausreichende Sicherheitsmaßnahmen, um die Informationssicherheit in den ausgelagerten Prozessen zu gewährleisten. Dadurch können Daten verloren gehen oder die Prozesse nicht mehr ordnungsgemäß funktionieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzulängliche vertragliche Regelungen mit Anbietenden von Outsourcing",
            "handle": "2.6",
            "text": "Unzulängliche vertragliche Regelungen mit den Anbietenden von Outsourcing können zu Schwachstellen in der Informationssicherheit entlang des gesamten Outsourcing-Lebenszyklus führen. Die vertraglichen Regelungen definieren den gesamten Outsourcing-Prozess und stellen den Ausgangspunkt für Ansprüche der Nutzenden gegenüber den Anbietenden von Outsourcing dar. Aufgrund von unzulänglichen vertraglichen Regelungen mit den Anbietenden von Outsourcing können vielfältige und auch schwerwiegende Sicherheitsprobleme auftreten. Wenn Aufgaben, Leistungsparameter oder Aufwände ungenügend oder missverständlich beschrieben wurden, können möglicherweise aus Unkenntnis oder wegen fehlender Ressourcen Sicherheitsmaßnahmen nicht umgesetzt werden. Dies kann viele negative Auswirkungen nach sich ziehen, etwa, wenn regulatorische Anforderungen und Pflichten nicht erfüllt oder Auskunftspflichten und Gesetze nicht eingehalten werden. Wird bei der Vertragsgestaltung der Aspekt der Informationssicherheit nicht berücksichtigt, so können Prozesse und Daten der Nutzenden von Outsourcing unzureichend abgesichert werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende oder unzureichende Regelungen zur Informationssicherheit im Vertrag",
                    "type": "Threat",
                    "text": "Der Vertrag mit den Anbietenden von Outsourcing enthält keine oder unzureichende Regelungen zur Informationssicherheit. Dadurch können die Anbietenden von Outsourcing die Informationssicherheit nicht ausreichend gewährleisten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Kontrolle über die Anbietenden von Outsourcing",
                    "type": "Threat",
                    "text": "Die Institution hat keine ausreichende Kontrolle über die Anbietenden von Outsourcing. Dadurch können die Anbietenden von Outsourcing die Informationssicherheit nicht ausreichend gewährleisten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ungeeignete Verwaltung von Zutritts-, Zugangs- und Zugriffsrechten",
            "handle": "2.7",
            "text": "Je nach Outsourcing-Vorhaben kann es erforderlich sein, dass die Mitarbeitenden von Anbietenden von Outsourcing Zutritts-, Zugangs- und Zugriffsrechte zu IT-Systemen, Informationen, Gebäuden oder Räumen der Nutzenden von Outsourcing benötigen. Diese Rechte können ungeeignet vergeben, verwaltet und kontrolliert werden, hierdurch können im Extremfall sogar unautorisiert Rechte vergeben werden. Außerdem kann der notwendige Schutz der Informationen der Nutzenden von Outsourcing nicht mehr gewährleistet werden. Beispielsweise ist es ein gravierendes Sicherheitsrisiko, unkontrolliert administrative Berechtigungen an Mitarbeitende von Anbietenden von Outsourcing zu vergeben. Diese könnten Berechtigungen ausnutzen und sensible Informationen kopieren oder manipulieren.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unautorisierter Zugriff auf sensible Daten",
                    "type": "Threat",
                    "text": "Die Mitarbeitenden der Anbietenden von Outsourcing erhalten unberechtigten Zugriff auf sensible Daten. Dadurch können Daten gestohlen oder verändert werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Manipulation von sensiblen Daten",
                    "type": "Threat",
                    "text": "Die Mitarbeitenden der Anbietenden von Outsourcing manipulieren sensible Daten. Dadurch können Daten verändert oder gelöscht werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Kontroll- und Steuerverlust durch Weiterverlagerungen",
            "handle": "2.8",
            "text": "Teile von Geschäftsprozessen oder Tätigkeiten werden von Anbietenden von Outsourcing unter Umständen vollständig oder partiell an Sub-Dienstleistende weitergegeben. Da durch die zusätzlichen Beteiligten der Outsourcing-Prozess komplexer wird, wird dieser für die Nutzenden von Outsourcing intransparenter. Durch diese fehlende Transparenz können die Nutzenden von Outsourcing die ausgelagerten Prozesse nicht mehr angemessen kontrollieren und steuern. Darüber hinaus können Anbietende von Outsourcing versäumen, dass von Nutzenden von Outsourcing geforderte Mindestniveau der Informationssicherheit vom Sub-Dienstleistenden einzufordern. Eine Folge ist, dass unter Umständen die vereinbarten informationstechnischen Sicherheitsaspekte von den Sub-Dienstleistenden nicht vollständig umgesetzt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende Kontrolle über Sub-Dienstleistende",
                    "type": "Threat",
                    "text": "Die Institution hat keine ausreichende Kontrolle über die Sub-Dienstleistenden der Anbietenden von Outsourcing. Dadurch können die Sub-Dienstleistenden die Informationssicherheit nicht ausreichend gewährleisten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Informationssicherheit bei Sub-Dienstleistenden",
                    "type": "Threat",
                    "text": "Die Sub-Dienstleistenden der Anbietenden von Outsourcing treffen nicht ausreichende Sicherheitsmaßnahmen, um die Informationssicherheit zu gewährleisten. Dadurch können Daten verloren gehen oder die Prozesse nicht mehr ordnungsgemäß funktionieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlende und unzulängliche Instrumente zur Steuerung von Anbietenden von Outsourcing",
            "handle": "2.9",
            "text": "Damit eine Institution prüfen kann, ob die ausgelagerten Prozesse von Anbietenden von Outsourcing ordnungsgemäß umgesetzt werden, benötigt sie neben entsprechenden Vereinbarungen auch die Instrumente dazu. Dies können beispielsweise qualitative und quantitative Leistungskennzahlen (KPIs) sein. Um auf Minder- und Schlechtleistung reagieren zu können, werden entsprechend festgelegte Leistungskennzahlen benötigt. Fehlende und unzulängliche Instrumente führen dazu, dass die Anbietenden von Outsourcing nicht adäquat kontrolliert und gesteuert werden können. Dadurch kann nicht mehr geprüft und nachvollzogen werden, ob die festgelegten Sicherheitsanforderungen eingehalten werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende oder unzureichende Kontrolle über die Anbietenden von Outsourcing",
                    "type": "Threat",
                    "text": "Die Institution hat keine ausreichenden Instrumente, um die Anbietenden von Outsourcing zu kontrollieren und zu steuern. Dadurch können die Anbietenden von Outsourcing die Informationssicherheit nicht ausreichend gewährleisten.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Informationssicherheit bei den Anbietenden von Outsourcing",
                    "type": "Threat",
                    "text": "Die Anbietenden von Outsourcing treffen nicht ausreichende Sicherheitsmaßnahmen, um die Informationssicherheit zu gewährleisten. Dadurch können Daten verloren gehen oder die Prozesse nicht mehr ordnungsgemäß funktionieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzulängliche Regelungen für eine geplante und ungeplante Beendigung eines Outsourcing-Verhältnisses",
            "handle": "2.10",
            "text": "Ein Outsourcing-Verhältnis kann ordentlich gekündigt oder auch außerordentlich beendet werden. Hierbei können unzulängliche oder fehlende Regelungen dazu führen, dass Hardware, Daten und Zugänge nicht oder nicht ordnungsgemäß an die Nutzenden von Outsourcing übergeben bzw. übermittelt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlende oder unzureichende Regelungen zur Rückgabe von Daten und Hardware",
                    "type": "Threat",
                    "text": "Der Vertrag mit den Anbietenden von Outsourcing enthält keine oder unzureichende Regelungen zur Rückgabe von Daten und Hardware. Dadurch können die Anbietenden von Outsourcing die Daten und Hardware nicht ordnungsgemäß zurückgeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Kontrolle über die Anbietenden von Outsourcing",
                    "type": "Threat",
                    "text": "Die Institution hat keine ausreichende Kontrolle über die Anbietenden von Outsourcing. Dadurch können die Anbietenden von Outsourcing die Daten und Hardware nicht ordnungsgemäß zurückgeben.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichendes Notfallkonzept",
            "handle": "2.11",
            "text": "Im Falle einer Störung, eines Notfalls oder einer Krise kann ein unzureichendes Notfallmanagement dazu führen, dass die ausgelagerten Prozesse ausfallen. Dabei bereitet insbesondere eine unzureichende Notfallvorsorge die Institution in ungenügendem Maße auf eine Not- oder Krisensituation vor. Eine effektive Notfallbewältigung kann auf dieser Grundlage nicht sichergestellt werden. Störungen, Not- und Krisensituationen können nicht kontrolliert werden und zu unmittelbaren wirtschaftlichen Auswirkungen führen. In diesem Fall ist nicht nur die eigene Institution, sondern auch alle angebundenen Institutionen, die in der Notfallvorsorge und Notfallbewältigung berücksichtigt werden müssen, betroffen. Kaskadeneffekte durch vor- und nachgelagerte Dienstleistende führen zu beträchtlichen Auswirkungen auf den Geschäftsbetrieb der Nutzenden von Outsourcing.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlendes oder unzureichendes Notfallkonzept",
                    "type": "Threat",
                    "text": "Die Institution hat kein oder ein unzureichendes Notfallkonzept. Dadurch kann die Institution im Falle einer Störung, eines Notfalls oder einer Krise nicht angemessen reagieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unzureichende Zusammenarbeit im Notfall",
                    "type": "Threat",
                    "text": "Die Institution und die Anbietenden von Outsourcing arbeiten im Notfall nicht ausreichend zusammen. Dadurch kann die Institution im Falle einer Störung, eines Notfalls oder einer Krise nicht angemessen reagieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung von Anforderungsprofilen für Prozesse",
            "handle": "OPS.2.3.A1",
            "level": "Low",
            "affects": [],
            "text": "Falls keine Business-Impact-Analyse (BIA) vorhanden ist, MÜSSEN Anforderungsprofile in Form von Steckbriefen für die Prozesse angefertigt werden, die potenziell ausgelagert werden sollen. Diese Anforderungsprofile MÜSSEN die Funktion, verarbeite Daten, Schnittstellen sowie eine Bewertung der Informationssicherheit enthalten. Insbesondere MÜSSEN die Abhängigkeiten zwischen den Prozessen sowie zu untergeordneten Teilprozessen berücksichtigt werden. Die Anforderungsprofile MÜSSEN die Kritikalität des jeweiligen Prozesses für den ordentlichen Geschäftsbetrieb abbilden.",
            "isresponsible": "Fachverantwortliche",
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Verfolgung eines risikoorientierten Ansatzes im Auslagerungsmanagement",
            "handle": "OPS.2.3.A2",
            "level": "Low",
            "affects": [],
            "text": "Für Prozesse, die potenziell ausgelagert werden sollen, MUSS risikoorientiert betrachtet und entschieden werden, ob diese ausgelagert werden können. Für diese Bewertung SOLLTEN die Anforderungsprofile als Grundlage genutzt werden. Wenn der Prozess ausgelagert wird, SOLLTE das Resultat im Auslagerungsregister abgelegt werden. Um Änderungen an Prozessen oder der Gefährdungslage zu berücksichtigen, MÜSSEN in regelmäßigen Abständen sowie anlassbezogen die ausgelagerten Prozesse erneut risikoorientiert betrachtet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung von Eignungsanforderungen an Anbietende von Outsourcing",
            "handle": "OPS.2.3.A3",
            "level": "Low",
            "affects": [],
            "text": "Interne Eignungsanforderungen an potenzielle Anbietende von Outsourcing MÜSSEN festgelegt werden. Diese Eignungsanforderungen MÜSSEN die erforderlichen Kompetenzen, um den Prozess aus Sicht der Informationssicherheit abzusichern, sowie die Reputation hinsichtlich der Vertrauenswürdigkeit und Zuverlässigkeit berücksichtigen. Diese Eignungsanforderungen SOLLTEN auf Basis der Unternehmensstrategie (siehe OPS.2.3.A8 Erstellung einer Strategie für Outsourcing-Vorhaben) erstellt werden. Es MUSS geprüft werden, ob potenzielle Interessenkonflikte vorliegen. Ferner SOLLTEN die Anbietenden von Outsourcing regelmäßig gegen die Eignungsanforderungen geprüft werden. Wenn die Anbietenden von Outsourcing nicht die Eignungsanforderungen erfüllen, SOLLTEN Handlungsmaßnahmen getroffen und in einem Maßnahmenkatalog festgehalten werden.",
            "isresponsible": "Fachverantwortliche, Institutionsleitung",
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Grundanforderungen an Verträge mit Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A4",
            "level": "Low",
            "affects": [],
            "text": "Einheitliche Grundanforderungen an Outsourcing-Verträge MÜSSEN entwickelt werden. Diese Grundanforderungen MÜSSEN Aspekte der Informationssicherheit, einen Zustimmungsvorbehalt bei Weiterverlagerungen sowie ein Recht auf Prüfung, Revision und Audit beinhalten. Bei der Entwicklung der Grundanforderungen SOLLTEN die Resultate der risikoorientierten Betrachtung sowie Eignungsanforderungen an Anbietende von Outsourcing mit einfließen. Mit den Anbietenden von Outsourcing SOLLTE eine Verschwiegenheitserklärung zum Schutz von sensiblen Daten vereinbart werden. Die Grundanforderungen MÜSSEN in Vereinbarungen und Verträgen einheitlich umgesetzt werden. Auf Basis der Grundanforderungen SOLLTE eine einheitliche Vertragsvorlage erstellt und für alle Outsourcing-Vorhaben genutzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vereinbarung der Mandantenfähigkeit",
            "handle": "OPS.2.3.A5",
            "level": "Low",
            "affects": [],
            "text": "In einer Vereinbarung zur Mandantenfähigkeit mit den Anbietenden von Outsourcing MUSS sichergestellt werden, dass die Daten und Verarbeitungskontexte durch den Anbietenden von Outsourcing ausreichend sicher getrennt sind. In dieser Vereinbarung SOLLTE ein Mandantentrennungskonzept von den Anbietenden von Outsourcing gefordert werden. Das Mandantentrennungskonzept SOLLTE zwischen mandantenabhängigen und mandantenübergreifenden Daten und Objekten unterscheiden und darlegen, mit welchen Mechanismen die Anbietenden von Outsourcing trennen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.14",
                "G 0.18",
                "G 0.19",
                "G 0.22",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Festlegung von Sicherheitsanforderungen und Erstellung eines Sicherheitskonzeptes für das Outsourcing-Vorhaben",
            "handle": "OPS.2.3.A6",
            "level": "Low",
            "affects": [],
            "text": "Mit den Anbietenden von Outsourcing MUSS vertraglich vereinbart werden, dass IT-Grundschutz umgesetzt oder mindestens die Anforderungen aus den relevanten Bausteinen geeignet erfüllt werden. Darüber hinaus SOLLTE mit den Anbietenden von Outsourcing vereinbart werden, dass sie ein Managementsystem für Informationssicherheit (ISMS) etablieren. Die Nutzenden von Outsourcing MÜSSEN für jedes Outsourcing-Vorhaben ein Sicherheitskonzept basierend auf den sich aus dem IT-Grundschutz ergebenen Sicherheitsanforderungen erstellen. Dabei MUSS das Sicherheitskonzept der Nutzenden mit den Anbietenden von Outsourcing abgestimmt werden. Ebenso SOLLTE jeder Anbietende ein individuelles Sicherheitskonzept für das jeweilige Outsourcing-Vorhaben vorlegen. Das Sicherheitskonzept der Anbietenden von Outsourcing und dessen Umsetzung SOLLTE zu einem gesamten Sicherheitskonzept zusammengeführt werden. Wenn Risikoanalysen notwendig sind, MÜSSEN Vereinbarungen getroffen werden, wie die Risikoanalyse geprüft und gegebenenfalls in das eigene Risikomanagement überführt werden kann. Die Nutzenden von Outsourcing oder unabhängige Dritte MÜSSEN regelmäßig überprüfen, ob das Sicherheitskonzept wirksam ist.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelungen für eine geplante oder ungeplante Beendigung eines Outsourcing-Verhältnisses",
            "handle": "OPS.2.3.A7",
            "level": "Low",
            "affects": [],
            "text": "Für geplante sowie ungeplante Beendigungen des Outsourcing-Verhältnisses MÜSSEN Regelungen getroffen werden. Es MUSS festgelegt werden, wie alle Informationen, Daten und Hardware der Nutzenden vom Anbietenden von Outsourcing zurückgegeben werden. Hierbei MÜSSEN gesetzliche Vorgaben zur Aufbewahrung von Daten beachtet werden. Ferner SOLLTE überprüft werden, ob die Zugangs-, Zutritts- und Zugriffsrechte für die Anbietenden von Outsourcing mit der Beendigung des Outsourcing-Verhältnisses aufgehoben wurden.",
            "isresponsible": "Fachverantwortliche, Institutionsleitung",
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.19"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung einer Strategie für Outsourcing-Vorhaben",
            "handle": "OPS.2.3.A8",
            "level": "Medium",
            "affects": [],
            "text": "Eine Strategie für Outsourcing-Vorhaben SOLLTE erstellt und etabliert werden. In dieser Strategie SOLLTEN die Ziele, Chancen und Risiken der Outsourcing-Vorhaben beschrieben werden. Die Strategie SOLL der Institution einen Rahmen für die Anforderungsprofile, die Eignungsanforderung an Anbietende von Outsourcing sowie dem Auslagerungsmanagement vorgeben. Darüber hinaus SOLLTEN neben den wirtschaftlichen, technischen, organisatorischen und rechtlichen Rahmenbedingungen auch die relevanten Aspekte der Informationssicherheit berücksichtigt werden. Es SOLLTE eine Multi-Sourcing Strategie verfolgt werden, um Engpässe sowie Abhängigkeiten von Anbietenden von Outsourcing zu vermeiden. Die Nutzenden von Outsourcing SOLLTEN ausreichend Fähigkeiten, Kompetenzen sowie Ressourcen behalten, um einer Abhängigkeit gegenüber den Anbietenden von Outsourcing vorzubeugen.",
            "isresponsible": "Institutionsleitung",
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Etablierung einer Richtlinie zur Auslagerung",
            "handle": "OPS.2.3.A9",
            "level": "Medium",
            "affects": [],
            "text": "Auf Basis der Strategie für Outsourcing-Vorhaben SOLLTE eine Richtlinie für den Bezug von Outsourcing-Dienstleistungen erstellt und in der Institution etabliert werden. Diese SOLLTE die allgemeinen Anforderungen basierend auf der Anforderung OPS.2.3.A4 Grundanforderungen an Verträge mit Anbietenden von Outsourcing sowie weitere Aspekte der Informationssicherheit für Outsourcing-Vorhaben standardisieren. Das Test- und Freigabeverfahren für Outsourcing-Vorhaben SOLLTE in dieser Richtlinie geregelt sein. Darüber hinaus SOLLTEN Maßnahmen berücksichtigt sein, um Compliance-Risiken bei Anbietenden von Outsourcing sowie bei Sub-Dienstleistenden zu bewältigen.",
            "isresponsible": "Institutionsleitung",
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Etablierung einer zuständigen Person für das Auslagerungsmanagement",
            "handle": "OPS.2.3.A10",
            "level": "Medium",
            "affects": [],
            "text": "Die verschiedenen Outsourcing-Vorhaben SOLLTEN durch eine zuständige Person für das Auslagerungsmanagement verwaltet werden. Die zuständige Person SOLLTE ernannt und die Befugnisse festgelegt und dokumentiert werden. Die zuständige Person SOLLTE als Schnittstelle in der Kommunikation zwischen den Nutzenden und Anbietenden von Outsourcing eingesetzt werden. Darüber hinaus SOLLTE die zuständige Person Berichte über das Outsourcing in regelmäßigen Abständen und anlassbezogen anfertigen und der Institutionsleitung übergeben. In der Vertragsgestaltung SOLLTE die zuständige Person einbezogen werden. Die zuständige Person SOLLTE ein angemessenes Kontingent von Arbeitstagen für die Aufgaben des Auslagerungsmanagements eingeräumt bekommen. Darüber hinaus SOLLTE die zuständige Person hinsichtlich Informationssicherheit geschult und sensibilisiert sein.",
            "isresponsible": "Personalabteilung",
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29",
                "G 0.42"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Führung eines Auslagerungsregisters",
            "handle": "OPS.2.3.A11",
            "level": "Medium",
            "affects": [],
            "text": "Die zuständige Person für das Auslagerungsmanagement SOLLTE ein Auslagerungsregister erstellen und pflegen, dass die Dokumentation der Outsourcing-Prozesse und Vorhaben in der Institution zentralisiert. Dieses SOLLTE auf der Basis der Anforderungsprofile erstellt werden und Informationen zu den Anbietenden von Outsourcing, Leistungskennzahlen, Kritikalität des Prozesses, abgeschlossene Verträge und Vereinbarungen sowie Änderungen enthalten. Änderungen am Auslagerungsregister SOLLTEN geeignet nachgehalten werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung von Auslagerungsberichten",
            "handle": "OPS.2.3.A12",
            "level": "Medium",
            "affects": [],
            "text": "Die zuständige Person für das Auslagerungsmanagement SOLLTE regelmäßig interne Auslagerungsberichte auf Basis des Auslagerungsregisters erstellen. Diese Auslagerungsberichte SOLLTEN den aktuellen Status des Outsourcing-Vorhabens mit allgemeinen Problemen und Risiken sowie Aspekte der Informationssicherheit enthalten. Der Auslagerungsbericht SOLLTE der Institutionsleitung vorgelegt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Bereitstellung der erforderlichen Kompetenzen bei der Vertragsgestaltung",
            "handle": "OPS.2.3.A13",
            "level": "Medium",
            "affects": [],
            "text": "Die Verträge SOLLTEN durch verschiedene Vertreter aus unterschiedlichen Bereichen gestaltet werden. Dabei SOLLTE ein Interessenkonflikt zwischen operativem Geschäft und Informationssicherheit vermieden werden.",
            "isresponsible": "Institutionsleitung",
            "mitigates": [
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erweiterte Anforderungen an Verträge mit Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A14",
            "level": "Medium",
            "affects": [],
            "text": "Mit Anbietenden von Outsourcing SOLLTE vereinbart werden, auf welche Bereiche und Dienste die Anbietenden im Netz der Nutzenden von Outsourcing zugreifen dürfen. Der Umgang mit anfallenden Metadaten SOLLTE geregelt werden. Die Nutzenden SOLLTEN Leistungskennzahlen für die Anbietenden von Outsourcing definieren und im Vertrag festlegen. Für den Fall, dass die vereinbarten Leistungskennzahlen unzureichend erfüllt werden, SOLLTEN mit den Anbietenden von Outsourcing Konsequenzen, wie z. B. Vertragsstrafen, festgelegt werden. Die Verträge SOLLTEN Kündigungsoptionen, um das Outsourcing-Verhältnisses aufzulösen, enthalten. Hierbei SOLLTE auch geregelt sein, wie das Eigentum der Nutzenden von Outsourcing zurückgegeben wird. Im Vertrag SOLLTEN Verantwortlichkeiten hinsichtlich des Notfall- und Krisenmanagements definiert und benannt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.14",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Anbindung an die Netze der Outsourcing-Partner",
            "handle": "OPS.2.3.A15",
            "level": "Medium",
            "affects": [],
            "text": "Bevor das Datennetz der Nutzenden an das Datennetz der Anbietenden von Outsourcing angebunden wird, SOLLTEN alle sicherheitsrelevanten Aspekte schriftlich vereinbart werden. Es SOLLTE geprüft und dokumentiert werden, dass die Vereinbarungen für die Netzanbindung eingehalten werden. Das geforderte Sicherheitsniveau SOLLTE nachweislich bei den Anbietenden von Outsourcing umgesetzt und überprüft werden, bevor die Netzanbindung zu den Nutzenden von Outsourcing aktiviert wird. Bevor die Netze angebunden werden, SOLLTE mit Testdaten die Verbindung getestet werden. Gibt es Sicherheitsprobleme auf einer der beiden Seiten, SOLLTE festgelegt sein, wer informiert und wie eskaliert wird.",
            "isresponsible": null,
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.23"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Prüfung der Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A16",
            "level": "Medium",
            "affects": [],
            "text": "Die Anbietenden von Outsourcing SOLLTEN hinsichtlich der vertraglich festgelegten Sicherheitsanforderungen überprüft und die Resultate dokumentiert werden. Die Anbietenden von Outsourcing sind in regelmäßigen Abständen und anlassbezogen zu auditieren.",
            "isresponsible": null,
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelungen für den Einsatz des Personals von Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A17",
            "level": "Medium",
            "affects": [],
            "text": "Die Beschäftigten der Anbietenden von Outsourcing SOLLTEN schriftlich verpflichtet werden, einschlägige Gesetze, Vorschriften sowie die Regelungen der Nutzenden von Outsourcing einzuhalten. Die Beschäftigten der Anbietenden von Outsourcing SOLLTEN geregelt in ihre Aufgaben eingewiesen und über bestehende Regelungen zur Informationssicherheit unterrichtet werden. Für die Beschäftigten der Anbietenden von Outsourcing SOLLTEN Vertretungsregelungen existieren. Es SOLLTE ein geregeltes Verfahren festgelegt werden, das beschreibt, wie das Auftragsverhältnis mit den Beschäftigten der Anbietenden von Outsourcing beendet wird. Fremdpersonal der Anbietenden von Outsourcing, das kurzfristig oder nur einmal eingesetzt wird, SOLLTE wie Besuchende behandelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Überprüfung der Vereinbarungen mit Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A18",
            "level": "Medium",
            "affects": [],
            "text": "Vereinbarungen mit Anbietenden von Outsourcing hinsichtlich der Angemessenheit der festgelegten Sicherheitsanforderungen sowie sonstigen Sicherheitsanforderungen SOLLTEN in regelmäßigen Abständen und anlassbezogen überprüft werden. Vereinbarungen mit Anbietenden von Outsourcing mit unzureichend festgelegten Sicherheitsanforderungen SOLLTEN nachgebessert werden. Die Anbietenden von Outsourcing SOLLTEN dazu verpflichtet werden, bei veränderter Gefährdungs- oder Gesetzeslage, die festgelegten Sicherheitsanforderungen nachzubessern.",
            "isresponsible": null,
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Überprüfung der Handlungsalternativen hinsichtlich einer geplanten oder ungeplanten Beendigung eines Outsourcing-Verhältnisses",
            "handle": "OPS.2.3.A19",
            "level": "Medium",
            "affects": [],
            "text": "Handlungsalternativen SOLLTEN entwickelt werden für den Fall einer geplanten oder ungeplanten Beendigung des Outsourcing-Verhältnisses. Das Resultat SOLLTE in einem Maßnahmenkatalog für geplante und ungeplante Beendigung des Outsourcing-Verhältnisses dokumentiert werden. Dabei SOLLTEN auch alternative Anbietende von Outsourcing ermittelt werden, die über das notwendige Niveau an Informationssicherheit verfügen, um den Prozess sicher umzusetzen. Dies SOLLTE in regelmäßigen Abständen und anlassbezogen geprüft werden.",
            "isresponsible": "Beschaffungsstelle",
            "mitigates": [
                "G 0.11",
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Etablierung sowie Einbeziehung von Anbietenden von Outsourcing im Notfallkonzept",
            "handle": "OPS.2.3.A20",
            "level": "Medium",
            "affects": [],
            "text": "Ein Notfallkonzept SOLLTE in der Institution etabliert sein. Dies SOLLTE auf der Basis einer Business-Impact-Analyse basieren und die Abhängigkeiten der ausgelagerten Prozesse mit den intern verbliebenen Prozessen berücksichtigen. Das Notfallkonzept SOLLTE den Anbietenden von Outsourcing in seiner Notfallvorsorge und -bewältigung berücksichtigen und mit diesem abgestimmt sein. Dabei SOLLTEN die Schnittstellen zu Anbietenden von Outsourcing mit Verantwortlichen benannt und besetzt werden, um einen Informationsaustausch sowie eine effektive Kollaboration in einer Not- oder Krisensituation zu ermöglichen. Gemeinsame Not- und Krisenfallpläne SOLLTEN für eine Störung oder einen Ausfall der Anbietenden von Outsourcing erstellt werden. Standardisierte Protokolle und Berichte SOLLTEN zur Meldung von Sicherheitsvorfällen etabliert werden.",
            "isresponsible": "Notfallbeauftragte",
            "mitigates": [
                "G 0.11",
                "G 0.25",
                "G 0.27",
                "G 0.42"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Abschluss von ESCROW-Verträgen bei softwarenahen Dienstleistungen",
            "handle": "OPS.2.3.A21",
            "level": "High",
            "affects": [
                "IA"
            ],
            "text": "Wird Software von Anbietenden von Outsourcing bezogen, SOLLTE ein ESCROW-Vertrag abgeschlossen werden. Dieser SOLLTE Verwertungs- und Bearbeitungsrechte der Software sowie Herausgabefälle des Quellcodes regeln. Darüber hinaus SOLLTE festgelegt werden, wie häufig der Quellcode hinterlegt und dokumentiert wird. Weiterhin SOLLTEN Geheimhaltungspflichten über den hinterlegten Quellcode und die zugehörige Dokumentation geregelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.11",
                "G 0.18",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Durchführung von gemeinsamen Notfall- und Krisenübungen",
            "handle": "OPS.2.3.A22",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Gemeinsame Notfall- und Krisenübungen mit den Anbietenden von Outsourcing SOLLTEN durchgeführt und dokumentiert werden (siehe DER.4 Notfallmanagement). Das Resultat der Übung SOLLTE dazu genutzt werden, um das Notfallkonzept sowie insbesondere die gemeinsamen Maßnahmenpläne zu verbessern. Die Notfall- und Krisenübungen SOLLTEN regelmäßig und anlassbezogen durchgeführt werden.",
            "isresponsible": "Notfallbeauftragte",
            "mitigates": [
                "G 0.11",
                "G 0.25",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von Verschlüsselungen",
            "handle": "OPS.2.3.A23",
            "level": "High",
            "affects": [
                "C"
            ],
            "text": "Sensible Daten SOLLTEN angemessen verschlüsselt werden, wenn sie zum Anbietenden von Outsourcing übertragen werden. Die abgelegten Daten SOLLTEN durch eine Datenverschlüsselung oder eine Verschlüsselung des Speichermediums geschützt werden. Nach Möglichkeit SOLLTE eine vom BSI geprüfte und freigegebene Verschlüsselungssoftware genutzt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.14",
                "G 0.19",
                "G 0.22",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherheits- und Eignungsüberprüfung von Mitarbeitenden",
            "handle": "OPS.2.3.A24",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Mit externen Anbietenden von Outsourcing SOLLTE vertraglich vereinbart werden, dass die Vertrauenswürdigkeit des eingesetzten Personals geeignet überprüft wird. Dazu SOLLTEN gemeinsam Kriterien festgelegt und dokumentiert werden.",
            "isresponsible": "Personalabteilung",
            "mitigates": [
                "G 0.29",
                "G 0.35"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Errichtung und Nutzung einer Sandbox für eingehende Daten vom Anbietenden von Outsourcing",
            "handle": "OPS.2.3.A25",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Für eingehende Daten vom Anbietenden von Outsourcing SOLLTE eine Sandbox eingerichtet werden. Hierbei SOLLTEN E-Mail-Anhänge in der Sandbox standardisiert geöffnet werden. Updates und Anwendungen eines softwarenahen Anbietenden von Outsourcing SOLLTEN in der Sandbox initial getestet werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.22",
                "G 0.23",
                "G 0.25"
            ]
        }
    ]
}