{
    "Informationsource": "BSI GSK 2023",
    "name": "Raum sowie Schrank für technische Infrastruktur",
    "handle": "INF.5",
    "text": "Ein Raum für technische Infrastruktur enthält technische Komponenten, die nur selten direkt vor Ort bedient werden müssen. Sie sind aber unabdingbar für die Gebäudeinfrastruktur und damit auch für die IT-Infrastruktur. Dabei kann es sich z. B. um Verteiler für die Energieversorgung, Sicherungskästen, Lüftungsanlagen, TK-Anlagenteile, Patchfelder, Switches oder Router handeln. Dieser Raum ist kein ständiger Arbeitsplatz und wird in der Regel nur zur Wartung betreten bzw. geöffnet. Wenn die zu schützende technische Infrastruktur nicht in einem separaten Raum untergebracht werden kann oder sich der Raum nicht entsprechend der beschriebenen Anforderungen einrichten lässt, kann die technische Infrastruktur auch in einem eigens dafür ausgerüsteten Schrank untergebracht werden. Das kann auch sinnvoll sein, wenn für die Unterbringung der technischen Infrastruktur ein Schrank die wirtschaftlichste Alternative darstellt. Die Anforderungen an den Raum sind dann möglichst wirkungsgleich auf den Schrank und dessen Hülle zu übertragen.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlerhafte Planung",
            "handle": "INF.5.1",
            "text": "Wird ein Raum für technische Infrastruktur fehlerhaft geplant, können mehrere Probleme auftreten. Zum einen kann Wasser eintreten oder die IT-Komponenten können durch Sonneneinstrahlung überhitzen, wenn die Lage des Raumes ungeeignet gewählt wird. Ebenso erhöht eine ungeeignete Lage unter Umständen die Wahrscheinlichkeit, dass dort eingebrochen wird. Auch können Engpässe auftreten, falls die Energieversorgung unzureichend dimensioniert wird. Wurden minderwertige Materialien verbaut, sind die IT-Komponenten oft anfälliger für Ausfälle und Fehlfunktionen. Nicht zuletzt können Regelungen und Vorschriften bereits bei der Planung nicht beachtet und eingehalten werden. Müssen nachträglich unzulässige Abweichungen behoben werden, können unnötig hohe Kosten entstehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ungeeignete Lage des Raumes",
                    "type": "Threat",
                    "text": "Die Lage des Raumes ist ungeeignet, z. B. zu nah an einer Wasserleitung oder an einem Ort, der stark der Sonneneinstrahlung ausgesetzt ist.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ungeeignete Lage des Raumes",
                    "type": "Threat",
                    "text": "Die Lage des Raumes ist ungeeignet, z. B. an einem Ort, der leicht zugänglich ist und an dem Einbrüche leicht möglich sind.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ungeeignete Dimensionierung der Energieversorgung",
                    "type": "Threat",
                    "text": "Die Energieversorgung ist unzureichend dimensioniert, z. B. zu klein für die Anzahl der Geräte, die im Raum betrieben werden.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Verwendung minderwertiger Materialien",
                    "type": "Threat",
                    "text": "Es wurden minderwertige Materialien verwendet, z. B. für die Verkabelung oder die Lüftungsanlage.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Nichtbeachtung von Regelungen und Vorschriften",
                    "type": "Threat",
                    "text": "Regelungen und Vorschriften wurden bei der Planung nicht beachtet, z. B. die Brandschutzbestimmungen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unberechtigter Zutritt",
            "handle": "INF.5.2",
            "text": "Gibt es keine Zutrittskontrolle oder keinen Einbruchschutz oder sind diese zu schwach, können möglicherweise unberechtigte Personen den Raum für technische Infrastruktur betreten. Sie könnten dort unbeabsichtigt, z. B. aufgrund mangelnder Fachkenntnisse, oder vorsätzlich Schaden anrichten, z. B. indem sie Geräte stehlen, austauschen, manipulieren oder zerstören.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unbefugter Zutritt",
                    "type": "Threat",
                    "text": "Unbefugte Personen gelangen in den Raum, z. B. weil die Tür nicht abgeschlossen ist oder weil die Zutrittskontrolle nicht funktioniert.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Sabotage",
                    "type": "Threat",
                    "text": "Unbefugte Personen beschädigen oder zerstören Geräte im Raum, z. B. durch das Entfernen von Bauteilen oder das Verändern von Einstellungen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unzureichende Lüftung",
            "handle": "INF.5.3",
            "text": "Wird ein Raum für technische Infrastruktur unzureichend belüftet, kann es passieren, dass der für die verbauten Geräte erlaubte Temperaturbereich nicht eingehalten wird. Als Folge könnten diese Geräte ausfallen oder dauerhaft beschäftigt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überhitzung von Geräten",
                    "type": "Threat",
                    "text": "Die Geräte im Raum überhitzen, weil die Lüftung nicht ausreichend ist.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Feuer",
            "handle": "INF.5.4",
            "text": "Ein Raum für technische Infrastruktur kann durch ein Feuer schwer beschädigt oder ganz zerstört werden, sodass die von ihm abhängigen Geschäftsprozesse oder Fachaufgaben ausfallen. In einem Raum mit Energiekabeln und Stromverbrauchern besteht zum einen die Gefahr von Bränden, etwa wenn Leistungsschutzschalter oder Gerätesicherungen bei zu hohen Strömen nicht auslösen. Zum anderen kann auch Fahrlässigkeit zu Bränden führen, zum Beispiel wenn in dem Raum geraucht wird und Kabel und Geräte aus brennbarem Material Feuer fangen. Darüber hinaus können sich durch Überspannungen oder Überhitzung Funken bilden, die zu einem Brand führen. Ein Brand im Raum für technische Infrastruktur kann sich zudem auch auf andere Teile des Gebäudes ausbreiten. Umgekehrt kann ein Feuer im Gebäude auch auf den Raum für technische Infrastruktur übergreifen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Brand durch Überlastung der Stromversorgung",
                    "type": "Threat",
                    "text": "Die Stromversorgung wird überlastet, z. B. weil zu viele Geräte gleichzeitig eingeschaltet sind. Dadurch kommt es zu einem Kurzschluss und einem Brand.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Brand durch Fahrlässigkeit",
                    "type": "Threat",
                    "text": "Es wird im Raum geraucht oder es werden brennbare Materialien unsachgemäß gelagert. Dadurch kommt es zu einem Brand.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Brand durch Überspannung",
                    "type": "Threat",
                    "text": "Es kommt zu einer Überspannung, z. B. durch einen Blitzschlag. Dadurch kommt es zu einem Brand.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Wasser",
            "handle": "INF.5.5",
            "text": "Durch eine Überschwemmung innerhalb des Raumes für technische Infrastruktur können sowohl an den dort betriebenen Komponenten als auch am Raum selbst Wasserschäden entstehen. Neben Schäden am Raum können diese Wasserschäden auch zu Kurzschlüssen in elektrischen Geräten führen. Als Folge können Schimmel und Korrosion auftreten. Durch ein Leck in einer Wasserleitung könnte der Raum auch überschwemmt werden. Auch Regenwasser, das bei Starkregen über überlastete Regenwasserkanäle in das Gebäude eindringt, kann zu einer Überschwemmung des Raumes führen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überschwemmung durch Leitungswasser",
                    "type": "Threat",
                    "text": "Eine Wasserleitung im Raum oder in der Nähe des Raumes ist undicht. Dadurch kommt es zu einer Überschwemmung.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überschwemmung durch Regenwasser",
                    "type": "Threat",
                    "text": "Es kommt zu Starkregen. Das Regenwasser kann über überlastete Regenwasserkanäle in das Gebäude eindringen und den Raum überschwemmen.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ausfall der Stromversorgung",
            "handle": "INF.5.6",
            "text": "Fällt die Stromversorgung des Raumes für technische Infrastruktur aus, sind davon meist mehrere elektrisch betriebene Komponenten betroffen. Das kann dazu führen, dass sämtliche damit verbundenen Betriebsabläufe gestoppt werden. Wird die Stromzufuhr plötzlich unterbrochen, kann dies zudem Schäden an den elektrotechnischen Komponenten verursachen, die sich auch dann noch auswirken, wenn die Stromversorgung wiederhergestellt wurde. Nicht zuletzt können auch Folgeschäden auftreten, wenn eine wichtige Komponente nicht einsatzbereit ist, wie z. B. die Lüftung. Erwärmt sich der Raum, können dadurch weitere Geräte beschädigt werden oder sogar ausfallen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Stromausfall",
                    "type": "Threat",
                    "text": "Die Stromversorgung fällt aus, z. B. durch einen Stromausfall im gesamten Gebäude.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Blitzschlag und Überspannungen",
            "handle": "INF.5.7",
            "text": "Neben den Auswirkungen eines direkten Blitzeinschlags können durch die Induktionswirkung indirekter Blitze auch noch einige hundert Meter vom Einschlagsort entfernt Überspannungsspitzen entstehen. Die Induktion wirkt auch in der Nähe der Ableitungen der Blitzschutzanlage. Durch diese induktiven Überspannungsspitzen können unter Umständen Überspannungen auf Kabeltrassen und an elektrotechnischen Geräten innerhalb des Raumes für technische Infrastruktur auftreten, die dazu führen, dass Funktionen gestört werden oder Geräte ganz ausfallen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Blitzschlag",
                    "type": "Threat",
                    "text": "Der Raum wird direkt von einem Blitz getroffen.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                },
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Überspannung durch Induktion",
                    "type": "Threat",
                    "text": "Ein Blitzschlag in der Nähe des Raumes induziert eine Überspannung, die die Geräte im Raum beschädigt.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Elektromagnetische Störfelder",
            "handle": "INF.5.8",
            "text": "Von einer Störquelle, wie z. B. Motoren von Aufzügen, Sendeanlagen oder Ableitungen von Blitzschutzanlagen, können elektromagnetische Felder ausgesendet werden. Diese können möglicherweise Schalter, Regler oder IT-Systeme stören. Diese Störspannung kann dazu führen, dass elektrotechnische Komponenten nicht mehr richtig funktionieren oder sogar ausfallen. Die Geräte innerhalb des Raumes für technische Infrastruktur können sich aber auch gegenseitig stören.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Störung durch elektromagnetische Felder",
                    "type": "Threat",
                    "text": "Elektromagnetische Felder von Geräten in der Nähe des Raumes stören die Geräte im Raum.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Elektrostatische Aufladung",
            "handle": "INF.5.9",
            "text": "Unkontrollierte elektrostatische Entladungen können Geräte mit empfindlichen elektronischen Bauteilen im Raum für technische Infrastruktur beschädigen oder zerstören. Das kann dazu führen, dass die Geräte nicht mehr zuverlässig funktionieren oder komplett ausfallen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Beschädigung von Geräten durch elektrostatische Entladung",
                    "type": "Threat",
                    "text": "Eine elektrostatische Entladung beschädigt oder zerstört ein Gerät im Raum.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung der Raumabsicherung",
            "handle": "INF.5.A1",
            "level": "Low",
            "affects": [],
            "text": "Für einen Raum für technische Infrastruktur MÜSSEN angemessene technische und organisatorische Vorgaben definiert und umgesetzt werden. Dabei MUSS das für den Raum zu erreichende Schutzniveau berücksichtigt werden. Bei der Planung MÜSSEN sowohl gesetzliche Regelungen und Vorschriften als auch potenzielle Gefährdungen durch Umwelteinflüsse, Einbruch und Sabotage beachtet werden.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Lage und Größe des Raumes für technische Infrastruktur",
            "handle": "INF.5.A2",
            "level": "Low",
            "affects": [],
            "text": "Der Raum für technische Infrastruktur DARF KEIN Durchgangsraum sein. Es MUSS sichergestellt sein, dass ausreichend Fläche für Fluchtwege und Arbeitsfläche vorhanden ist.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Zutrittsregelung und -kontrolle",
            "handle": "INF.5.A3",
            "level": "Low",
            "affects": [],
            "text": "Der Raum für technische Infrastruktur MUSS gegen unberechtigten Zutritt geschützt werden. Es MUSS geregelt werden, welche Personen für welchen Zeitraum, für welche Bereiche und zu welchem Zweck den Raum betreten dürfen. Dabei MUSS sichergestellt sein, dass keine unnötigen oder zu weitreichenden Zutrittsrechte vergeben werden. Alle Zutritte zum Raum für technische Infrastruktur SOLLTEN von der Zutrittskontrolle individuell erfasst werden.",
            "isresponsible": [
                "Haustechnik",
                "IT-Betrieb"
            ],
            "mitigates": [
                "G 0.44"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor Einbruch",
            "handle": "INF.5.A4",
            "level": "Low",
            "affects": [],
            "text": "Der Raum MUSS vor Einbruch geschützt werden. Je nach erforderlichem Sicherheitsniveau des Raumes für technische Infrastruktur SOLLTEN geeignete raumbildende Teile wie Wände, Decken und Böden sowie Fenster und Türen mit entsprechenden Widerstandsklassen nach DIN EN 1627 ausgewählt werden.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.44"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vermeidung sowie Schutz vor elektromagnetischen Störfeldern",
            "handle": "INF.5.A5",
            "level": "Low",
            "affects": [],
            "text": "Elektromagnetische Felder MÜSSEN in unmittelbarer Nähe zum Raum für technische Infrastruktur vermieden werden. Ein ausreichender Abstand zu großen Maschinen wie z. B. Aufzugsmotoren MUSS eingehalten werden.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Minimierung von Brandlasten",
            "handle": "INF.5.A6",
            "level": "Low",
            "affects": [],
            "text": "Brandlasten innerhalb und in der direkten Umgebung des Raumes für technische Infrastruktur MÜSSEN auf ein Minimum reduziert werden. Auf brennbare Materialien für raumbildende Teile MUSS verzichtet werden.",
            "isresponsible": [
                "Mitarbeitende",
                "Planende"
            ],
            "mitigates": [
                "G 0.1"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Verhinderung von Zweckentfremdung",
            "handle": "INF.5.A7",
            "level": "Low",
            "affects": [],
            "text": "Der Raum für technische Infrastruktur DARF NICHT zweckentfremdet werden, z. B. als Abstellraum oder Putzmittellager.",
            "isresponsible": [
                "Mitarbeitende",
                "Planende"
            ],
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Stromversorgung",
            "handle": "INF.5.A9",
            "level": "Medium",
            "affects": [],
            "text": "Das Stromversorgungsnetz, über das der Raum für technische Infrastruktur und die daran angeschlossenen Endgeräte versorgt werden, MUSS als TN-S-System errichtet sein.",
            "isresponsible": "Haustechnik",
            "mitigates": [
                "G 0.8"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vermeidung von unkontrollierter elektrostatischer Entladung",
            "handle": "INF.5.A8",
            "level": "Medium",
            "affects": [],
            "text": "Im Raum für technische Infrastruktur SOLLTE ein ableitfähiger Fußbodenbelag nach DIN EN 14041 verlegt werden.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einhaltung der Lufttemperatur und -Feuchtigkeit",
            "handle": "INF.5.A10",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE sichergestellt werden, dass die Lufttemperatur und Luftfeuchtigkeit im Raum für technische Infrastruktur innerhalb der Grenzen liegen, die in den Datenblättern der darin betriebenen Geräte genannt sind. Dafür SOLLTE eine geeignete raumlufttechnische Anlage eingesetzt werden. Diese SOLLTE ausreichend dimensioniert sein.",
            "isresponsible": "Haustechnik",
            "mitigates": [
                "G 0.2",
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vermeidung von Leitungen mit gefährdenden Flüssigkeiten und Gasen",
            "handle": "INF.5.A11",
            "level": "Medium",
            "affects": [],
            "text": "Im Raum für technische Infrastruktur SOLLTE es nur Leitungen geben, die für den Betrieb der Technik im Raum unbedingt erforderlich sind. Leitungen wie Abwasserleitungen, Frischwasserleitungen, Gas- und Heizungsrohre sowie Leitungen für Treibstoff oder Ferndampf SOLLTEN NICHT durch den Raum geführt werden.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.1",
                "G 0.3",
                "G 0.4"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor versehentlicher Beschädigung von Zuleitungen",
            "handle": "INF.5.A12",
            "level": "Medium",
            "affects": [],
            "text": "Zuleitungen außerhalb des Raumes für technische Infrastruktur SOLLTEN gegen versehentliche Beschädigung geschützt werden.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.3",
                "G 0.4",
                "G 0.8",
                "G 0.10",
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz vor Schädigung durch Brand und Rauchgase",
            "handle": "INF.5.A13",
            "level": "Medium",
            "affects": [],
            "text": "Unabhängig von den für den Raum geltenden baurechtlichen Brandschutzvorgaben SOLLTEN alle raumbildenden Teile sowie Türen und Fenster gleichwertig rauchdicht sein. Sie SOLLTEN Feuer und Rauch für mindestens 30 Minuten standhalten. Brandlasten im Bereich der Leitungstrassen SOLLTEN vermieden werden.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.1",
                "G 0.4",
                "G 0.29"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Minimierung von Brandgefahren aus Nachbarbereichen",
            "handle": "INF.5.A14",
            "level": "Medium",
            "affects": [],
            "text": "Der Raum SOLLTE NICHT in unmittelbarer Nähe zu anderen Räumlichkeiten mit brennbaren Materialien liegen, deren Menge über eine bürotypische Nutzung hinaus geht.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.1"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Blitz- und Überspannungsschutz",
            "handle": "INF.5.A15",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE ein Blitz- und Überspannungsschutzkonzept nach dem Prinzip der energetischen Koordination (siehe DIN EN 62305) erstellt und umgesetzt werden. Der Raum für technische Infrastruktur SOLLTE mindestens der Blitzschutzzone 2 (LPZ 2) zugeordnet werden. Die Blitz- und Überspannungsschutzeinrichtungen SOLLTEN regelmäßig und anlassbezogen auf ihre Funktion überprüft und, falls erforderlich, ersetzt werden.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.18",
                "G 0.24",
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz einer unterbrechungsfreien Stromversorgung",
            "handle": "INF.5.A16",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTE geprüft werden, welche Geräte an eine USV angeschlossen werden sollen. Falls eine USV erforderlich ist, SOLLTE die Stützzeit der USV so ausgelegt sein, dass alle versorgten Komponenten sicher herunterfahren können. Es SOLLTE berücksichtigt werden, dass die Batterien von USV-Anlagen altern. Bei relevanten Änderungen SOLLTE überprüft werden, ob die vorhandenen USV-Anlagen noch ausreichend dimensioniert sind. Die Batterie der USV SOLLTE im erforderlichen Temperaturbereich gehalten werden. Die USV SOLLTE regelmäßig gewartet und auf Funktionsfähigkeit getestet werden. Dafür SOLLTEN die vom herstellenden Unternehmen vorgesehenen Wartungsintervalle eingehalten werden.",
            "isresponsible": "Haustechnik",
            "mitigates": [
                "G 0.8",
                "G 0.10",
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Inspektion und Wartung der Infrastruktur",
            "handle": "INF.5.A17",
            "level": "Medium",
            "affects": [],
            "text": "Für alle Komponenten der baulich-technischen Infrastruktur SOLLTEN mindestens die vom herstellenden Unternehmen empfohlenen oder durch Normen festgelegten Intervalle und Vorschriften für Inspektion und Wartung eingehalten werden. Kabel- und Rohrdurchführungen durch brand- und rauchabschnittbegrenzende Wände SOLLTEN daraufhin geprüft werden, ob die Schotten die für den jeweiligen Einsatzzweck erforderliche Zulassung haben und unversehrt sind. Inspektionen und Wartungsarbeiten MÜSSEN geeignet protokolliert werden.",
            "isresponsible": [
                "Haustechnik",
                "IT-Betrieb",
                "Wartungspersonal"
            ],
            "mitigates": [
                "G 0.5",
                "G 0.8",
                "G 0.10",
                "G 0.18",
                "G 0.24",
                "G 0.25",
                "G 0.26"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Lage des Raumes für technische Infrastruktur",
            "handle": "INF.5.A18",
            "level": "High",
            "affects": [
                "CA"
            ],
            "text": "Der Raum für technische Infrastruktur SOLLTE so im Gebäude angeordnet werden, dass er weder internen noch externen Gefährdungen wie z. B. Regen, Wasser oder Abwasser ausgesetzt ist. In oberirdischen Geschossen SOLLTE darauf geachtet werden, dass der Raum nicht durch Sonneneinstrahlung erwärmt wird. Wird der Raum im obersten Geschoss des Gebäudes untergebracht, SOLLTE sichergestellt werden, dass kein Wasser über das Dach eindringen kann.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.1",
                "G 0.2",
                "G 0.3",
                "G 0.4",
                "G 0.5",
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Redundanz des Raumes für technische Infrastruktur",
            "handle": "INF.5.A19",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Der Raum SOLLTE redundant ausgelegt werden. Beide Räume SOLLTEN eine eigene Elektrounterverteilung erhalten, die direkt von der Niederspannungshauptverteilung (NSHV) versorgt wird. Beide Räume SOLLTEN unterschiedlichen Brandabschnitten zugeordnet sein und, sofern erforderlich, jeweils über eine eigene raumlufttechnische Anlage verfügen.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.8",
                "G 0.10",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erweiterter Schutz vor Einbruch und Sabotage",
            "handle": "INF.5.A20",
            "level": "High",
            "affects": [
                "CIA"
            ],
            "text": "Der Raum SOLLTE fensterlos sein. Sind dennoch Fenster vorhanden, SOLLTEN sie je nach Geschosshöhe gegen Eindringen von außen angemessen gesichert sein. Gibt es neben Fenstern und Türen weitere betriebsnotwendige Öffnungen, wie z. B. Lüftungskanäle, SOLLTEN diese gleichwertig zur Raumhülle geschützt werden. Es SOLLTEN Einbruchmeldeanlagen nach VdS Klasse C (gemäß VdS-Richtlinie 2311) eingesetzt werden. Alle erforderlichen Türen, Fenster und sonstige geschützte Öffnungen SOLLTEN über die Einbruchmeldeanlage auf Verschluss, Verriegelung und Durchbruch überwacht werden. Vorhandene Fenster SOLLTEN stets geschlossen sein. Die Widerstandsklasse von raumbildenden Teilen, Fenstern und Türen SOLLTE dem Sicherheitsbedarf des Raumes angepasst werden. Die Qualität der Schlösser, Schließzylinder und Schutzbeschläge SOLLTE der Widerstandsklasse der Tür entsprechen.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.41",
                "G 0.44"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Redundante Auslegung der Stromversorgung",
            "handle": "INF.5.A22",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die Stromversorgung SOLLTE durchgängig vom Niederspannungshauptverteiler (NSHV) bis zum Verbraucher im Raum für technische Infrastruktur zweizügig sein. Diese Stromversorgungen SOLLTEN sich in getrennten Brandabschnitten befinden. Der NSHV SOLLTE betriebsredundant ausgelegt sein.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.8",
                "G 0.10"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Netzersatzanlage",
            "handle": "INF.5.A23",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die Energieversorgung der Institution SOLLTE um eine Netzersatzanlage (NEA) ergänzt werden. Der Betriebsmittelvorrat einer NEA SOLLTE regelmäßig kontrolliert werden. Die NEA SOLLTE außerdem regelmäßig gewartet werden. Bei diesen Wartungen SOLLTEN auch Belastungs- und Funktionstests sowie Testläufe unter Last durchgeführt werden.",
            "isresponsible": [
                "Planende",
                "Haustechnik",
                "Wartungspersonal"
            ],
            "mitigates": [
                "G 0.8",
                "G 0.24",
                "G 0.25",
                "G 0.26",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Lüftung und Kühlung",
            "handle": "INF.5.A24",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Die Lüftungs- und Kühltechnik SOLLTE betriebsredundant ausgelegt werden. Es SOLLTE sichergestellt werden, dass diese Anlagen regelmäßig gewartet werden. Bei sehr hohem Schutzbedarf SOLLTE auch eine Wartungsredundanz vorhanden sein.",
            "isresponsible": [
                "Planende",
                "Haustechnik",
                "Wartungspersonal"
            ],
            "mitigates": [
                "G 0.2",
                "G 0.25",
                "G 0.26",
                "G 0.27"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erhöhter Schutz vor Schädigung durch Brand und Rauchgase",
            "handle": "INF.5.A25",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Raumbildende Teile sowie Türen, Fenster und Lüftungsklappen SOLLTEN Feuer und Rauch für mindestens 90 Minuten standhalten. Die Zuleitungen SOLLTEN einen Funktionserhalt von mindestens 90 Minuten gewährleisten. Bei sehr hohem Schutzbedarf SOLLTE die Raumhülle wie ein eigener Brandabschnitt ausgebildet sein. In vorhandenen Lüftungskanälen SOLLTEN Brandschutzklappen eingebaut werden, die über Rauchmelder angesteuert werden. Trassen SOLLTEN bis zum Eintritt in den Raum in getrennten Brandabschnitten geführt werden. Bei sehr hohem Schutzbedarf SOLLTEN ein Brandfrühesterkennungssystem und eine automatische Löschanlage vorhanden sein. Brand- und Rauchmelder SOLLTEN an die Brandmelderzentrale angeschlossen sein. Das Brandfrühesterkennungssystem und die automatische Löschanlage SOLLTEN an die zweizügige Stromversorgung mit USV und NEA angebunden sein.",
            "isresponsible": "Planende",
            "mitigates": [
                "G 0.1",
                "G 0.4",
                "G 0.8",
                "G 0.10"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Überwachung der Energieversorgung",
            "handle": "INF.5.A26",
            "level": "High",
            "affects": [
                "A"
            ],
            "text": "Es SOLLTEN geeignete Überwachungseinrichtungen eingebaut und betrieben werden, die unzulässig hohe Ströme auf dem Schutzleitersystem und damit auf Leitungsschirmen sowie potenziell störende Oberschwingungen erfassen und an geeigneter Stelle zur Nachverfolgung und Behebung anzeigen können.",
            "isresponsible": [
                "Planende",
                "Haustechnik"
            ],
            "mitigates": [
                "G 0.8",
                "G 0.10",
                "G 0.18",
                "G 0.24",
                "G 0.25",
                "G 0.26"
            ]
        }
    ]
}