{
    "Informationsource": "BSI GSK 2023",
    "name": "Samba",
    "handle": "APP.3.4",
    "text": "Samba ist ein frei verfügbarer und vollwertiger Active Directory Domain Controller (ADDC), der Authentisierungs-, Datei- und Druckdienste bereitstellen kann und dadurch die Interoperabilität zwischen der Windows- und der Unix-Welt ermöglicht. Samba führt viele unterschiedliche Protokolle und Techniken zusammen. Dazu gehört beispielsweise das Server-Message-Block (SMB)-Protokoll. Als Samba-Server werden Server bezeichnet, auf denen Samba betrieben wird. In der Regel sind das Unix-Server. Wurde der Einsatz von Samba korrekt konzipiert und geeignet konfiguriert, interagiert Samba mit einem Windows-Client oder -Server, als ob es selbst ein Windows-System wäre.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Abhören ungeschützter Kommunikationsverbindungen von Samba",
            "handle": "2.1",
            "text": "Wenn ungeschützte Kommunikationsverbindungen von Samba abgehört werden, können vertrauliche Informationen abgefangen und missbraucht werden. Beim Dateitransfer zwischen Unix-Servern, Windows-Servern und Clients werden oftmals Protokolle ohne umfangreiche Sicherheitseigenschaften eingesetzt, sodass sowohl Authentisierungs- als auch Nutzungsdaten für Dritte zugänglich sind und von Unberechtigten missbraucht werden könnten. Das kann dazu führen, dass schützenswerte Informationen der Institution in die falschen Hände gelangen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Abhören von Samba-Verbindungen",
                    "type": "Threat",
                    "text": "Ein Angreifer kann ungeschützte Kommunikationsverbindungen von Samba abhören, um vertrauliche Informationen wie Benutzernamen, Passwörter, Dateinhalte oder andere sensible Daten abzufangen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unsichere Standardeinstellungen auf Samba-Servern",
            "handle": "2.2",
            "text": "Um einige Fähigkeiten des Samba-Servers zu zeigen und um den Administrierenden einen schnellen Einstieg zu ermöglichen, wird während der Installation des Samba-Servers die Konfigurationsdatei smb.conf mit Standardeinstellungen erzeugt. Mit den in dieser Datei voreingestellten Optionen kann der Samba-Server im Anschluss gestartet werden. Wird diese Datei unbedacht ohne weitere Anpassungen benutzt, kann das zu erheblichen Sicherheitslücken führen. Werden die beispielhaft vorgenommenen Dateifreigaben nicht auskommentiert, können in diesen unerwünschten Freigaben sensible Informationen eingesehen werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausnutzen von Standardeinstellungen",
                    "type": "Threat",
                    "text": "Ein Angreifer kann die Standardeinstellungen von Samba ausnutzen, um auf sensible Daten zuzugreifen oder den Server zu manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unberechtigte Nutzung oder Administration von Samba",
            "handle": "2.3",
            "text": "Unbefugte können durch die Nutzung von Anwendungen oder IT-Systemen an vertrauliche Informationen gelangen, diese manipulieren oder Störungen verursachen. So ist es möglich, dass sie Samba unberechtigt administrieren können. Besonders kritisch ist es, wenn veraltete und nicht mehr aktualisierte Konfigurationswerkzeuge eingesetzt werden, wie z. B. das Samba Web Administration Tool (SWAT).",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Unberechtigter Zugriff auf Samba",
                    "type": "Threat",
                    "text": "Ein Angreifer kann sich unberechtigt Zugriff auf den Samba-Server verschaffen, um Daten zu stehlen, zu verändern oder den Server zu manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Fehlerhafte Administration von Samba",
            "handle": "2.4",
            "text": "Sind die Administrierenden mit den umfangreichen Komponenten, Funktionen, Optionen und Konfigurationseinstellungen von Samba zu wenig vertraut, kann dies zu weitreichenden Komplikationen führen. So können Fehlkonfigurationen des DNS oder des Berechtigungsmanagements dazu führen, dass Unbefugte auf Ressourcen zugreifen können. Des Weiteren kann dies zu Betriebsunterbrechungen führen oder es können schützenswerte Informationen offengelegt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Fehlkonfiguration von Samba",
                    "type": "Threat",
                    "text": "Ein Angreifer kann die Fehlkonfiguration von Samba ausnutzen, um auf sensible Daten zuzugreifen oder den Server zu manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Datenverlust bei Samba",
            "handle": "2.5",
            "text": "Ein Datenverlust wirkt sich erheblich auf den IT-Einsatz aus. Wenn institutionsrelevante Informationen zerstört oder verfälscht werden, können dadurch Geschäftsprozesse und Fachaufgaben verzögert oder gar nicht mehr ausgeführt werden. Bei Samba ist beispielsweise zu beachten, dass sich die Eigenschaften der Dateisysteme unter Windows und Unix erheblich voneinander unterscheiden. Deswegen ist nicht immer sichergestellt, dass die Zugriffsrechte unter Windows aufrechterhalten bleiben, unter Umständen können so wichtige Dateieigenschaften verloren gehen. Auch können dadurch Informationen zu sogenannten Alternate Data Streams (ADS) und DOS-Attributen verloren gehen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Datenverlust durch Fehler",
                    "type": "Threat",
                    "text": "Ein Angreifer kann Datenverlust durch Fehler oder Manipulationen verursachen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "accidental",
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Integritätsverlust schützenswerter Informationen bei Samba",
            "handle": "2.6",
            "text": "Samba selbst legt wichtige Betriebsdaten in Datenbanken im Trivial-Database-(TDB)-Format ab. Sollten diese Datenbanken vom Betriebssystem nicht ausreichend leistungsfähig und konsistent behandelt werden, können sie Probleme verursachen, wenn Samba-Dienste genutzt werden.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Datenbankfehler",
                    "type": "Threat",
                    "text": "Ein Angreifer kann Datenbankfehler ausnutzen, um Daten zu stehlen, zu verändern oder den Server zu manipulieren.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": []
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung des Einsatzes eines Samba-Servers",
            "handle": "APP.3.4.A1",
            "level": "Low",
            "affects": [],
            "text": "Der IT-Betrieb MUSS die Einführung eines Samba-Servers sorgfältig planen und regeln. Der IT-Betrieb MUSS abhängig vom Einsatzszenario definieren, welche Aufgaben der Samba-Server zukünftig erfüllen soll und in welcher Betriebsart er betrieben wird. Außerdem MUSS festgelegt werden, welche Komponenten von Samba und welche weiteren Komponenten dafür erforderlich sind.\nSoll die Cluster-Lösung CTDB (Cluster Trivia Data Base) eingesetzt werden, MUSS der IT-Betrieb diese Lösung sorgfältig konzeptionieren. Falls Samba die Active-Directory-(AD)-Dienste auch für Linux- und Unix-Systeme bereitstellen soll, MÜSSEN diese Dienste ebenfalls sorgfältig geplant und getestet werden. Des Weiteren MUSS das Authentisierungsverfahren für das AD sorgfältig konzipiert und implementiert werden. Die Einführung und die Reihenfolge, in der die Stackable-Virtual-File-System- (VFS)-Module ausgeführt werden, MUSS sorgfältig konzipiert werden. Die Umsetzung SOLLTE dokumentiert werden.\nSoll IPv6 unter Samba eingesetzt werden, MUSS auch dies sorgfältig geplant werden. Zudem MUSS in einer betriebsnahen Testumgebung überprüft werden, ob die Integration fehlerfrei funktioniert.",
            "isresponsible": "[IT-Betrieb]",
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Grundkonfiguration eines Samba-Servers",
            "handle": "APP.3.4.A2",
            "level": "Low",
            "affects": [],
            "text": "Der IT-Betrieb MUSS den Samba-Server sicher konfigurieren. Hierfür MÜSSEN unter anderem die Einstellungen für die Zugriffskontrollen angepasst werden. Das gleiche SOLLTE auch für Einstellungen gelten, welche die Leistungsfähigkeit des Servers beeinflussen.\nSamba MUSS vom IT-Betrieb so konfiguriert werden, dass Verbindungen nur von sicheren Hosts und Netzen entgegengenommen werden. Änderungen an der Konfiguration SOLLTEN sorgfältig dokumentiert werden, sodass zu jeder Zeit nachvollzogen werden kann, wer aus welchem Grund was geändert hat. Dabei MUSS nach jeder Änderung überprüft werden, ob die Syntax der Konfigurationsdatei noch korrekt ist.\nZusätzliche Softwaremodule wie SWAT DÜRFEN NICHT installiert werden.",
            "isresponsible": "[IT-Betrieb]",
            "mitigates": [
                "G 0.15",
                "G 0.23",
                "G 0.27",
                "G 0.28",
                "G 0.32"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration eines Samba-Servers",
            "handle": "APP.3.4.A3",
            "level": "Medium",
            "affects": [],
            "text": "Datenbanken im Trivial-Database-(TDB)-Format SOLLTEN NICHT auf einer Partition gespeichert werden, die ReiserFS als Dateisystem benutzt. Wird eine netlogon-Freigabe konfiguriert, SOLLTEN unberechtigte Benutzende KEINE Dateien in dieser Freigabe modifizieren können.\nDas Betriebssystem eines Samba-Servers SOLLTE Access Control Lists (ACLs) in Verbindung mit dem eingesetzten Dateisystem unterstützen. Zusätzlich SOLLTE sichergestellt werden, dass das Dateisystem mit den passenden Parametern eingebunden wird.\nDie Voreinstellungen von SMB Message Signing SOLLTEN beibehalten werden, sofern sie nicht im Widerspruch zu den existierenden Sicherheitsrichtlinien im Informationsverbund stehen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.23",
                "G 0.27",
                "G 0.30"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Vermeidung der NTFS-Eigenschaften auf einem Samba-Server",
            "handle": "APP.3.4.A4",
            "level": "Medium",
            "affects": [],
            "text": "Wird eine Version von Samba eingesetzt, die im New Technology File System (NTFS) keine ADS abbilden kann und sollen Dateisystemobjekte über Systemgrenzen hinweg kopiert oder verschoben werden, SOLLTEN Dateisystemobjekte KEINE ADS mit wichtigen Informationen enthalten.",
            "isresponsible": null,
            "mitigates": [
                "G 0.45",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration der Zugriffssteuerung bei einem Samba-Server",
            "handle": "APP.3.4.A5",
            "level": "Medium",
            "affects": [],
            "text": "Die von Samba standardmäßig verwendeten Parameter, mit denen DOS-Attribute auf das Unix-Dateisystem abgebildet werden, SOLLTEN NICHT verwendet werden. Stattdessen SOLLTE Samba so konfiguriert werden, dass es DOS-Attribute und die Statusindikatoren zur Vererbung (Flag) in Extended Attributes speichert. Die Freigaben SOLLTEN ausschließlich über die Samba-Registry verwaltet werden.\nFerner SOLLTEN die effektiven Zugriffsberechtigungen auf die Freigaben des Samba-Servers regelmäßig überprüft werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.32",
                "G 0.46"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration von Winbind unter Samba",
            "handle": "APP.3.4.A6",
            "level": "Medium",
            "affects": [],
            "text": "Für jedes Domänen-Konto einer Windows-Domäne SOLLTE im Betriebssystem des Servers ein Konto mit allen notwendigen Gruppenmitgliedschaften vorhanden sein. Falls das nicht möglich ist, SOLLTE Winbind eingesetzt werden, um Domänen-Konten in Unix-Konten umsetzen. Beim Einsatz von Winbind SOLLTE sichergestellt werden, dass Kollisionen zwischen lokalen Benutzenden in Unix und Benutzenden in der Domäne verhindert werden.\nDes Weiteren SOLLTEN die PAM (Pluggable Authentication Modules) eingebunden werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.32"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration von DNS unter Samba",
            "handle": "APP.3.4.A7",
            "level": "Medium",
            "affects": [],
            "text": "Wenn Samba als DNS-Server eingesetzt wird, SOLLTE die Einführung sorgfältig geplant und die Umsetzung vorab getestet werden. Da Samba verschiedene AD-Integrationsmodi unterstützt, SOLLTE der IT-Betrieb die DNS-Einstellungen entsprechend dem Verwendungsszenario von Samba vornehmen.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Konfiguration von LDAP unter Samba",
            "handle": "APP.3.4.A8",
            "level": "Medium",
            "affects": [],
            "text": "Werden die Benutzenden unter Samba mit LDAP verwaltet, SOLLTE die Konfiguration sorgfältig vom IT-Betrieb geplant und dokumentiert werden. Die Zugriffsberechtigungen auf das LDAP SOLLTEN mittels ACLs geregelt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.18",
                "G 0.32"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Konfiguration von Kerberos unter Samba",
            "handle": "APP.3.4.A9",
            "level": "Medium",
            "affects": [],
            "text": "Zur Authentisierung SOLLTE das von Samba implementierte Heimdal Kerberos Key Distribution Center (KDC) verwendet werden. Es SOLLTE darauf geachtet werden, dass die von Samba vorgegebene Kerberos-Konfigurationsdatei verwendet wird. Es SOLLTEN nur sichere Verschlüsselungsverfahren für Kerberos-Tickets benutzt werden.\nWird mit Kerberos authentisiert, SOLLTE der zentrale Zeitserver lokal auf dem Samba-Server installiert werden. Der NTP-Dienst SOLLTE so konfiguriert werden, dass nur autorisierte Clients die Zeit abfragen können.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherer Einsatz externer Programme auf einem Samba-Server",
            "handle": "APP.3.4.A10",
            "level": "Medium",
            "affects": [],
            "text": "Vom IT-Betrieb SOLLTE sichergestellt werden, dass Samba nur auf schadhafte Funktionen überprüfte und vertrauenswürdige externe Programme aufruft.",
            "isresponsible": null,
            "mitigates": [
                "G 0.19",
                "G 0.20",
                "G 0.28"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schulung der Administrierenden eines Samba-Servers",
            "handle": "APP.3.4.A12",
            "level": "Medium",
            "affects": [],
            "text": "Die Administrierenden SOLLTEN zu den genutzten spezifischen Bereichen von Samba wie z. B. Benutzendenauthentisierung, Windows- und Unix-Rechtemodelle, aber auch zu NTFS ACLs und NTFS ADS geschult werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.31"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Regelmäßige Sicherung wichtiger Systemkomponenten eines Samba-Servers",
            "handle": "APP.3.4.A13",
            "level": "Medium",
            "affects": [],
            "text": "Es SOLLTEN alle Systemkomponenten in das institutionsweite Datensicherungskonzept eingebunden werden, die erforderlich sind, um einen Samba-Server wiederherzustellen. Auch die Kontoinformationen aus allen eingesetzten Backends SOLLTEN berücksichtigt werden. Ebenso SOLLTEN alle TDB-Dateien gesichert werden. Des Weiteren SOLLTE die Samba-Registry mit gesichert werden, falls sie für Freigaben eingesetzt wurde.",
            "isresponsible": null,
            "mitigates": [
                "G 0.45"
            ]
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Verschlüsselung der Datenpakete unter Samba",
            "handle": "APP.3.4.A15",
            "level": "High",
            "affects": [
                "CI"
            ],
            "text": "Um die Sicherheit der Datenpakete auf dem Transportweg zu gewährleisten, SOLLTEN die Datenpakete mit den ab SMB Version 3 integrierten Verschlüsselungsverfahren verschlüsselt werden.",
            "isresponsible": null,
            "mitigates": [
                "G 0.15",
                "G 0.19",
                "G 0.46"
            ]
        }
    ]
}