{
    "Informationsource": "BSI GSK 2023",
    "name": "Speicherlösungen",
    "handle": "SYS.1.8",
    "text": "Das stetige Wachstum digitaler Informationen und die zunehmende Menge unstrukturierter Informationen führen dazu, dass innerhalb von Institutionen zentrale Speicherlösungen eingesetzt werden. Dabei unterliegen die Anforderungen an solche Speicherlösungen einem stetigen Wandel, der sich beispielsweise an folgenden Aspekten beobachten lässt: Die Daten einer Institution sollen jederzeit, an jedem Ort und für unterschiedliche Anwendungsszenarien verfügbar sein. Dadurch gelten für moderne Speicherlösungen häufig gestiegene Verfügbarkeitsanforderungen. Die zunehmende Digitalisierung sämtlicher Informationen in einer Institution macht es notwendig, dass weitreichende rechtliche Vorgaben (Compliance-Anforderungen) beachtet und eingehalten werden müssen. Speicherlösungen sollen dynamisch an die sich stetig ändernden Anforderungen anpassbar sein und Speicherplatz zentral bereitstellen können.",
    "vulnerableTo": [
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Unsichere Default-Einstellungen bei Speicherkomponenten",
            "handle": "2.1",
            "text": "Häufig werden Speicherkomponenten mit einer Default-Konfiguration ausgeliefert, damit die Geräte schnell und mit möglichst umfassenden Funktionen in Betrieb genommen werden können. So sind in vielen Geräten nicht benötigte Protokolle aktiviert, wie z. B. HTTP, Telnet und unsichere SNMP Versionen. Werden Speicherkomponenten mit unsicheren Werkseinstellungen produktiv eingesetzt, kann einfacher unberechtigt auf sie zugegriffen werden. Das kann dazu führen, dass z. B. Dienste nicht mehr verfügbar sind oder dass unerlaubt auf vertrauliche Informationen der Institution zugegriffen wird.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Zugriff auf Speicherkomponenten über unsichere Protokolle",
                    "type": "Threat",
                    "text": "Angreifer können versuchen, über unsichere Protokolle, die in der Default-Konfiguration aktiviert sind, auf die Speicherkomponenten zuzugreifen. Dies kann beispielsweise durch das Ausnutzen von Schwachstellen in den Protokollen oder durch das Abfangen von Datenverkehr geschehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A2"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Manipulation von Daten über das Speichersystem",
            "handle": "2.2",
            "text": "Über ein mangelhaft konfiguriertes Storage Area Network (SAN) können sich ungewollt Netze verbinden. Ist beispielsweise ein Server mit SAN-Anschluss aus dem Internet erreichbar und so von außen kompromittierbar, kann dieser als Einstiegspunkt genutzt werden, um unberechtigt auf schützenswerte Informationen zuzugreifen, die im SAN gespeichert sind. Da auf diese Weise alle Sicherheits- und Überwachungsmaßnahmen, wie Firewalls oder Intrusion Detection Systeme (IDS), in den Netzen einer Institution umgangen werden können, ist das Schadenspotenzial groß.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Kompromittierung eines Servers mit SAN-Anschluss",
                    "type": "Threat",
                    "text": "Ein Angreifer könnte einen Server mit SAN-Anschluss kompromittieren, indem er beispielsweise eine Schwachstelle im Server ausnutzt oder eine Malware installiert. Anschließend könnte der Angreifer den kompromittierten Server als Sprungbrett nutzen, um auf andere Systeme im SAN zuzugreifen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A14",
                "SYS.1.8.A15"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Verlust der Vertraulichkeit durch storagebasierte Replikationsmethoden",
            "handle": "2.3",
            "text": "Storagebasierte Replikationsmethoden haben den Zweck, gespeicherte oder archivierte Daten in Echtzeit über ein Speichernetz zu duplizieren und diese damit zusätzlich redundant abzuspeichern. Hierdurch sollen Datenverluste vermieden werden. Die automatisierte Replikation unverschlüsselter Daten birgt allerdings sowohl im eigenen Netz als auch bei der Nutzung öffentlicher Netze Risiken. So kann unberechtigt auf Replikationsverkehr zugegriffen werden, beispielsweise mittels FC-Analysern (FC-Replikation) oder Sniffern (IP-Replikation).",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Abfangen von Replikationsverkehr",
                    "type": "Threat",
                    "text": "Ein Angreifer könnte versuchen, den Replikationsverkehr zwischen den Speichersystemen abzuhören, um an die Daten zu gelangen. Dies könnte beispielsweise durch das Ausnutzen von Schwachstellen im Netzwerk oder durch das Abfangen von Datenverkehr geschehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A23"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Zugriff auf Informationen anderer Mandanten durch WWN Spoofing",
            "handle": "2.4",
            "text": "Geräte in einem FC-SAN werden intern über World Wide Names (WWNs) verwaltet und zugeordnet. Sie entsprechen in gewisser Weise den MAC-Adressen von Ethernet-Netzadaptern. Mittels Programmen, die durch das herstellende Unternehmen der Host Bus Adapter (HBA) zur Verfügung gestellt werden, kann der WWN eines HBAs geändert werden. Dadurch kann unberechtigt auf Daten zugegriffen werden. Die Manipulation von WWNs, auch als WWN-Spoofing bezeichnet, birgt für eine Institution erhebliches Gefahrenpotenzial. Insbesondere im Zusammenhang mit mandantenfähigen Speichersystemen können Unberechtigte auf die Informationen anderer Mandanten zugreifen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Spoofing der WWN eines HBAs",
                    "type": "Threat",
                    "text": "Ein Angreifer könnte versuchen, die WWN eines HBAs zu spoofen, um sich als ein anderes Gerät auszugeben und so Zugriff auf die Daten zu erhalten. Dies könnte beispielsweise durch das Ausnutzen von Schwachstellen im SAN oder durch das Abfangen von Datenverkehr geschehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A14",
                "SYS.1.8.A15"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Überwindung der logischen Netzseparierung",
            "handle": "2.5",
            "text": "Werden die Netzstrukturen unterschiedlicher Mandanten nicht durch physisch getrennte Netze, sondern durch virtuelle Storage Area Networks (VSANs) separiert, kann hierdurch die Informationssicherheit der Institution gefährdet werden. Gelingt es Angreifenden, in das Netz eines anderen Mandanten einzudringen, können sie sowohl auf das virtuelle SAN dieses Mandanten als auch auf die übertragenen Nutzdaten zugreifen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausnutzen von Schwachstellen in VSANs",
                    "type": "Threat",
                    "text": "Ein Angreifer könnte versuchen, Schwachstellen in der Konfiguration oder Implementierung von VSANs auszunutzen, um in das Netz eines anderen Mandanten einzudringen. Dies könnte beispielsweise durch das Ausnutzen von Sicherheitslücken in der Software oder durch das Abfangen von Datenverkehr geschehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A14",
                "SYS.1.8.A15"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Ausfall von Komponenten einer Speicherlösung",
            "handle": "2.6",
            "text": "Komplexe netzbasierte Speicherlösungen bestehen oft aus vielen Komponenten (z. B. FC-Switches, Storage Controller, Virtualisierungs-Appliance). Fallen einzelne Komponenten einer Speicherlösung aus, kann dies dazu führen, dass wichtige Anwendungen nicht mehr korrekt arbeiten und somit Datenverluste drohen.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Ausfall eines Storage Controllers",
                    "type": "Threat",
                    "text": "Ein Ausfall eines Storage Controllers kann dazu führen, dass die angeschlossenen Server keinen Zugriff mehr auf die Daten haben. Dies kann zu Datenverlusten führen, wenn die Daten nicht redundant gespeichert sind.",
                    "hasOrigin": [
                        "natural"
                    ],
                    "hasSource": [
                        "accidental"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A22"
            ]
        },
        {
            "type": "specific",
            "Informationsource": "BSI GSK 2023",
            "name": "Erlangung physischen Zugangs auf SAN-Switches",
            "handle": "2.7",
            "text": "Existieren in einer Institution unzureichende Zutritts- und Zugangskontrollen zu den Komponenten eines Speichersystems oder fehlen diese gänzlich, kann es gelingen, sich physischen Zugang zu vorhandenen Switches zu verschaffen bzw. zusätzliche FC-SAN-Switches an das Netz anzuschließen. Ziel bei einem solchen Angriff könnte es sein, auf die verteilte Zoning-Datenbank zuzugreifen, um diese so zu verändern, dass auf die Speichersysteme zugegriffen werden kann.",
            "exploitedBy_examples": [
                {
                    "Informationsource": "BSI GSK 2023",
                    "name": "Physischer Zugriff auf SAN-Switches",
                    "type": "Threat",
                    "text": "Ein Angreifer könnte versuchen, sich physischen Zugang zu den SAN-Switches zu verschaffen, um die Konfiguration zu manipulieren oder Daten abzufangen. Dies könnte beispielsweise durch das Ausnutzen von Sicherheitslücken in den Zugangskontrollen oder durch das Abfangen von Schlüsseln geschehen.",
                    "hasOrigin": [
                        "human"
                    ],
                    "hasSource": [
                        "deliberate"
                    ]
                }
            ],
            "mitigatedBy": [
                "SYS.1.8.A1",
                "SYS.1.8.A4"
            ]
        }
    ],
    "Controls": [
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Geeignete Aufstellung von Speichersystemen",
            "handle": "SYS.1.8.A1",
            "level": "Low",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Die IT-Komponenten von Speicherlösungen MÜSSEN in verschlossenen Räumen aufgestellt werden. Zu diesen Räumen DÜRFEN NUR Berechtigte Zutritt haben. Zudem MUSS eine sichere Stromversorgung sichergestellt sein. Die Vorgaben des herstellenden Unternehmens zur empfohlenen Umgebungstemperatur und Luftfeuchte MÜSSEN eingehalten werden.",
            "isresponsible": "Haustechnik"
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Grundkonfiguration von Speicherlösungen",
            "handle": "SYS.1.8.A2",
            "level": "Low",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Bevor eine Speicherlösung produktiv eingesetzt wird, MUSS sichergestellt sein, dass alle eingesetzten Softwarekomponenten und die Firmware aktuell sind. Danach MUSS eine sichere Grundkonfiguration hergestellt werden. Nicht genutzte Schnittstellen des Speichersystems MÜSSEN deaktiviert werden. Die Dateien zur Default-Konfiguration, zur vorgenommenen Grundkonfiguration und zur aktuellen Konfiguration SOLLTEN redundant und geschützt aufbewahrt werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Schutz der Administrationsschnittstellen",
            "handle": "SYS.1.8.A4",
            "level": "Low",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Alle Administrations- und Management-Zugänge der Speichersysteme MÜSSEN eingeschränkt werden. Es MUSS sichergestellt sein, dass aus nicht-vertrauenswürdigen Netzen heraus nicht auf die Administrationsschnittstellen zugegriffen werden kann. Es SOLLTEN als sicher geltende Protokolle eingesetzt werden. Sollten dennoch unsichere Protokolle verwendet werden, MUSS für die Administration ein eigenes Administrationsnetz (siehe NET.1.1 Netzarchitektur und -design) genutzt werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung einer Sicherheitsrichtlinie für Speicherlösungen",
            "handle": "SYS.1.8.A6",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Ausgehend von der allgemeinen Sicherheitsrichtlinie der Institution SOLLTE eine spezifische Sicherheitsrichtlinie für Speicherlösungen erstellt werden. Darin SOLLTEN nachvollziehbar Vorgaben beschrieben sein, wie Speicherlösungen sicher geplant, administriert, installiert, konfiguriert und betrieben werden können. Die Richtlinie SOLLTE allen für Speicherlösungen zuständigen Administrierenden bekannt und grundlegend für ihre Arbeit sein. Wird die Richtlinie verändert oder wird von den Vorgaben abgewichen, SOLLTE dies mit dem oder der ISB abgestimmt und dokumentiert werden. Es SOLLTE regelmäßig überprüft werden, ob die Richtlinie noch korrekt umgesetzt ist. Gegebenenfalls SOLLTE sie aktualisiert werden. Die Ergebnisse SOLLTEN sinnvoll dokumentiert werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Planung von Speicherlösungen",
            "handle": "SYS.1.8.A7",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Bevor Speicherlösungen in einer Institution eingesetzt werden, SOLLTE eine Anforderungsanalyse durchgeführt werden. In der Anforderungsanalyse SOLLTEN unter anderem die Themen Performance und Kapazität betrachtet werden. Auf Basis der ermittelten Anforderungen SOLLTE dann eine detaillierte Planung für Speicherlösungen erstellt werden. Darin SOLLTEN folgende Punkte berücksichtigt werden: Auswahl von herstellenden Unternehmen und Liefernden, Entscheidung für oder gegen zentrale Verwaltungssysteme (Management-Systeme), Planung des Netzanschlusses, Planung der Infrastruktur sowie Integration in bestehende Prozesse.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Auswahl einer geeigneten Speicherlösung",
            "handle": "SYS.1.8.A8",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Die technischen Grundlagen unterschiedlicher Speicherlösungen SOLLTEN detailliert beleuchtet werden. Die Auswirkungen dieser technischen Grundlagen auf den möglichen Einsatz in der Institution SOLLTEN geprüft werden. Die Möglichkeiten und Grenzen der verschiedenen Speichersystemarten SOLLTEN für die Verantwortlichen der Institution transparent dargestellt werden. Die Entscheidungskriterien für eine Speicherlösung SOLLTEN nachvollziehbar dokumentiert werden. Ebenso SOLLTE die Entscheidung für die Auswahl einer Speicherlösung nachvollziehbar dokumentiert werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Auswahl von Liefernden für eine Speicherlösung",
            "handle": "SYS.1.8.A9",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Anhand der spezifizierten Anforderungen an eine Speicherlösung SOLLTEN geeignete Liefernde ausgewählt werden. Die Auswahlkriterien und die Entscheidung SOLLTEN nachvollziehbar dokumentiert werden. Außerdem SOLLTEN Aspekte der Wartung und Instandhaltung schriftlich in sogenannten Service-Level-Agreements (SLAs) festgehalten werden. Die SLAs SOLLTEN eindeutig und quantifizierbar sein. Es SOLLTE genau geregelt werden, wann der Vertrag mit den Liefernden endet.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Erstellung und Pflege eines Betriebshandbuchs",
            "handle": "SYS.1.8.A10",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Es SOLLTE ein Betriebshandbuch erstellt werden. Darin SOLLTEN alle Regelungen, Anforderungen und Einstellungen dokumentiert werden, die erforderlich sind, um Speicherlösungen zu betreiben. Das Betriebshandbuch SOLLTE regelmäßig aktualisiert werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherer Betrieb einer Speicherlösung",
            "handle": "SYS.1.8.A11",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Das Speichersystem SOLLTE hinsichtlich der Verfügbarkeit der internen Anwendungen, der Systemauslastung sowie kritischer Ereignisse überwacht werden. Weiterhin SOLLTEN für Speicherlösungen feste Wartungsfenster definiert werden, in denen Änderungen durchgeführt werden können. Insbesondere Firmware- oder Betriebssystemupdates von Speichersystemen oder den Netzkomponenten einer Speicherlösung SOLLTEN ausschließlich innerhalb eines solchen Wartungsfensters durchgeführt werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Überwachung und Verwaltung von Speicherlösungen",
            "handle": "SYS.1.8.A13",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Speicherlösungen SOLLTEN überwacht werden. Dabei SOLLTEN alle erhobenen Daten (Nachrichten) vorrangig daraufhin geprüft werden, ob die Vorgaben des Betriebshandbuchs eingehalten werden. Die wesentlichen Nachrichten SOLLTEN mit Nachrichtenfilter herausgefiltert werden. Einzelne Komponenten der Speicherlösung und des Gesamtsystems SOLLTEN zentral verwaltet werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung eines SANs durch Segmentierung",
            "handle": "SYS.1.8.A14",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Ein SAN SOLLTE segmentiert werden. Es SOLLTE ein Konzept erarbeitet werden, das die SAN-Ressourcen den jeweiligen Servern zuordnet. Hierfür SOLLTE anhand der Sicherheitsanforderungen und des Administrationsaufwands entschieden werden, welche Segmentierung in welcher Implementierung (z. B. FC-SANs oder iSCSI-Speichernetze) eingesetzt werden soll. Die aktuelle Ressourcenzuordnung SOLLTE mithilfe von Verwaltungswerkzeugen einfach und übersichtlich erkennbar sein. Weiterhin SOLLTE die aktuelle Zoning-Konfiguration dokumentiert werden. Die Dokumentation SOLLTE auch in Notfällen verfügbar sein.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sichere Trennung von Mandanten in Speicherlösungen",
            "handle": "SYS.1.8.A15",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Es SOLLTE definiert und nachvollziehbar dokumentiert werden, welche Anforderungen die Institution an die Mandantenfähigkeit einer Speicherlösung stellt. Die eingesetzten Speicherlösungen SOLLTEN diese dokumentierten Anforderungen erfüllen. Im Block-Storage-Umfeld SOLLTE LUN Masking eingesetzt werden, um Mandanten voneinander zu trennen. In Fileservice-Umgebungen SOLLTE es möglich sein, mit virtuellen Fileservern zu agieren. Dabei SOLLTE jedem Mandanten ein eigener Fileservice zugeordnet werden. Beim Einsatz von IP oder iSCSI SOLLTEN die Mandanten über eine Segmentierung im Netz voneinander getrennt werden. Wird Fibre Channel eingesetzt, SOLLTE mithilfe von VSANs und Soft-Zoning separiert werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicheres Löschen in SAN-Umgebungen",
            "handle": "SYS.1.8.A16",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "In mandantenfähigen Speichersystemen SOLLTE sichergestellt werden, dass Logical Unit Numbers (LUNs), die einem bestimmten Mandanten zugeordnet sind, gelöscht werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Dokumentation der Systemeinstellungen von Speichersystemen",
            "handle": "SYS.1.8.A17",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Alle Systemeinstellungen von Speichersystemen SOLLTEN dokumentiert werden. Die Dokumentation SOLLTE die technischen und organisatorischen Vorgaben sowie alle spezifischen Konfigurationen der Speichersysteme der Institution enthalten. Sofern die Dokumentation der Systemeinstellungen vertrauliche Informationen beinhaltet, SOLLTEN diese vor unberechtigtem Zugriff geschützt werden. Die Dokumentation SOLLTE regelmäßig überprüft werden. Sie SOLLTE immer aktuell sein.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherheitsaudits und Berichtswesen bei Speichersystemen",
            "handle": "SYS.1.8.A18",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Alle eingesetzten Speichersysteme SOLLTEN regelmäßig auditiert werden. Dafür SOLLTE ein entsprechender Prozess eingerichtet werden. Es SOLLTE geregelt werden, welche Sicherheitsreports mit welchen Inhalten regelmäßig zu erstellen sind. Zudem SOLLTE auch geregelt werden, wie mit Abweichungen von Vorgaben umgegangen wird und wie oft und in welcher Tiefe Audits durchgeführt werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Aussonderung von Speicherlösungen",
            "handle": "SYS.1.8.A19",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Werden ganze Speicherlösungen oder einzelne Komponenten einer Speicherlösung nicht mehr benötigt, SOLLTEN alle darauf vorhandenen Daten auf andere Speicherlösungen übertragen werden. Hierfür SOLLTE eine Übergangsphase eingeplant werden. Anschließend SOLLTEN alle Nutzdaten und Konfigurationsdaten sicher gelöscht werden. Aus allen relevanten Dokumenten SOLLTEN alle Verweise auf die außer Betrieb genommene Speicherlösung entfernt werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Notfallvorsorge und Notfallreaktion für Speicherlösungen",
            "handle": "SYS.1.8.A20",
            "level": "Medium",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Es SOLLTE ein Notfallplan für die eingesetzte Speicherlösung erstellt werden. Der Notfallplan SOLLTE genau beschreiben, wie in bestimmten Notfallsituationen vorzugehen ist. Auch SOLLTEN Handlungsanweisungen in Form von Maßnahmen und Kommandos enthalten sein, die die Fehleranalyse und Fehlerkorrektur unterstützen. Um Fehler zu beheben, SOLLTEN geeignete Werkzeuge eingesetzt werden. Regelmäßige Übungen und Tests SOLLTEN anhand des Notfallplans durchgeführt werden. Nach den Übungen und Tests sowie nach einem tatsächlichen Notfall SOLLTEN die dabei erzeugten Daten sicher gelöscht werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von Speicherpools zur Trennung von Mandanten",
            "handle": "SYS.1.8.A21",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Mandanten SOLLTEN Speicherressourcen aus unterschiedlichen sogenannten Speicherpools zugewiesen werden. Dabei SOLLTE ein Speichermedium immer nur einem einzigen Pool zugewiesen werden. Die logischen Festplatten (LUNs), die aus einem solchen Pool generiert werden, SOLLTEN nur einem einzigen Mandanten zugeordnet werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz einer hochverfügbaren SAN-Lösung",
            "handle": "SYS.1.8.A22",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Eine hochverfügbare SAN-Lösung SOLLTE eingesetzt werden. Die eingesetzten Replikationsmechanismen SOLLTEN den Verfügbarkeitsanforderungen der Institution an die Speicherlösung entsprechen. Auch die Konfiguration der Speicherlösung SOLLTE den Verfügbarkeitsanforderungen gerecht werden. Außerdem SOLLTE ein Test- und Konsolidierungssystem vorhanden sein.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Einsatz von Verschlüsselung für Speicherlösungen",
            "handle": "SYS.1.8.A23",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Alle in Speicherlösungen abgelegten Daten SOLLTEN verschlüsselt werden. Es SOLLTE festgelegt werden, auf welchen Ebenen (Data-in-Motion und Data-at-Rest) verschlüsselt wird. Dabei SOLLTE beachtet werden, dass die Verschlüsselung auf dem Transportweg auch bei Replikationen und Backup-Traffic relevant ist.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Sicherstellung der Integrität der SAN-Fabric",
            "handle": "SYS.1.8.A24",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Um die Integrität der SAN-Fabric sicherzustellen, SOLLTEN Protokolle mit zusätzlichen Sicherheitsmerkmalen eingesetzt werden. Bei den folgenden Protokollen SOLLTEN deren Sicherheitseigenschaften berücksichtigt und entsprechende Konfigurationen verwendet werden: Diffie Hellman Challenge Handshake Authentication Protocol (DH-CHAP), Fibre Channel Authentication Protocol (FCAP) und Fibre Channel Password Authentication Protocol (FCPAP).",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Mehrfaches Überschreiben der Daten einer LUN",
            "handle": "SYS.1.8.A25",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "In SAN-Umgebungen SOLLTEN Daten gelöscht werden, indem die zugehörigen Speichersegmente einer LUN mehrfach überschrieben werden.",
            "isresponsible": ""
        },
        {
            "Informationsource": "BSI GSK 2023",
            "name": "Absicherung eines SANs durch Hard-Zoning",
            "handle": "SYS.1.8.A26",
            "level": "High",
            "affects": [
                "Availability",
                "Confidentiality",
                "Integrity"
            ],
            "text": "Um SANs zu segmentieren, SOLLTE Hard-Zoning eingesetzt werden.",
            "isresponsible": ""
        }
    ]
}